[{"id":207987,"name":"Homeless: Life Simulator","genres":[],"avg_score":0.0,"description":"This game is a simulator of a life of homeless man.\nYour task is to maintain and improve his life, moving up the career ladder, or become criminal.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207988,"name":"Join the Pack","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207989,"name":"Craft the World: Episodes Edition","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Craft the World is a unique sandbox strategy game, the mix of Dungeon Keeper, Terraria and Dwarf Fortress. Explore a random generated world populated by dangerous creatures, build a dwarf fortress, gather resources, and craft all the items, weapons, and armor you need. Episodes Edition contains only first world, additional words are available through in app purchases.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207990,"name":"Pocket Guild Game","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Recruit members, take down bosses, and lead your guild to glory!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207991,"name":"Muscle Princess 2","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207992,"name":"Kahmate","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Designed for two players, Kahmate is the first rugby board game that can be played on iPad, iPhone and iPod Touch.\n\nPosition your players intelligently to hinder the advancement of the opposing team, and at the same time facilitate your own strategy. Manage the fitness of your team with the help of the Fitness Cards. Pass the ball, push your way through with a hand-off, tackle or intercept a pass and then score a try. This very simple little game is a concentration of tactics and anticipation. It is fluid, rapid, and tense. It is not a simulation, yet the sensations experienced are very real.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207993,"name":"Gun & Dungeons","genres":[],"avg_score":0.0,"description":"The rules are simple: you must survive the treacherous dungeons, filled with hordes of nasty monsters. If you reach the end, you will face an even more powerful monster. The reward for defeating the boss? A huge loot pile and… another dungeon, of course, this is how sinister this competition is!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207994,"name":"Incoherence","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Enter the mind of Jason Bethlam as he awakes to a brightly lit room. With an assortment of items, a camera, and no memory of how you got there you’ll need to photograph everything and solve puzzles to piece together the mystery of what happened and escape.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6alq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207995,"name":"Battle Map 2","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Take your adventure to the next level! Battle Map 2 will beautify tiles, calculate line of sight, and reveal traps - on your device, or on an external display!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207996,"name":"Faty's Different World","genres":[],"avg_score":0.0,"description":"This is a stand-alone game. You will be summoned to a different world to defeat the demon king. But you can choose to adventure freely in this world.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207997,"name":"Pet Rock","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"The official Pet Rock featured in “Minions: The Rise of Gru” is now available on the iPhone & iPad.\nAdopt a Pet Rock to nurture from a baby to an adult by regularly feeding, cleaning disciplining, and playing with it.\nIn order to help you do this you need to regularly check your Pet Rock's vitals with the real-time monitor which easily displays your Pet Rock's vital stats and what needs attending too.\nKeep your Pet Rock happy by playing the included Rock Paper Scissors mini bonus game with it.\nYour Pet Rock lives in your time zone, when it's night for you, it’s night in Pet Rock World, no matter where in the World you live.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zf6.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":207998,"name":"Void-X","genres":[],"avg_score":0.0,"description":"Void-x is an intense arcade shoot em up, with bullet hell style bosses and a unique retro aesthetic. Try to stay alive as you work your way through epic boss fights, gathering powerups, and keeping that combo going for a high score!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":207999,"name":"Loco Looper","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Trains. Fluffy Clouds. Planets. Stars. Even a seagull. Cute, tricky cerebral fun.\nGet on the brain train with this original puzzle game!\nMake a perfect track using all the pieces.\nThe harder the level, the more ways to solve.\nHandcrafted levels, each a pen & ink style love letter to mini dioramas and trains.\nA neat 3D effect makes the game naturally POP when holding your device (no face tracking required).\nLoco Looper is designed and written for iPhone & iPad using Swift and Metal.\nMove fast and make nice things!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208000,"name":"Boom Mania","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Boom Mania is an action-adventure game where you hunt down a variety of enemies while trying to save the goblin world. Explore nine beautiful hand-crafted environments and prove your bomber-goblin skills! All levels are procedurally generated, so each run is a unique experience.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208001,"name":"The Sea of Death","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Sea of Death is a mystery puzzle adventure in which the story revolves around the people and experiences that the protagonist, who has lost his memory due to an accident, meets in the process of regaining his memory.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6fbc.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Hoit Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208002,"name":"Domination Wars","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Enjoy tiny huge battles and dominate the enemy. Set up your strategy deck, chop some wood, build your barracks and raise an army in this fast paced RTS!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208003,"name":"Lava Crew","genres":[],"avg_score":0.0,"description":"In the year 2124, you are the sole survivor of a team of elite planetary surveyors, tasked with stabilizing newly formed planets for habitation.\nThe problem is, you have nothing but a few moss clumps, a pool of water, and your own lightning fast reflexes standing between you and an\nendless hoard of Lava Beasts bent on your destruction! How long can YOU hold out?\nFeaturing classic, overhead 2D, arcade-action, requiring seriously extreme finger-flicking reflexes! This is NOT a game for people who content themselves\nwith playing Solitaire!\nThou hast been warned!\nCompletely fair gameplay. No unfair advantage given to the enemy, in higher difficulties.\nEvery difficulty is a new game unto itself, with different music, more levels, and different challenges to face.\nThis is a game of true finger-swiping endurance!\nBeat the highest difficulty, to see the Epilogue and discover what rewards await you, for completing the game!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208004,"name":"Return of Serenity","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A visual novel of sorts. A bite-sized interactive story. One that I've been wanting to tell for a while. Hope you like it.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208005,"name":"Lifeline: Beside You in Time","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"After a lengthy radio silence, Taylor returns at last! This brand new adventure finds the hapless astronaut on the other side of a black hole, relying on you alone to help make life-or-death decisions in a playable, branching story of survival in the depths of unknown space.\n\nBut this time, there’s a twist: Players can also choose to communicate with T2, Taylor’s time-warped, alien-infected “evil twin,” helping or hindering as they see fit. Throughout the story, seemingly simple decisions can have profound effects. Make choices using your Phone or Watch, and face the consequences alongside the desperate astronauts.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8vbq.jpg","releaseYear":2022,"developers":[{"id":0,"name":"3 Minute Games, LLC","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208006,"name":"The Lost Lands: Dinosaur Hunter","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"In all verity The Lost Lands: Dinosaur Hunter is one of the most lovely simulators of Dinosaur Hunter. You'll have to investigate the most secretive object in the world called \"The Lost Lands\". To meet with living dinosaurs, which became extinct hundreds millions years ago. To see the T-Rex and to feel the death's breath. The world of The Lost Lands: Dinosaur Hunter is waiting for you!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208007,"name":"Ice Cream Disaster","genres":[],"avg_score":0.0,"description":"Play the free offline arcade game Ice Cream Disaster! Don't let your ice cream cone collapse while you keep catching and stacking as many ice cream scoops as you can. As you catch more ice cream scoops, they keep stacking and piling up, making it harder to keep the balance of your ice cream cone. Better eat your ice cream cone before your scoops fall or you'll end up loosing your chip points!\n\nBalance will be harder to maintain when all kinds of obstacles start falling as you advance in the game. Pigeons, cockatoos, frisbees, shooting stars, christmas elves and even satellites and aliens! You'll have to perfect your skills to achieve the highest score by catching as much ice cream as you can and avoiding the bizarre and nasty obstacles.\n\nMake use of chocolate syrups, almond toppings or lollipops to make a steadier ice cream cone or get more points. Meet nine cute characters and unwrap a funny story about the mysterious Legendairy flavours and a silly turtle looking for them. Visit nine colourful levels and collect the rarest ice cream flavours that each of them hide. Buy and improve by upgrading nine different ice cream cones to achieve combos, extra games, higher bonuses and advance in your game faster.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208008,"name":"Hidden Object: Hunters for the Secret","genres":[],"avg_score":0.0,"description":"Welcome to Hunters for the Secret is a fascinating hidden object puzzle adventure game that mixes hidden object hunts with mini-games. It was developed by a team of professionals including: script writers, artists, and real-life wizards created a unique magical setting. Together they created enthralling game play and the magical aura of Hidden Object: Hunters for the Secret!!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208009,"name":"Mexiball","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sharpen your mind with the latest mind-bender from Donut Games, a hot & spicy puzzle game where you sort, roll and connect balls to clear them off the board.\nThe rules are easy! Just drag the balls with your finger and match them using as few moves as possible.\nHowever, things start to get tricky once lasers, colorizers, gates and other fun elements get thrown into the mix.\nNo time for siesta, come on and join the fun!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208010,"name":"Heal: Pocket Edition","genres":[],"avg_score":0.0,"description":"Guide an old man through the dark and atmospheric world of Heal in this abstract 2D puzzle-adventure point-and-click game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208011,"name":"Agent Sorry","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Stop Agent Sorry from downloading your files. The only way to do this is to nuke'em!\nUsing the Accelerometer on your phone, tilt and match the circle to stop the download. If you don't get there in time, then it's game over.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208012,"name":"Link of Hearts","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8nwz.jpg","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208013,"name":"GermCraft Deluxe","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208014,"name":"Franken Girl","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208015,"name":"DeckMake Fantasy","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208016,"name":"Lowlife","genres":[],"avg_score":0.0,"description":"All you gotta do is heal.\nTake control of Lowlife and heal your downloaded Scripts as you scour a corrupt, dystopian future. Your goal is not to hurt the countless Villains you will face spanning across several dungeons, it is to keep your party alive so they can do the hurting, by any means necessary.\nThroughout your dungeon dives you will incept Memories which can be used to trade for new Scripts - or if you have downloaded Scripts with their own god rolled skills, level them up too! Sell your extra Scripts in the Auction House for extra Memories to spend.\nThere are 35 uniquely skilled subclasses of Scripts to be found, including Tanks and Melee DPS to place on your front line, Mages and Ranged DPS for your back line, and Shamans - a wildcard class that can be placed anywhere in your party setup.\nLowlife places you in battle with a variety of weak and powerful Villains, equipped with only a variety of healing spells to keep everyone (and yourself!) alive. Spend your gained Parameter Points to build the perfect healer and fit your play style and sprinkle a little icing on top by spending Node Points in one of three skill trees.\nComplete Quests and level up to gain access to a variety of dungeons with Bosses and challenges that await you. When you feel confident enough, team up online to take down a Raid Boss or two.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208017,"name":"Crossword Dungeon","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Descend into the Crossword Dungeon, where every level is made up of a procedurally-generated crossword, and each letter guarded by a vile monster you must best!\nGuess the correct letter to instantly dispatch the monster, or risk combat damage if incorrect.\nTest your wits against crosswords of increasing complexity and monsters with deadly abilities with one of three classes with their own unique skills:\nThe Barbarian, a muscled berserker who lives for the thrill of battle and feeds his rage with the blood of his enemies.\nThe Ranger, a feared hunter who uses a deadly combination of marksmanship and tracking instincts.\nAnd the Scoundrel, a ne'er-do-well who makes the best of limited resources and subverts enemies' defenses with stealth attacks.\n...each in search of riches and glory beneath the Crossword Dungeon.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208018,"name":"Jurassic World: Primal Ops","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Rescue, collect, and fight alongside your favorite dinosaurs in Jurassic World: Primal Ops, a thrilling top-down action-adventure game with a deep dinosaur collection system. As a battle-trained dinosaur handler, use your expertise and combat skills to save dinosaurs from malicious mercenaries, deadly poachers, and sinister laboratories. Collect, build a roster to deploy in battle, and help your new companions safely find their place in a primal world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co52j2.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Behaviour Interactive","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208019,"name":"Recoil Gunner","genres":[],"avg_score":0.0,"description":"Destroy enemies with your enhanced ship and precise shooting.\nShoot enemies while moving with the recoil of your gun, slingshot action.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208020,"name":"Wrist Nebula","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Wrist Nebula is a space battle adventure game. It is an Apple Watch exclusive so you can play on the go, or when ever you are stuck in one place for hours. Save the galaxy from astroids, ships, and bosses using your unique ships and abilities. Can you collect all of the ships?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208021,"name":"Gale of Windoria","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Soar on the breezes around the world in your flying Beakle, upgradable with parts to spread your accessible areas. Make use of the elementals not only in turn-based battles, but in dungeon gimmicks as well by combining character abilities. Find also the Quartzes to strengthen your party, acquire skills and techniques. Not to forget the entire world drawn with nostalgic pixel artworks!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co52n3.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Hit-Point","games":null},{"id":0,"name":"Kemco","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 4"}]},{"id":208022,"name":"Avolteha","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Avolteha is a classic point-&-click adventure game for the whole family.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7wr0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":208023,"name":"Raven","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Raven is a scenic, single-player card game where you work on a team with the computer to trump your AI opponents. As you play through the rounds, the scenery changes and so do the card colors. Play until the winning score is reached while looping through the serene, atmospheric backgrounds. Raven includes automatic card dealing, sorting, bid-tracking and point counting, so you never miss a beat.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208024,"name":"Overrun: Zombie Base Defense","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Overrun the way it was meant to be played. No in app purchases, no ads. Buy once, play forever. Overrun throws you into a post apocalyptic world to manage a group of survivors while they are bombarded by attacking zombies in waves. Build the ultimate defense to hold them back. Use grenades, first aid kits, and other useful items to help your survivors while they fight for their lives.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208025,"name":"Colony: A Space RPG","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Command a mission to colonize new worlds! Build your deck to defend against pirates, rebels, royals, and more!\n\nColony is a text-based, deck-building, choose-your-own-adventure RPG. Set far in the future, your mission is to terraform an uninhabitable rock into a lush paradise. Along the way, you will encounter space pirates, kind travelers, galactic royalty, and more! Build a deck of powerful lasers, missiles, squads, and more to defend your Colony from all kinds of threats.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208026,"name":"Tropical Resort Story","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Build accommodation for your guests and get those tourists coming! Make the environment even nicer and discover great travel packages to give visitors the best vacation possible. Develop the resort to make your guests' dreams come true!\nOn this ocean island, the sparkling sea is a huge attraction of itself. There's a huge variety of incredible fish waiting to be discovered! Try improving water quality by placing marine plants and rocks in the ocean, and releasing fish you've caught while fishing - you may attract new fishy residents!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7imp.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"}]},{"id":208027,"name":"Mr. Presidents","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The world is your oyster as you assume the role of the most powerful person in the country. Swipe your presidential fingers left or right to impose your will upon Eagletopia as you listen to requests from your friends, enemies, multiple stooges, and people from both sides of the coin. With each request able to tip the scales, it is up to you to extend your presidential reign for as long as possible; you may lead Eagletopia to success or plunge it into the dark ages… The choice is all yours.\nPerform a balancing act to please the people, the army, and the treasury while skirting the lines between a liberal or a conservative rule. All the while, combat forces that threaten to usurp you from the shadows through careful planning and forging the right alliances; do you have what it takes to sell your soul for success?\nEagle Sized Equipment: Need to expand your rule to space? Want to nuke an annoying neighbor? Earn the right equipment to climb up the ladder of power and exercise your right across the world!\nDaring Debates: Said something that needs defending? Engage in a debate to win special items, favors, and swing the vote your way… Or make them even worse.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208028,"name":"In Sync: 2 Fun Balls","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"In Sync is a super fun offline single-player puzzle game where you control two balls, which are in sync. Make a move and they will both roll in the same direction. You must have a steady hand to roll them around the traps, through the gaps, and on the winding paths at the top of the walls at the same time.\n\nChallenge yourself with this addictive tricky puzzle game, where you have to be resourceful to find the right path to victory. All levels are unique, and will provide you with lots of fun.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208029,"name":"Quiz Minister","genres":[{"id":0,"name":"Quiz/Trivia","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ycl.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Granzella","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Android"}]},{"id":208030,"name":"Beat Slug Hyperway","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Blast through space in this slug filled infinite runner! Score points, unlock power ups, buy upgrades, and customize your colours on your slug kicking rampage.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bjk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208031,"name":"Idle Death Knight","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208032,"name":"Wild Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208033,"name":"Pocket Arcade Story DX","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Create your own video game arcade\nPocket Arcade returns better than ever before. Kairobot has been hard at work carefully tweaking the game balance and improving graphics!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8uyp.jpg","releaseYear":2019,"developers":[{"id":0,"name":"Kairosoft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208034,"name":"Ayakashi Rumble","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208035,"name":"Trial Xtreme 4 Remastered","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208036,"name":"Hundredth","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208037,"name":"Kairo Land","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Kairo Land comes with demos, minigames, and all the latest news and game info!\nRight now Kairo Land is compatible with Pool Slide Story, 8-Bit Farm, Grand Prix Story, The Manga Works, Venture Towns, Pocket Clothier, Pocket League Story and Kairobotica.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8uyq.jpg","releaseYear":2018,"developers":[{"id":0,"name":"Kairosoft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208038,"name":"Catch Idle: Dimension Warp Story","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208039,"name":"Elemental World","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"In this fascinating action adventure RPG with roguelike elements and great pixel art graphics you explore randomized worlds by combining the elements to cast powerful spells.\n\nUse the environment and improve your skills to defeat the hordes of monsters lurking within. Find powerful items, meet strange creatures and play different unique classes in your quest to solve the mysteries of the Elemental World.\nChallenge your friends for a brawl or let them join your quest in amazing games!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co71qq.jpg","releaseYear":2023,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208040,"name":"Game Type DX","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Help Hoodie Girl fight the evil MediaBall's inane advertisements! It's a high score shooter in which each loop increases the speed and difficulty!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5f9x.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":208041,"name":"GemaBoy: Zero Origins","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Explore inner conscience & multiverse in order to recover your memories and become GemaBoy!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4z0a.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208042,"name":"Monster Hunter Rise + Sunbreak: Deluxe Edition","genres":[],"avg_score":0.0,"description":"Experience Monster Hunter Rise and its massive expansion Monster Hunter Rise: Sunbreak in one convenient set!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co66hh.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208043,"name":"3 in 1: Logical Bundle","genres":[],"avg_score":0.0,"description":"Pack of three logic games.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208044,"name":"2 in 1: Monumental Bundle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208045,"name":"Nirvana Pilot Yume: Deluxe Edition","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Jump to 3080, experience romances and compete in high-speed races! All this in the atmosphere of a synth-wave soundtrack!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zf8.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"}]},{"id":208046,"name":"Mega Bundle: Cats","genres":[],"avg_score":0.0,"description":"Incredible! Several games in this mega bundle.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208047,"name":"The Sinking City: Whisper of Darkness Pass","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A conceptual three-volume DLC pack (Worshippers of the Necronomicon. Merciful Madness, and Investigator Pack) will walk you through amazing and chilling Lovecraftian stories and will get you to the edge of sanity and hidden corners of the human soul.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8vv1.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Frogwares","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208049,"name":"Galactic Pioneer","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Based on the classic Lander games that were made popular during the 1980's, in Galactic Pioneer you must navigate an exploration module across ten varied and increasingly difficult planets with limited fuel and even more limited lives.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ylf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208051,"name":"Wreckfest: Vehicle Bundle 1","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Wreckfest: Vehicle Bundle 1 includes 20 new vehicles, 20 roof decorations, and car customisation packs with new armour, rims, and more.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8sav.jpg","releaseYear":2022,"developers":[{"id":0,"name":"THQ Nordic","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208052,"name":"Wreckfest: Vehicle Bundle 2","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Wreckfest: Vehicle Bundle 2 includes new vehicles to the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8saw.jpg","releaseYear":2022,"developers":[{"id":0,"name":"THQ Nordic","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208053,"name":"Three Kingdoms: Hero Wars","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Hundreds of Legendary Heroes, Explore An Epic World.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9gnt.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":208054,"name":"Otherworld Heroes","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208055,"name":"Phyrexia","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208056,"name":"33 Seconds","genres":[],"avg_score":0.0,"description":"A short puzzle game, even a little scary.\n\nYou have 33 seconds to defuse the bomb.\n\nGood Luck!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co84bu.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":208057,"name":"Chaos Academy","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7jjf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208058,"name":"Anicca","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208059,"name":"Hit","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208060,"name":"Mr Ninja","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208061,"name":"Yongbi M","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208062,"name":"Wits of Gods","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Wits of Gods is a multiplayer turn-based strategy card game. The game uses a shared deck and you do NOT need to build a deck. The rules are simple. Play your hand during your turn to operate your deity and up to 3 pets. We recommend that you start with a 2V2 mode (2 players vs 2 players).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5iap.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208063,"name":"Dodgeball Duel","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208064,"name":"Zombie Frontier 4","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Zombie Frontier 4 is the latest established sequel of the Zombie Frontier series. It is a first-person zombie shooting and action battle game. An easy control interface that brings you into an amazing sniper FPS shooting and killing game. Experience the feeling of a real apocalypse, kill zombies with legendary 3D weapons and watch those undead limbs explode. Join and fight against the zombie apocalypse!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8tw5.jpg","releaseYear":2021,"developers":[{"id":0,"name":"FT Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208065,"name":"Star Skater","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Don’t just cross the road, own it! Grab your board and be the Star Sk8r in the new game from Halfbrick Studios!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8naz.jpg","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":208066,"name":"Sumikkogurashi Farm","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"This is a farm game where you can relax with Sumikkogurashi. Grow crops with Sumikkogurashi, make your favorite snacks, put up chairs to rest, or just enjoy creating your own wonderful farm and enjoy a your time with Sumikkogurashi.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co76ov.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208067,"name":"Yulgang Rush","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208068,"name":"Mutant: War of Mercenaries","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208069,"name":"Pop Battle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208070,"name":"Horror Hunt: Until Daylight","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208071,"name":"Ellie: Help me out, please...","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Ellie - Help me out, please… is a free mystery horror puzzle game for mobile devices that challenges you to help Ellie find a way out from the room she is trapped in.\n\nWill you leave Ellie to her dark fate? Can you find the way out? Work together with Ellie to locate and use items that solve puzzles which will lead to her escape. You may also find the true secret that is hidden in this horror...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8sy9.jpg","releaseYear":2012,"developers":[{"id":0,"name":"Ateam Entertainment Inc.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208072,"name":"Nuclear Submarine inc","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208073,"name":"Soul Launcher","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208074,"name":"Road to Valor: Empires","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Command your own mythical army!\nRoad to Valor: Empires is a real-time PVP strategy game where you can compete with players around the globe while commanding mythical gods, beasts, and heroes.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208076,"name":"Ninja Relo","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208077,"name":"Live in the Moment","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208078,"name":"Metal Swat","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208079,"name":"Life in Adventure","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"'Life in Adventure' is a text-based game written by the creator of 'Life is a game'.\nYou became an adventurer in D&D style fantasy, encountered various events and you have to choose what to do.\n\nThe events and options you will face include a variety of conditions, such as your ability, items, assets, choices made in the past, work to produce additional results.\nCan you achieve the goals you had when you started your adventure?\nOr will end your life as an ordinary adventurer?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co86qy.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Studio Wheel","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208080,"name":"Vanguard Online: Battlefield","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208081,"name":"Memories of Wilderness","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208082,"name":"Time and Summon","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"MOBA","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208083,"name":"Celestial Fate","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208084,"name":"Chaos Mecha","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208085,"name":"Nuke City","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208086,"name":"Lamb Fountain and Dungeon","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Gather allies, dive into the dungeon, and rescue the captive girl, ラム! An idle RPG that can be enjoyed in your spare time!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co909y.jpg","releaseYear":-1,"developers":[{"id":0,"name":"R&SGames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":208087,"name":"Endless Ark","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208088,"name":"Pocket World: Island of Adventure","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208089,"name":"Krazy Kakoom","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208090,"name":"The Dead Inside","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208091,"name":"Savior Fantasy","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A steampunk and fantasy MMORPG.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7am1.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Eyougame","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208092,"name":"Sanguo Doki","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208093,"name":"Legendary Fighter: Battle of God","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208094,"name":"Madtale","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Madtale is a time-saving and strategic idle RPG with a dark fairytale theme. Embark on the enchanted adventure with Little Red Riding Hood.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6o6g.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Archosaur Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208095,"name":"Cyber Gunner","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208096,"name":"Machinist","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A game production platform based on 3D physics engine and building block logic programming. Players who like creating games and assembling machinery can design a rich variety of custom games without having to learn and memorize complex commands and gain profit through the in-app purchase system.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co67rw.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208097,"name":"DunkForce","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208098,"name":"Town's Tale with Ebichu","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208099,"name":"Ultra Instinct Master","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208100,"name":"Jinshin","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Jinshin is a JRPG based on an ancient-themed fantasy tale of when Kami deities lived alongside humans.\nMikazuchi, a man of sword mastery and wisdom, joins the Amaterasu Clan to save his master from Onigami Ichigan, the head of an ominous force. When the war is done, will peace or chaos reign supreme?\nMake use of tactician Mikazuchi's orders and gain powerful formation effects to turn the tide of battle in turn-based battles full of ambiance and strategy. Use materials to craft equipment and unlock Kami Arts within weapons to unleash extremely powerful skills. Learn magic arts from Tsukumo Kami hiding all over the world, and focus on developing your village through commands to receive rewards and learn new crafting formulas.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7iwy.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Kemco","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":208101,"name":"DeLight","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208102,"name":"Cat Escape","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208103,"name":"War of Deities","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208104,"name":"Panini Adventure","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208105,"name":"Blue Sky Arena","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208106,"name":"Project Aurora","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208108,"name":"Tennis League VR","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Tennis League VR is an arcade tennis simulator for Meta Quest, PICO devices and Steam VR. Learn and master real tennis techniques and use them for training in solo or multiplayer online matches.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ycu.jpg","releaseYear":2023,"developers":[{"id":0,"name":"AnotheReality","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"SteamVR"},{"id":0,"name":"Meta Quest 2"},{"id":0,"name":"Meta Quest 3"}]},{"id":208109,"name":"Quadrata","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Quadrata is a minimalist puzzle where you control two different characters with the same keys on either side and collect diamonds with a limited number of moves to finish. The difficulty of the game increases gradually, thanks to new mechanics added every 10 levels.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ycv.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Mindlabor","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"}]},{"id":208110,"name":"Yong Heroes","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208111,"name":"Project X22","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208112,"name":"World of Witchcraft","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208113,"name":"Wonder Planetes","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208114,"name":"Wild Arena Survivors","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208115,"name":"War of Mafia","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208116,"name":"War of Kingdoms","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208117,"name":"Volleyball: Spike Master","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208118,"name":"Viking Raider","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208119,"name":"Truck Simulator USA: Evolution","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208120,"name":"UFO99","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Perform your best flying, speeding and dodging skills with your favorite character!\nBlock monsters can be found floating around in this colorful universe, so watch out! Pick up big hammers and smash them. Keep challenging levels to get a higher rank and score!\nGiant bosses hide away in the Demon Key. Dodge their attacks, pick up magic items and fight back. Retrieve the long-lost UFO99 letter gems!\nFeatures of UFO99:\n#Super Easy - Flying & Combat\nFly, speed-up, dodge, pick up hammers and smash block monsters!\n#Super Fun - Local Multiplayer Co-op Game\n1-4 player co-op mode. Play with friends and family!\n#Super Healing - Character Gashapons\nOver 60 cute, healing characters. Fight with different characters each time!\n#Super Relaxing - Play Anytime, Even For A Short Time\nEach game requires only about 1 to 3 minutes. Lots of random levels with endless variations!\n#Super Exciting - Combat Giant Bosses\nGiant bosses are in hiding. Stay alert and feel the thrill of this easy-to-play game!\n#Super Rich - Special Power-up Items\n5 special power-up items allow you to always be the winner!\n#Super Cute - Colorful Graphics\nThe various bright colors and cute styles can light up your day!\nTons of gold coins and items are given away each day!Download now to get countless gifts!\nStart playing today!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5tj5.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208121,"name":"Summoner's Battle 2048","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208122,"name":"The Walking Dead: All-Stars","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"\"Respond if you are still out there!\"\n\nFamous for its post-apocalyptic world, The Walking Dead features no shortage of horror. Be on the lookout for walkers as well as other groups of survivors!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208123,"name":"The Greedy Cave 2: Time Gate","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208124,"name":"Three Kingdoms: Legends of War","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208125,"name":"Three Kingdoms: Overlord","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208126,"name":"Superpower Squad","genres":[{"id":0,"name":"MOBA","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208127,"name":"Separate Identities Force","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208128,"name":"Shadow Brides","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208129,"name":"Space Hunter 3","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208130,"name":"Space Leaper: Cocoon","genres":[{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Go on randomly generated adventures and discover the secrets hidden in the depths of the universe. But remember, you have to share them with me-ow! Complete the corresponding talent tree each season to claw your way up the rankings and unlock more ways to explore, then maybe you'll be on my level. Just maybe.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6i2d.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Natasky Games Limited","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":208131,"name":"Stone Miner","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208132,"name":"Stickman Lore","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208133,"name":"Mamodan","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208134,"name":"SD Gundam G Generation Eternal","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co72y8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208135,"name":"Solar Smash 2D","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208136,"name":"Super Storm","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208137,"name":"The Wonder Stone","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208138,"name":"Power the Ark","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208139,"name":"Primitive Simulator","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208140,"name":"Project: Spread","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208141,"name":"Random Three Kingdoms","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208142,"name":"Rebel Riders","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208143,"name":"Rebirth Online","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208144,"name":"Restart: Dawn","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208145,"name":"Puzzle & Dragons Battle","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208146,"name":"Royal Match","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Welcome to Royal Match, the king of puzzle games! Swipe colors, solve match-3 puzzles and help King Robert decorate his castle. An exciting adventure is calling you!\n\nWe have thousands of challenging match-3 levels for you to play in the Royal Arena! On this fun journey, you will solve exciting puzzles, receive coins for unlocking new areas, decorate King Robert’s castle and get extra boosters to continue your saga. Also you can compete with millions of players in events such as King's Cup, Sky Race, Team Battle, Lightning Rush and claim exciting rewards for your achievements. Fun and challenge never ends and you will never have a dull moment in Royal Match.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5jf2.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":208147,"name":"Rocky Towers","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208148,"name":"Rowdy City Wrestling","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Every wrestling career has to start somewhere. For you it's the mean streets of Rowdy City. Rowdy City's Wrestling gym is a place where dreams can be made or crushed. You will meet a variety of characters throughout your career, some who want to help you and others who maybe have other plans for you.\nIn career mode you will start as a nobody and fight your way towards the RCW World Championships. It's not going to be an easy journey, you will fight in 1 vs 1 matches, six person brawls and royal rumble events. The aim of the game is to earn cash to improve your stats so you can take on the guys at the top. If you need a bit of extra cash you can pick up a part time job lugging boxes around, or take the more dangerous route and do some street fights.\nThere are a variety of characters to unlock and an endless mode that lets you jump straight into a royal rumble mode.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co93rl.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"Web browser"}]},{"id":208149,"name":"Once Be Human","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208150,"name":"Order Up!! To Go","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208151,"name":"Power Rangers: Morphin Legends","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ahp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208152,"name":"Pocket Cowboys: Wild West Standoff","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208153,"name":"Pixel Mage Survival","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208154,"name":"Pig Farm Mix","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208155,"name":"Paradise: Waifu Dream","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208156,"name":"Outerland","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208157,"name":"Merge Kuya Island","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208158,"name":"Mini Avoid","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208159,"name":"Mission Zero","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Mission Zero is a 2v4 competitive stealth game featuring blend-in and distinguished gameplay experience.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zpl.jpg","releaseYear":-1,"developers":[{"id":0,"name":"NetEase Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208160,"name":"Miracle Nikki","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208161,"name":"My Little Jellymon","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208162,"name":"My Success Story","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"“My Success Story” is the most realistic life simulator game where you can get everything you miss in your real life. Simulation let you rise from rags to riches and get filthy rich. Start a family and run your own business in!\n\nIs a dollar in your pocket and a room in the dorm all you have for now? Make choices to have a better life with work and family that you want! Try to become rich and successful business tycoon. Can you earn money to possess wealth and run your own business company? Check it out!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5x67.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208163,"name":"Ocean Man","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This is a role-playing turn-based game. In the game, you will play a captain and lead your team to explore the ocean and find the treasure! You need to sail in the ocean, explore different islands, sometimes encounter sea monsters. You will find new partners, expand your team and adventure with them.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b2u.jpg","releaseYear":2024,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208164,"name":"Ocean: The Place in Your Heart","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Luna is a curious girl who loves adventure.\nJoin her on a journey to explore the mysterious abyss and make lots of various new friends.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208165,"name":"Guardian Survival","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208166,"name":"Hassle Online","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Hassle Online is an open world multiplayer action role-playing game with no limits, with thousands of players on one map. Join the criminal world of your native land and gather your gang of friends or take the side of the law and arrest the entire underworld!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co77xs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208167,"name":"Hades' Star: Dark Nebula","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Join millions of players in a unique massively multiplayer strategy experience.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7f59.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Parallel Space Inc","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":208168,"name":"Hello Neighbor: Diaries","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Some say he's a killer, that he hides kidnapped children in his basement. All you know is he's your Neighbor, and it's up to you to figure out what he's hiding.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7otd.jpg","releaseYear":-1,"developers":[{"id":0,"name":"tinyBuild","games":null}],"libraryGames":null,"platforms":[]},{"id":208169,"name":"Online @ The Perfect Time","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"With your exams coming up faster than you imagined, you needed to let off some steam and whilst waiting for take-out you stumbled on what seemed to be a new show. Soon enough you were diving head first into a new fandom. Will your heart be steady enough to embrace these new relationships or will the stress of it all cause you to make choices you wished to forget?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5frr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208170,"name":"Mecha: War Robots","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208171,"name":"Lost Blade","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208172,"name":"Live a Hero","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208173,"name":"League of Pantheons","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Guess who will win the fight among Zeus, Odin, Wukong and Susanoo? Ancient immortals from Greek, Norse, Japanese, Egyptian and other mythologies, are gathered in this League of Pantheons. Will you be the Summoner to bring back their mighty power?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8tv8.jpg","releaseYear":2022,"developers":[{"id":0,"name":"NEOCRAFT","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208174,"name":"Idle Team","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208175,"name":"Infinity Star M","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208176,"name":"Iron Clash","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208177,"name":"Evil Nun Rush","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co75b1.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Keplerians","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208178,"name":"Gang Start","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208179,"name":"Gatherers","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208180,"name":"Geometry Worlds 2","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208181,"name":"Goddess Era","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"Happyfun","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208182,"name":"Darklings","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Darklings stole all the stars from the world which is an essence of light and brought Darkness. Join Lum to purge the Darklings. Experience unique gesture driven gameplay blended with awesome noire artwork carrying the touch based games to a whole new level. Save the stars, save the world. Darkness is coming!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7b99.jpg","releaseYear":2013,"developers":[{"id":0,"name":"MildMania","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Windows Phone"},{"id":0,"name":"iOS"}]},{"id":208183,"name":"Nowhere House","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Nowhere House is the third chapter in the Hidden Town escape game series. You will have to interact between three parallel worlds and seek help from the characters trapped in the house. Only with their help you will be able to escape.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6f9i.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Dark Dome","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208184,"name":"Farm RPG","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Farm RPG is a simple, menu-based, mobile-friendly farming RPG / MMO game where you start a farm, plant crops, fish, craft and explore.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6tvj.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208185,"name":"Figure Story","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208186,"name":"Fog: Battle Royale","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208187,"name":"Fruit Block","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208188,"name":"Galaxy Arena","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Galaxy Arena Space Battle is an addicting, space war strategy game. Join us in this space odyssey & be part of the guards of galaxy who are protecting the starcitizens in this huge intergalactic space war. Build your starship armada with dreadnoughts & other spaceships. Equip your armada with anti matter, engines & interstellar weapons to protect your space men & starcitizens in your frontier. Enjoy adjustable 3D view of the space war/ battle. Battle against other players in ship vs ship idle combat.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co96kh.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208189,"name":"Girl X Hunter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208190,"name":"Heroes Fantasy: Cells Reborn","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208191,"name":"Hometown Farm","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208192,"name":"Hero Tale","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Follow the boy on a journey to become a Hero! Explore quirky medieval fantasy island, gain experience while doing quests and become stronger. Adapt your strategy by choosing your own path on the massive skill tree. And when it looks like you are getting stuck, remember, practice makes perfect!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7hdv.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Android"}]},{"id":208193,"name":"Creepy Ball Pixel","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208194,"name":"Cozy Islands","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9a9v.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208195,"name":"Dad and Me: Super Daddy Punch Hero","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208196,"name":"Darkrise","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Darkrise is a classic hardcore game that was created by a small group of indie developers in nostalgic pixel style.\nIn this action RPG game you can get acquainted with 4 classes - Mage, Warrior, Archer and Rogue. Each of them has their own unique skills, game mechanics, features, strengths and weaknesses.\nHomeland of the game hero has been invaded by goblins, undead creatures, demons and neighbouring countries. Now the hero has to become stronger and clean the country from invaders.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8vrm.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208197,"name":"ExoMiner","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Ever dreamed of conquering planets? Leaving your mark on human history? Rivaling the Medici, Rockefeller, and Bezos? Making unbelievable money and ADVANCING the world? Discovering and creating life changing technologies? Then, strap in, because you are headed to the STARS.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8tv0.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208198,"name":"Echocalypse: Scarlet Covenant","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Kemono Girl RPG has topped the free download list on App Store and Google Play in multiple countries or regions! Embark on a journey with 10 million players worldwide in a post-apocalyptic exploration, and stand alongside charming Kemono girls! Enjoy a time-saving and relaxing card battle!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7klb.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Yoozoo Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208199,"name":"Dynasty Scrolls","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208200,"name":"Dungeon Life","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208201,"name":"Dream Maze 3D","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208202,"name":"European War 6: 1914","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208203,"name":"Car Simulator 2","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208204,"name":"City of Forever 7 Days","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208205,"name":"Age of Kita","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Tactical","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208206,"name":"AMG2","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208207,"name":"Arat","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208208,"name":"Devils 'n Dragons Arcade","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Devils 'n Dragons is a 2D run and fight platformer turned on arcade action in a medieval fantasy world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5gv2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208209,"name":"Duck Paradox","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Shoot bouncing bullets to kill corrupted versions of your Pet Duck. Slow down time to maneuver in a flashy way as you try to solve puzzles under pressure and chain explosions to rescue the original version of your Pet Duck!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8eh0.jpg","releaseYear":2024,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208210,"name":"Loplight","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Loplight is a twin-stick shooter taking inspirations from Hermetic lore and old alchemical concepts. Explore the ruins of this world, find out who's responsible, and defeat the monstrous creatures blocking your path.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5jks.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Scumhead","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208211,"name":"Legend of Etad","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A first-person dungeon crawler for Playdate in the vein of classics such as Dungeon Master and Eye of the Beholder. Expect lots of environments to explore, enemies to defeat, weapons and items and magic to wield, and puzzles to solve!\n\nEtad is an arcade adventure/exploration game crafted around the limitations of the Playdate. You won't get bothered with stats, inventory tetris or party management; instead expect pick-up-and-play hack'n'slash dungeon crawling with light puzzles and combat.\n\nEvery dungeon in Legend of Etad is unique and hand-crafted, with distinct art and game mechanics, and are linked together by outdoor \"hub\" areas. Each new area you discover will feel different from the last.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6hox.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Gareth Williams","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":208212,"name":"Brain Rush","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208213,"name":"Avabel Lupinus","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208214,"name":"Brawl King","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208215,"name":"Bleach: Eternal Soul","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co93eb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208216,"name":"Bombsquad: Defuse the Bomb","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208217,"name":"Bloodline: Last Royal Vampire","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Bloodline is an anime-styled mobile role-playing card game with an emphasis on deep character leveling and customization, allowing for a roster of heroes that is distinctly unique to each player. The story follows the Last Royal Vampire Lilo and her companion Ron in their quest to save their loved ones from a militaristic order called the Holy Land.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co50dp.jpg","releaseYear":2014,"developers":[{"id":0,"name":"Crunchyroll Games","games":null},{"id":0,"name":"Shengqu Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":208218,"name":"Last Hope Sniper","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208219,"name":"Blade of God II: Orisols","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"\"Blade of God 2\" is a 3D hard-core action game. In this game, players will be one of the painful, sadness, ordinary, but great heroes; to adventure among the huge and mysterious Nordic kingdoms, to fight with the “sacrificers” who once lost their \"destiny\", and launch a self-salvation travel.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co98eo.jpg","releaseYear":2024,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208220,"name":"Beat Shot","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Dash and blast your way through rhythmically entranced enemies. Can you keep up with the beat?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6co4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208221,"name":"Merry's Errands","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Enjoy a peaceful day in the life of Merry the Rabbit. Explore the town, talk to your friends, finish your chores, and maybe give a gift to someone you like...?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yez.jpg","releaseYear":2022,"developers":[{"id":0,"name":"dotmoon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"}]},{"id":208222,"name":"Karumaruka Circle: Smartphone Version","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208223,"name":"House Haunting","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"House Haunting is a horizontal puzzle solving game. You need to solve puzzles in a haunted house. There is no fixed sequence for solving puzzles. You can freely explore the room, and finally complete the task \"she\" gave you, satisfy \"their\" wishes, and finally find \"your\" memory and destination.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5efa.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208224,"name":"Brain Syndrome VR","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Brain Syndrome VR is a FPS bullet hell shooter featuring a cell shaded art style and an option for local multiplayer. Even though the game has VR in the title, it can be played without it. The game has more than 12 hand crafted levels ready for you to explore.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5c54.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208225,"name":"Futanari Sex: Mile High Fun","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"An explicit erotic visual novel following the story of two gorgeous women taking advantage of their boss’s luxury private jet AND the hot futanari flight attendant in their pursuit of joining the Mile High Club as they return from a business trip.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5oma.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208226,"name":"Unilogue","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Adventure with your unique friends and defeat powerful enemies! Unilogue is a new tower defense game with elements of a build-your-own roguelike. Form the best party you can think of and set out on a rugged adventure!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ia4.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208227,"name":"Ceke Ceke","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Ceke Ceke is an awesome game for learning typing without looking at the keyboard. If you want to type like a 'pro' than this game is for you!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5clg.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208228,"name":"MX vs. ATV: Legends - 2022 AMA Pro Motocross Championship","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Compete like the pros on 13 official tracks from the 2022 AMA Pro Motocross Championship, plus the legendary Loretta Lynn’s!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6vor.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Xbox One"}]},{"id":208229,"name":"Elves Fantasy: Hentai Puzzle","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A relaxing puzzle game full of beautiful art featuring sexy elves","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5gpp.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Gamuzumi","games":null},{"id":0,"name":"Sweet Banana Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208230,"name":"TrackRace","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Choose your little car and race!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5nmi.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208231,"name":"Qingping Bookstore","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ogz.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208232,"name":"Spermination: Cream of the Crop","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"You may have beaten off others and came first a thousand times, but you've never tasted the sweet Cream of the Crop. This sequel is harder, faster and will blow your crusty socks off! Choose from 3 difficult leagues: Hand, Mouth and the coveted Cream Pie! Crack the egg & unlock your bundle of joy!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5mc7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208233,"name":"Project: Eternal Flame","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5mo5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208234,"name":"Fermata on the Pithos","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Fermata on the Pithos is a third-person action adventure game where you control a small robot with one eye and a jet-pack in a near-future that has been hit by a catastrophic flood.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yf2.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Kyu Fu","games":null}],"libraryGames":null,"platforms":[]},{"id":208235,"name":"Pocoyo World","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Pocoyo World was a massively multiplayer online game, set in a virtual world that contained a range of online games and activities featuring various Pocoyo characters.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ydn.jpg","releaseYear":2009,"developers":[{"id":0,"name":"Zinkia Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208236,"name":"Girls und Panzer: Senshamichi Dai Sakusen!","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208237,"name":"The Symphony of Dragon and Girls","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208238,"name":"Super Sarrador","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yf7.jpg","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208239,"name":"Kyoutou Kotoba RPG: Kotodaman","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8p7i.jpg","releaseYear":2018,"developers":[{"id":0,"name":"Sega Games","games":null},{"id":0,"name":"XFLAG STUDIO","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208240,"name":"Sousei no Mirage","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208241,"name":"Monster Company","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208242,"name":"Girls und Panzer: Atsumare! Minna no Sensha-dou","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208243,"name":"100-man-nin no Nobunaga no Yabou","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"It is a social game focusing on war simulation for mobile phones and PC. At the beginning of the game every player choose which warlord they want to serve.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7y79.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Mobage","games":null},{"id":0,"name":"Koei Tecmo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"iOS"}]},{"id":208244,"name":"Make Love Not War","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"12 charming girls will help you relax and have fun. Girl soldiers, doctors, sailors, pilots and special agents are waiting for you!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5fwe.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 4"}]},{"id":208245,"name":"Interruption","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This is a text adventure game based on image selection. Players will explore the streets with girls after losing power. As time goes by, the reality will gradually blend into different scenery. You can't turn back. Your choice determines the direction you go.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5hc8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208246,"name":"Rooftop Garden Simulator","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Who said the city can’t be its own escape? In Rooftop Garden Simulator, you can transform your urban corner into a warm and relaxing agricultural space. Build, explore, and connect with the sprawling, citified landscape in a stylized simulation that’s designed to be fun for gamers of all ages.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5o10.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208248,"name":"Maze Mart","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You play as Isaac looking for a bottle of milk. Through small labyrinths you will have to choose how the story will end.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5kux.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208250,"name":"Vein","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Game is currently in around the clock development and will include bugs and potential room for improvement\n\nA hybrid of multiplayer and single player open-world post-apocalypse survival RPG set in the near future.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6mdh.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Ramjet Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208251,"name":"LEGO DC Super-Villains: Young Justice Level Pack","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A pack for LEGO DC Super-Villains, introducing a new level and characters inspired by the Young Justice animated TV series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yek.jpg","releaseYear":2019,"developers":[{"id":0,"name":"TT Games","games":null},{"id":0,"name":"WB Games","games":null},{"id":0,"name":"Feral Interactive","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":208253,"name":"Hellfire Tactics","genres":[{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Hellfire Tactics is a competitive multiplayer card strategy game. Experience intense 8 player matches while drafting from over 40 different units all with their own unique effects on the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zul.jpg","releaseYear":2022,"developers":[{"id":0,"name":"JWaffle Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208254,"name":"TotalNerds","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"You play Jona & Louise in a city where everyone seems to have something to hide. People have secrets and a plot has been hatched. Who can you trust? Better to trust no one, not even technology.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[{"id":0,"name":"DeDo Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":208257,"name":"Tokimeki RunRuns","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Nijigaku members run around Odaiba! ??\n\nAt \"Wide Rainbow WA! Nijigasaki Gakuen School Idol Club Thematic Activities\"\nSetuna Yuuki, Rina Tennoji, and Shiori Mifune, who belong to the IT utilization team,\nThe members of Nijigaku ran around Odaiba and made a run game to gather fans!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfh.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Bushiroad","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":208258,"name":"Max Capacitor","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A simple puzzle game by Alan Hazelden and Andrew Shouldice.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6xk5.jpg","releaseYear":2016,"developers":[{"id":0,"name":"Andrew Shouldice","games":null},{"id":0,"name":"Draknek & Friends","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208259,"name":"Friday Night Funkin': VS Kacy","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"After BF and GF help Kacy and her foe, they continue their path of finding the right opponent for BF... or just getting out of the space-like environment. Too bad that they get sucked into a black hole, because they got company!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfj.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Jaaza","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208260,"name":"Hina-chan Snowtime","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A doujin game by ISY based on the Touhou Project series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfl.jpg","releaseYear":2019,"developers":[{"id":0,"name":"BOOTH","games":null},{"id":0,"name":"ISY","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208261,"name":"Aunt Flora's Mansion","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A puzzle game by Anna Anthropy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfm.jpg","releaseYear":2015,"developers":[{"id":0,"name":"Anna Anthropy","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208262,"name":"Herding Cats","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A puzzle game by Anna Anthropy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfn.jpg","releaseYear":2015,"developers":[{"id":0,"name":"Anna Anthropy","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208263,"name":"At the Hedges of Time","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Help Sir Montaclé escape the hedge maze and free himself from the witch's curse! Use your ability to rewind time to solve a series of interconnected mind-bending puzzles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfo.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208264,"name":"Rooky Moves","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"You are the kingdom's new rookie rook recruit. Determined, you decide to depart on an adventure to establish your honor. Are you skilled enough to slide through the pesky pawns, precarious pitfalls, and perplexing puzzles in your path?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfp.jpg","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208265,"name":"Game Party","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Game Party is a game published by Coconuts Japan Entertainment Co., Ltd., which was released in Japan in 1990 for the Nintendo Famicom.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfq.jpg","releaseYear":1990,"developers":[{"id":0,"name":"Coconuts Japan","games":null},{"id":0,"name":"C-Dream","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Family Computer"}]},{"id":208266,"name":"Edge Case","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"EDGE CASE is a puzzle game about navigating, linking and altering the game world. It includes 22 levels of gradually increasing difficulty.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfr.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Parachor","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208267,"name":"Walk Your Friends Back Home","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"It's getting late and your friends need to get home but they are kind of a useless bunch! You need to make sure they actually make their way back to their own homes!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfu.jpg","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208268,"name":"Ducks in a Row","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Your ducks have escaped! Get them back into their pens and shut the gate before they ruin your flower crops!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfv.jpg","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208269,"name":"Tres Undos","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Short puzzle game about orienting yourself in time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yfw.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208270,"name":"Yippy Cube","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Yippy Cube is a happy party game. You will incarnate cute animals, place and eliminate cubes falling from the sky with your friends in various interesting stages. Whether working together to achieve the goals or PK with other teams, you will have constant joy and fun.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yg1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208271,"name":"An Otaku like me has 2 Fiancees?!","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Hiding your identity as an otaku has always been part of your life. But that hasn’t stopped you from having an enjoyable, average life in high school. One day, you find yourself meeting up with a beautiful senpai who is also the president of the club you belong to. It seems she has a favor to ask of you. Nothing big. You know, just… pretend to be her lover to avoid getting out of an arranged marriage?!\n\nYou decide to help her out, but before you have time to process the whole thing, your energetic classmate seems to want to “talk” to you about something. You go along with her only to discover that she’s found out about your secret identity as an otaku! Luckily, it turns out she’s an otaku as well, but it seems she has a favor to ask of you as well and if you don’t cooperate, the whole school finds out about your “hobbies.” Now, what might that favor be? You guessed it… Act as her lover to get out of an arranged marriage!\n\nJust yesterday, you thought this could only happen in your favorite anime… Now you have to figure out how to survive what might be the most challenging situation any protagonist has ever faced! Can two fake relationships ever turn into a single real one? Find out in An Otaku like me has 2 Fiancees?!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yg2.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208272,"name":"Acanthoceras","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A short game based on a Horror and Parkour mixup. Find Keys, escape monsters, Make your way in the ruins and fight back","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co56vu.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208273,"name":"Fortitude Invasion","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The alien invasion has already begun! They're already here! Who can help the brave warriors to learn the full power of our civilization!?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5obt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208274,"name":"Blockhead 2D","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Blockhead 2D is a mostly multiplayer, retro-style platformer. It comes with a cast of characters, game mechanics that resemble the classic 8-bit brawlers and sound design that keeps the action going!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5bq8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208275,"name":"Hero Youseijyo","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Hero Youseijyo is an old style raising mini game. Train up a Hero to defeat the Demon King.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5e92.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208276,"name":"Hauling Away","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Alone and stuck in job that he has no passion for, Ray is about to meet someone that may change his life forever. Will they be able to find salvation together?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5e3x.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":208278,"name":"Floating Material -The Hill Where the Star Born.-","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Shun is the only male teacher at Kyoukasen Girls’ School, a well-known high class school also known as the “Water School” since it is situated in a forest and there is a lake on the school grounds. It is a place to heal the wounds of those girls who are hurt. He meets girls who shut off themselves from the world, those who don’t have confidence in themselves, those who are still traumatized by their past. He decides to help them move forward with their lives.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yg9.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Biscotti","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208279,"name":"Sanrio Characters x Tetris","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sanrio Characters x Tetris is a discontinued web version of Tetris featuring various Sanrio characters. The game was later revented into TETRIS x Hello Kitty.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygc.jpg","releaseYear":2019,"developers":[{"id":0,"name":"Blue Planet Software","games":null},{"id":0,"name":"The Tetris Company","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208280,"name":"My Sweet Puppy Love","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Your everyday life is upended when you are chosen to participate in a mystical gameshow, the outcome of which will decide the destiny of three girls you have never even met. Who will you choose to save?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygd.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208281,"name":"Head Over Heels","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"After your dream of competing on the biggest stage in gymnastics is suddenly ripped away, life seems to lose all meaning.\n\nYou decide starting fresh at a new university is just what you need to get away from your past… until you’re caught in a devious trap!\n\nWith nowhere to run, your only choice is to do what you swore to never do again—reenter the world of gymnastics and take a struggling team to the next level!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygf.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208282,"name":"Oh My Yokai!","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"When you receive an acceptance letter from the elite Fumikashi Academy, you’re sure there must have been a mistake. After all, you didn’t even apply to go there. Yet at your father’s urging, you accept the invitation and become the academy’s newest student.\n\nOn your first day, however, you learn the startling truth—Fumikashi Academy is also known as the Yokai Academy, and all of its students are yokai!\n\nYou never really believed the stories about yokai, but now you can’t deny that they exist. The headmaster hopes you will help bring peace between your kind and theirs, but not everyone there is happy to see you.\nCan you survive the school year as the only human at an all-yokai school?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygh.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208283,"name":"Red Lucy","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Red Lucy is an adult visual novel with a focus on more mature women and the secrets that they hold. There is a large emphasis on music and art's relationship with the human experience.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co66wb.jpg","releaseYear":2022,"developers":[{"id":0,"name":"LeFrench","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"}]},{"id":208284,"name":"My Assassin High School","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"On the surface, you seem to be just an average high school student. But the truth is that you’re one of the deadliest assassins out there! Your newest mission is to blend into the Ryuho Academy as one of its students and take out the headmaster. Doesn’t sound too difficult, but it turns out that you’re the only guy in the entire school! Still, with a bunch of cute girls interested in you, this mission seems like it’s gonna be pretty good.\n\nHowever, you soon learn that there’s more to this school than meets the eye. Turns out you’re not the only one trying to take out the headmaster. In fact, it’s an entire school of assassins! You manage to team up with three beautiful assassins each with their own set of skills to try to complete your mission, but it’s not going to be as easy as you thought…","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygi.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208285,"name":"Ikusa Megami 2: Ushinawareshi Kioku he no Chinkonka","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Battle Goddess 2 or BG2 taken place around one year after events of first game. Although, it is the second game release with Battle Goddess title and third release in the series, this taken place as the sixth game in the \"Battle Princess\" series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygj.jpg","releaseYear":2002,"developers":[{"id":0,"name":"Eushully","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208286,"name":"Ikusa Megami Verita","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The wandering God-Slayer Serika, who's still searching for his purpose. The half-demon king of Menfill, Loui, who just won the war, but lost his wife in it. This is the story of two infamous heroes and how their paths in life inevitably cross each other, and the conflict that it brings. While on the backdrop of the setting, various ancient forces rear their head and the temple of Marsterrie starts moving.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygk.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Eushully","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208288,"name":"Ikusa Megami","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Celica Sylphil, the immortal warrior known as the Godslayer, lives within the stolen body of the goddess Astraea. For this, he is hunted day in and day out; servants of the gods seek to kill him for the threat he poses, while demons seek to take the power of Astraea's body for themselves. Only the matron goddess of the kingdom of Rewinia offers him sanctuary; alongside the White Dragon Knights and their commander, General Revia, he fights to hold back the forces that would do the kingdom harm.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygm.jpg","releaseYear":1999,"developers":[{"id":0,"name":"Eushully","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208294,"name":"Glyph","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Maddie goes on a journey through the mind & memories of one that are not her own. An impressionistic map that should be suitably challenging for advanced players of Celeste.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ygu.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":208300,"name":"Beat Valkyrie Ixseal","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Oudou Tsuguhiko is a student who believes he is the reincarnation of the Demon King, and is waiting for the time he can fully regain his powers. When that time comes, he is attacked by the valkyrie Ixseal, and further betrayed by his Demonic Chancellor Bezel, who steals six of his powers and leaves him only with lust. Ixseal learns that the Wargrim, Bezel's army, have isolated her from the heavens and her source of power, so she teams up with Tsuguhiko to fight back against them.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7l2e.jpg","releaseYear":2017,"developers":[{"id":0,"name":"Alicesoft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208301,"name":"Lisa the Joyful: Growing Pains","genres":[],"avg_score":0.0,"description":"LISA the Joyful: Growing Pains is a Lisa the Joyful mod/fan game in development focusing on breathing new life into the game while polishing pre-existing elements. New story beats, dialogue, and interactions!New areas, NPCs, and environments to explore! New artwork and gameplay to existing environments! A new optional party member! New battles, items, moves, and weapons! New music tracks!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yh4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208303,"name":"Five Nights at Freddy's: Security Breach - Ruin","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You can run, but you can’t hide…\n\nEnter the ruins of Freddy Fazbear's Mega Pizzaplex in the FREE story DLC for Five Nights at Freddy’s: Security Breach!\n\nGregory is once again trapped in the now abandoned Pizzaplex, and he needs your help! Play as Cassie, Gregory’s best friend, Faz-fanatic, and would-be savior as she braves the dark, dreary, and dilapidated pizzeria. Armed with only a Faz-Wrench, a Roxy-Talky, and this weird bunny mask, you will have to help Cassie find her friend, free him, and safely escape the ruins.\n\nCan you save your friend, yourself, and the Pizzaplex? Find out in the 100% free DLC, Five Nights at Freddy’s: Security Breach – Ruin.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co84h7.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Steel Wool Studios","games":null},{"id":0,"name":"Scottgames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"}]},{"id":208307,"name":"Gwent: Rogue Mage","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Gwent: Rogue Mage is a single-player card game that is based on the standalone version of Gwent. It features roguelike elements in addition to exploration and interactions derived from The Witcher Tales.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yj0.jpg","releaseYear":2022,"developers":[{"id":0,"name":"CD Projekt RED","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"iOS"}]},{"id":208308,"name":"Castlevania: Circle of the Realm","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Is a simple yet complex mod/ROM Hack for Castlevania - Portrait of Ruin. Takes 7 years after the event of Castlevania - Circle of The Moon and as a Fan prequel to Castlevania 64. Arm yourself, storm into the deep dark castle, and be ready to send the dark legend back to its realm.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69xv.jpg","releaseYear":2022,"developers":[{"id":0,"name":"ncoZ","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":208309,"name":"Little Nemo and the Nightmare Fiends","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Little Nemo and the Nightmare Fiends is a 2D non-linear platformer with 4 playable characters that players can freely switch between. The game features artwork inspired by the groundbreaking 1905 Little Nemo in Slumberland comic, hand-drawn keyframed animation, and a cast of surreal creatures and characters.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yhk.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Team Nemo, Inc.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208310,"name":"The night spoke our names","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"A tiny game where you roll dice, use them to activate skills, and hope to survive the winter.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yhl.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Ludipe","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Web browser"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":208312,"name":"Race Day Rampage","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Welcome to Race Day Rampage, a social arcade racing game built for streamers and their audience. In the game, you take on the role of Race Director. You pick the tracks, invite your audience and control the race. Cinematic camera controls let you zoom in on specific racers or areas, or zoom out and watch the race from afar. At the same time, the tracks have various traps that you can control to add to the chaos and influence the race!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6g4d.jpg","releaseYear":2022,"developers":[{"id":0,"name":"STREAMSIX","games":null},{"id":0,"name":"Xform","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208314,"name":"Bitcoin Bounce","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"How far can you travel along the blockchain? Bounce your bitcoin along the blocks and try to land on the combo blocks to boost your score. The aim is to see how far you can get without landing on enemies or missing the blockchain and landing into oblivion!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co50ig.jpg","releaseYear":-1,"developers":[{"id":0,"name":"THNDR","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208315,"name":"Colorful Recolor","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Colorful Recolor is a fast-paced puzzle game with a kaleidoscopic collection of brain teasers. Play through 100 levels with engaging mechanics, striking biomes, 10+ distinct elements, and an abundance of colors. Paint your way through this colorful world!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yhq.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Gagonfe","games":null},{"id":0,"name":"Acyntha","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208317,"name":"Welcome to Genius High!","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"A natural thinker with the ability to assess any situation, identify the optimal strategy, and execute it in the blink of an eye...\n\nYou are a true genius.\n\nUntil now, you’ve never met an equal, but all that’s about to change when you’re drafted into an elite school that caters solely to the skills of those like you…","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yhs.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208319,"name":"Green Lantern","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Green Lantern is a cancelled SNES platformer based on the DC Comics character of the same name.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5z0u.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Ocean Software","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":208320,"name":"Saturday Night Live: The Game","genres":[{"id":0,"name":"Quiz/Trivia","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Live from your living room...it’s Saturday night! Relive your favorite SNL moments straight from TV to iPad in this game for everyone from casual fans to fanatics. Compete on your own against the timer—or challenge your friends to see who’s the biggest fan.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yi6.jpg","releaseYear":2011,"developers":[{"id":0,"name":"Discovery Bay Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":208321,"name":"Time Raiders","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Time Raiders is high-octane arcade action in an 3D top-down shoot n’ loot with time as your playground. Battle through our past, alternate histories and the future. Seek out history’s greatest mysteries, wonders and dangers, and test yourself in thrilling combat.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7ilu.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Utopian Game Labs LTD","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208322,"name":"Crazy Otto","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Originally, Ms. Pac-Man started as an unauthorized hack of Pac-Man called Crazy Otto by General Computer Corporation, featuring a Pac-Man-like character with a blue eye and legs. To avoid another lawsuit with Atari (which they had previously received for creating \"Super Missile Attack\", a Missile Command hack), G.C.C. presented the game to Bally Midway for approval of release. Midway, impatient for Namco to release the then-upcoming Super Pac-Man, purchased Crazy Otto for their own release, transformed into Ms. Pac-Man.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yj6.jpg","releaseYear":-1,"developers":[{"id":0,"name":"General Computer Corporation (GCC)","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":208323,"name":"LeapSchool Math","genres":[],"avg_score":0.0,"description":"Build your knowledge of mathematics as you help out the LeapSchool students. Explore weight and volume by mixing up special bubble bath potions. Learn about measurements, proportions and geometry when you make stuffed animals and create games Sell your creations to raise money to make repairs around LeapSchool.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yi8.jpg","releaseYear":-1,"developers":[{"id":0,"name":"LeapFrog Enterprises","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Leapster Explorer/LeadPad Explorer"}]},{"id":208324,"name":"LeapSchool Reading","genres":[],"avg_score":0.0,"description":"Meet the kids from the coolest school in the world in this fun reading adventure.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yi9.jpg","releaseYear":-1,"developers":[{"id":0,"name":"LeapFrog Enterprises","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Leapster Explorer/LeadPad Explorer"}]},{"id":208325,"name":"Kidz Bop Dance Party!","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Introducing Kidz Bop's first game, a puzzle that plays 10 of today's biggest hits! Personalize it to get the party started: Pick your level of play, choose your game avatar, find the right party background and even play DJ!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yia.jpg","releaseYear":-1,"developers":[{"id":0,"name":"KIDZ BOP","games":null},{"id":0,"name":"LeapFrog Enterprises","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Leapster Explorer/LeadPad Explorer"}]},{"id":208326,"name":"Paranoiak","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yii.jpg","releaseYear":1984,"developers":[{"id":0,"name":"Froggy Software","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Apple II"}]},{"id":208327,"name":"TheBeanstalk","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Jack reached the giant's castle in the sky riding the beanstalk that grew into the sky. But the gates were tightly shut...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5mye.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208328,"name":"Jelly's Adventure","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Move : →←↑↓ Jump : Space bar (You can long Jump or short Jump) Respawn : Space bar Reset the save point : R","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5fxv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208329,"name":"Half-Earth Socialism","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Try your hand as a global planner of a future society. Play with a wide range of technologies and policies spanning different fields and ideologies. Will you lead the world to ecological utopia or planetary ruin?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dxu.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"},{"id":0,"name":"Web browser"}]},{"id":208330,"name":"Slime Rule","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A monster suddenly appeared, took over Uzacan castle. It destroyed a series of the world's top heroes, caused a worldwide uproar. The most shocking fact is that it's just a small slime.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5lx6.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208331,"name":"Aliens vs. Ghosts","genres":[],"avg_score":0.0,"description":"Use Nukes, Electricity, Freeze Rays, Heat Rays and powerful Minions to defeat all the Ghosts in this wave-based first person shooter! Only Ghosts stand in the way of your invasion of Earth.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5781.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208332,"name":"The Newton Mystery","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Newton Mystery is a 2D puzzle platforming adventure where you play as a group of friends who have formed a rag-tag monster crime-solving team. Join them on their journey of self-discovery, wacky interactions, and realizations that everything is not as it seems in the sleepy town of Newton...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co56kg.jpg","releaseYear":2024,"developers":[{"id":0,"name":"In The Snow Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208333,"name":"Interrogation Simulator","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Inspired by JCS videos and similar Interrogation analysis. Match evidence with statements. Play good cop/bad cop. Make choices. Learn what makes people tick. Unravel the mystery.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5hc7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208334,"name":"Arsonist Heaven","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Strap on a jet pack and grab a flamethrower to hunt down monstrous foes!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yiq.jpg","releaseYear":2022,"developers":[{"id":0,"name":"EastAsiaSoft","games":null},{"id":0,"name":"OMEGACORE","games":null},{"id":0,"name":"Ratalaika Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"}]},{"id":208335,"name":"Finding Felicia","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"\"Finding Felicia\" is a tale of the bonds of sisterhood, finding oneself, and lesbian love told through the lens of a charming point-and-click adventure. Play as Jessie Reznik, who goes on a grand journey around the Pacific Northwest to find her runaway sister, Felicia.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co59rs.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":208336,"name":"Thunderbolt Boxing","genres":[],"avg_score":0.0,"description":"This is a single-player action street fighting game. During the game, you need to defeat various ambush enemies and boss to obtain the final victory.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5nh1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208337,"name":"Train Simulator: Long Island Rail Road - New York: Hicksville Route","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"America’s busiest, most historic, and legendary commuter railroad – the Long Island Rail Road – now comes to Train Simulator Classic! A trio of iconic New York City terminals (Penn Station in Manhattan, Atlantic Avenue in Brooklyn, and Long Island City), across “The Island” to Hicksville, New York.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208338,"name":"Voidwalkers: The Gates of Hell - Death to the Heretics!","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Outpost Charlie has finally been breached by the realm of the dead. The entities of The Void have started the process of turning the land into a toxic wasteland. You and your team have been tasked with holding the line until evacuation procedures can be completed.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5i25.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208339,"name":"Trainz Plus DLC: Pro Train - Class 68 ScotRail","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"The Class 68 is a type of mainline mixed traffic diesel-electric locomotive manufactured by Stadler Rail (and previously by Vossloh España) for Direct Rail Services (DRS) in the United Kingdom. This dlc - made by 3DZUG for the Pro Train series, is in the ScotRail livery.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208340,"name":"Trainz Railroad Simulator 2022: Pro Train - Class 68 ScotRail","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"The Class 68 is a type of mainline mixed traffic diesel-electric locomotive manufactured by Stadler Rail (and previously by Vossloh España) for Direct Rail Services (DRS) in the United Kingdom. This dlc - made by 3DZUG for the Pro Train series, is in the ScotRail livery.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208341,"name":"Trainz Railroad Simulator 2019: Pro Train - Class 68 ScotRail","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"The Class 68 is a type of mainline mixed traffic diesel-electric locomotive manufactured by Stadler Rail (and previously by Vossloh España) for Direct Rail Services (DRS) in the United Kingdom. This dlc - made by 3DZUG for the Pro Train series, is in the ScotRail livery.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6itk.jpg","releaseYear":2022,"developers":[{"id":0,"name":"N3V Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208342,"name":"Space Fury: The Phantom Menace","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Tear up your enemies using various power-ups and weapons in this old-school debut project \"07natuskare\".","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5m8x.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208343,"name":"Pacebreaker: An Experiment in AI-Perfected Exercise","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"VR is not just fun exercise. It's the first generation of exercise equipment capable of meaningful live bio-feedback. Pacebreaker is the VR Health Institute's testing ground for research-based next generation exercise in VR, artificial intelligence, and content that can help save lives.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5k7k.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208344,"name":"Texas Hold'em Poker DS","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208345,"name":"Survivor","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Survivor brings you all the elements of the hit TV show - a remote island paradise, two tribes, reward and immunity challenges and a ruthless Tribal Council. Put your endurance to the test and compete in 24 reward and immunity challenges including swimming, balancing, canoeing, javelin, long jumping and jungle targets.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dhy.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Valcon Games","games":null},{"id":0,"name":"Smack Down Productions","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Wii"}]},{"id":208346,"name":"Survivor","genres":[],"avg_score":0.0,"description":"16 adventurous men and women, and you! With rudimentary equipment and limited resources, you must tame the environment, find your place in the team, and pass the tests that await you. Survivor is a challenge, an adventure in 3D, with challenges inspired by the hit YV show and an island to explore.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9er2.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Mindscape","games":null},{"id":0,"name":"Valcon Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":208347,"name":"Swamp Hunt","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208348,"name":"Sweet Reversi","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208349,"name":"Sweet Tooth to Go","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208350,"name":"Super Stunt Spectacular","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208351,"name":"Super Word Challenge","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208352,"name":"Suze Orman's Money Game","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208353,"name":"Super Dominoes","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208354,"name":"Sudoku Puzzle Blast","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208355,"name":"Summer Camp Showdown","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208356,"name":"Stuart Little: Big City Adventures","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7i6d.jpg","releaseYear":2002,"developers":[{"id":0,"name":"Infogrames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208357,"name":"Stuart Little: His Adventures in Numberland","genres":[{"id":0,"name":"Quiz/Trivia","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Why is Numberland so fun? It’s because Numberland is a big animated cartoon, but in this cartoon, the child gets to be one of the characters — Stuart! And what’s going on in Numberland?\n\nAs the children play the games with the cartoon playmates, they earn “brainpower,” which they see filling up Stuart’s brain. When they have enough brainpower, they can use Numberland’s powerful Imagination Machine! This machine turns “imagined” toys into “real” toys, which the children can then sell in Bee’s toy store. So in a nutshell – – they explore and explore, learn how to play games from cartoon playmates, earn brainpower, make toys, sell them to customers, and learn math the whole time…And they never seem to get tired of it!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6klv.jpg","releaseYear":2002,"developers":[{"id":0,"name":"The Learning Company","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208358,"name":"Style Lab: Fashion Design","genres":[],"avg_score":0.0,"description":"The Style Lab brand brings you another innovative game-to-reality title, Style Lab Fashion Design! Now players can not only design their own fashions in the game, but they can wear them in real life too! Develop your own distinct style of customized clothing and accessories, share them with friends via your own web gallery, then wear your own unique fashions!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7kra.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Ubisoft Entertainment","games":null},{"id":0,"name":"Jet Black Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":208359,"name":"Style Lab: Jewelry Design","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208360,"name":"SuDoku & KaKuro Collector's Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208361,"name":"Sudoku & Kakuro Mania Unlimited","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208362,"name":"Sudoku Mania!","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208363,"name":"Bughouse","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Play as Christopher, a kid left home alone with a terrifying STALKER on the loose! Try and survive in this 80's, PS1 inspired, Home Invasion Survival Horror game - OR DIE TRYING!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5c83.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208364,"name":"Heads-Up: Action Soccer","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yj1.jpg","releaseYear":1983,"developers":[{"id":0,"name":"GCE","games":null},{"id":0,"name":"Milton Bradley","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Vectrex"}]},{"id":208365,"name":"MamoBall","genres":[],"avg_score":0.0,"description":"2D multiplayer soccer mobile game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yj2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208366,"name":"My Mermaid Girlfriend","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"You are a normal high school student who has a crush on a cute classmate, Isla. Knowing that she likes a guy who swims well, you decide to teach yourself at the beach to impress her. But you are caught in the waves and get dragged under. Just as you think you’re done for; someone appears and saves you.\n\nAs you open your eyes, you find out there are three girls arguing-Isla and another two girls. The two girls are clearly aren’t human; they have Killer Whale tail and jellyfish-like hat in their body. Surprised, you try to run away but Isla comes after you. But in the process, you both fall into the water and you see Isla turn into a mermaid!\n\n“We are going to watch you… not to disclose our secret!”\n\nYour normal life starts to roll dynamically with Isla’s sudden kiss…Now, can you imagine how will your story end like with these unique girls?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yj3.jpg","releaseYear":2019,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208368,"name":"My Time Traveling Girlfriend","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"College life is going pretty well for you. You get along with your roommate, you’re doing well in your classes, and you spend your free time hanging out with your nature-loving childhood friend Emily.\n\nThen, one day, you decide to take a walk along an unfamiliar road. There, you find a mansion inhabited by two mysterious girls named Ceres and Astra. Something about them just doesn’t seem quite right, and they soon force you to leave. Determined to find answers, you investigate them further, but you aren’t prepared for what you’ll find.\n\nFor the two girls are time travelers from the future… and they have an urgent mission: find the three ingredients they need to cure Astra’s rare illness and save her life.\n\nAnd now that you know the truth, they need your help.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yj4.jpg","releaseYear":2019,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208369,"name":"Trivia Crack Explorer","genres":[],"avg_score":0.0,"description":"Do you want to play without waiting for your opponent to finish a turn? This is a new Trivia Crack experience to be enjoyed alone. Alle the trivia goodness, without any interruptions.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yj7.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Etermax","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":208370,"name":"Trivia Crack Adventure","genres":[],"avg_score":0.0,"description":"A new kind of trivia game is here! Put your explorer spirit to the test with Trivia Crack Adventure, from the creators of Trivia Crack. Jump into Mountain Track, roll the dice and answer questions about your favorite topics. Become a trivia star and get new collectibles to customize your experience!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yj8.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Etermax","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":208371,"name":"Hentai Dream","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The girls fall asleep and wake up in a fairy-tale world full of bright colors and emotions. In that dream, girlfriends discover each other in a new way ...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yja.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Yummy Yummy Studio","games":null},{"id":0,"name":"Hunny Bunny Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208372,"name":"Overdungeon - Mr.Almighty (Card Pack)","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Overdungeon will release a DLC, containing a brand new card pack, Mr. Almighty on Thanksgiving!\n\nThis new pack features all manner of powerful Overload cards. No matter how many Overload you got in a turn, you can at least draw 2 cards next turn, which grants you the mighty force to smash the enemy in a single turn!","imageUrl":"Sin imagen","releaseYear":2019,"developers":[{"id":0,"name":"PocketPair","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208373,"name":"Tangram","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Tangram is a puzzle game released built-in Tec Toy Master System consoles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yjb.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Tec Toy","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Sega Master System/Mark III"}]},{"id":208374,"name":"KC Returns! II","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5wb1.jpg","releaseYear":-1,"developers":[{"id":0,"name":"‪Averett and Associates LLC","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208375,"name":"Animal Football","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2003,"developers":[{"id":0,"name":"Phoenix Games","games":null},{"id":0,"name":"The Code Monkeys","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"}]},{"id":208376,"name":"ProBee","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A fast paced, team based arena game, in which the players control cybernetic athletes to measure their skills at Ultimate Frisbee and Parkour. Strategically place yourself around the arena to catch your team’s passes.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5mni.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208377,"name":"Missing Cat","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Please find Nuri, the cat that disappeared while I was picking up the feed!The protagonist and the cat (Nuri) who lived in a peaceful countrysideWhile you're on your way to get food, you suddenly go to the mountains to find a cat who left the house","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zlu.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208378,"name":"ColorCube","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A first-person 3D puzzle game. Objects of the same color cannot collide with each other, and you're no exception. But not only you can change the color of yourself, but also you can change the color of other objects with a wand. This game has 43 levels. It takes about an hour to pass.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5cu2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208379,"name":"Tower Defense King","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Tower Defense game with action and strategy","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yje.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208380,"name":"Fix and Foxi: Episode 1 - Lupo","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zcg.jpg","releaseYear":2000,"developers":[{"id":0,"name":"Similis","games":null},{"id":0,"name":"Ravensburger Interactive Media GmbH","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Color"}]},{"id":208381,"name":"The Jumping Burrito","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yjj.jpg","releaseYear":2022,"developers":[{"id":0,"name":"ThiGames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":208382,"name":"The Jumping Burrito: Turbo","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yji.jpg","releaseYear":2022,"developers":[{"id":0,"name":"ThiGames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":208383,"name":"The Whiskey Story","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Become one of the biggest whiskey company in the world with this breathtaking story of young entrepreneur with small dream which comes through.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yjk.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Webnetic s. r. o.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":208384,"name":"The Czech Run","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The Czech Run is an infinite runner game, where you play as a typical Czech tourist, who is on vacation. Run through the mountains, dodge obstacles, and win the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8crd.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Webnetic s. r. o.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":208385,"name":"Bicolor","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Bicolor is a beautiful and minimalist puzzle game featuring 240 handmade levels. Each of them is made of only two colors! Are you ready for this new challenge?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co72kd.jpg","releaseYear":2016,"developers":[{"id":0,"name":"1Button","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":208386,"name":"The Heart of Sourcerer","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"\"The Heart of Sourcerer\" is a short, comic-style RPG!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208387,"name":"Rocket Bunnies","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The debut game from the makers of Ski Safari, and the best space rabbit sim you'll play this year!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208388,"name":"Tactical Warrior","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Tactical Warrior is a strategic RPG with fast paced, turn based battles. Battle the men and beasts of the land as you discover new items and strengthen your team of warriors.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208389,"name":"Forrest Gump: Match 3 Game","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208390,"name":"Legends of Destiny","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208391,"name":"Legends of the Shadows","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208392,"name":"Legends of the Past","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208393,"name":"Megamaze","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208394,"name":"Anastasia","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co99rm.jpg","releaseYear":2001,"developers":[{"id":0,"name":"Midas Interactive Entertainment","games":null},{"id":0,"name":"The Code Monkeys","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"}]},{"id":208395,"name":"Heaven Knows You","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"heaven knows you is a short romance visual novel about Inno, an explorer trapped inside a buried castle in the desert. there, she falls victim to a spell that waited hundreds of years to be cast. there are witches there. it was developed as a collaboration between drinkrust and enzu.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co923e.jpg","releaseYear":2022,"developers":[{"id":0,"name":"drinkrust","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":208396,"name":"Nitori-chan Dash","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A doujin game by ISY based on the Touhou Project series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yjn.jpg","releaseYear":2017,"developers":[{"id":0,"name":"ISY","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208399,"name":"Gangs of Sherwood","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Fight the armies of the Sheriff of Nottingham and lead the rebellion, solo or in co-op with up to 4 players. Play as one of the Merry Men, combine your attacks, and free the people in this futuristic dystopia inspired by the legend of Robin Hood.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6z4e.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Nacon","games":null},{"id":0,"name":"Appeal Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 5"}]},{"id":208400,"name":"Kirby and the Forgotten Land","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"The first level of the Switch game, now available on your Gameboy Color! Features most mechanics from the original game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yjz.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"},{"id":0,"name":"Game Boy Color"}]},{"id":208401,"name":"Cute Kaizo World","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Extremely easy and forgiving kaizo hack. Accessible to beginners, and hopefully nice for the average player to breeze through.\n\nMario has Reznorvations for dinner at the Castle, and you must help him get there.\n\nI hope you have fun.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yk3.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Slopcore","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 64"},{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":208402,"name":"I.Rule","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"I.Rule is a tower-defense fangame based on The Binding of Isaac: Rebirth and Plants vs. Zombies.\n\nIt's a roguelite where you fight monsters using babies with different abilities, based on familiars from The Binding of Isaac. Fight bosses, complete various challenges and craft the most effective strategy to win!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yk5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"}]},{"id":208403,"name":"Dicey Dungeons Reunion","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This is a major new DLC for the game – six new episodes, one for each contestant. There’s new music, new art, new equipment, and of course new gameplay!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yk6.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Terry Cavanagh","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Android"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"iOS"},{"id":0,"name":"Xbox Series X|S"}]},{"id":208404,"name":"Hina-chan no Yakiniku Party","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A doujin game by ISY based on the Touhou Project series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yk8.jpg","releaseYear":2015,"developers":[{"id":0,"name":"ISY","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208405,"name":"Anna-san tachi no Fushigi no meikyuu","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Anna-san tachi no Fushigi no meikyuu is a roguelike game produced by Capricorn.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yka.jpg","releaseYear":2021,"developers":[{"id":0,"name":"CAPRICORN","games":null},{"id":0,"name":"DLsite","games":null},{"id":0,"name":"BEEP","games":null},{"id":0,"name":"Toranoana","games":null},{"id":0,"name":"Melonbooks","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208407,"name":"Portal: Forever Testing","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Portal: Forever Testing Is a Fan-created Modification for Valve Software's Portal 2, containing various custom-built levels for the game.\n\nInitially started in 2019 as a small map pack for Portal 2, Portal: Forever Testing has been separated into a stand-alone mod for the game after many iterations.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ykf.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Fennecai Fox Creative","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208409,"name":"Bee Leader","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The bees need you! Become a Bee Leader and help the bees fill their hives with honey.","imageUrl":"Sin imagen","releaseYear":2012,"developers":[{"id":0,"name":"Flightless Production","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":208410,"name":"Stars in the Trash","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Stars in the Trash brings the magic of animated movie classics into a narrative-driven platformer that combines action, exploration and puzzles. Tired of feeling trapped at home, Moka, a spoiled cat decides to run away and seek adventure. Explore, make friends, fight, and escape from the kennelman.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co57le.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Valhalla Cats","games":null},{"id":0,"name":"IndieArk","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208411,"name":"Time Only Knows","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"You’ve lost your memories and three beautiful girls named “Chirol Saotome” have shown up before you all claiming to be your girlfriend!\nWho are they and what could they be after?!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ykq.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Genius Studio Japan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":208412,"name":"Doki Doki Takeover!: Bad Ending","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Experience what goes wrong in an official alternate ending to Friday Night Funkin': Doki Doki Takeover.\n\n3 Hard-only songs await as the club spirals into glitchy madness.\n\nWARNING - This mod features the following:\n>Strong horror content\n>Flashing lights\n\nWe do not recommend you play this mod if either of these things make you uncomfortable.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ykr.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208413,"name":"Zorpon","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"You do not know what Zorpon is.\n\nYou must discover Zorpon.\n\nTruly Understanding Zorpon shall surely put you on the road of enlightenment.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yks.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208416,"name":"Crown Wars: The Black Prince","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"As the Hundred Year War rages on, assume the head of a noble family and seek out glory in this tactical turn-based strategy game. Fend off enemy factions and battle an evil force that has corrupted the highest echelons of society, exploiting the conflict for its own gain through a violent and mysterious cult.\n\nFrom your castle, recruit, equip and train soldiers to fight your enemies and protect the population. As you face the challenges thrown at you, your skills in management and diplomacy will be put to the test. With the world on the brink of collapse, there is only one solution: Evil must be defeated.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7pvv.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Artefacts Studio","games":null},{"id":0,"name":"Nacon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"}]},{"id":208417,"name":"Ravenswatch","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Fallen heroes of old folk tales and legends: you are on the verge of a crucial battle against the Nightmare invading and corrupting your world. A roguelike action game from the creators of Curse of the Dead Gods, playable solo or in online co-op.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8vwy.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Nacon","games":null},{"id":0,"name":"Passtech Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series X|S"}]},{"id":208418,"name":"Paradize Project","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Fight, Hack, and Survive! Alone or with friends, explore a mysterious open-world infested by zombies. Collect materials, craft weapons, and fight for your life. Learn to hack zombies to assist in fighting, protecting, or farming. Welcome to Paradize!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ykz.jpg","releaseYear":2024,"developers":[{"id":0,"name":"EKO Software","games":null},{"id":0,"name":"Nacon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208419,"name":"Terminator","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[{"id":0,"name":"Nacon","games":null},{"id":0,"name":"Nacon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox Series X|S"}]},{"id":208420,"name":"Voltage High Society","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"First-person Metroidvania. Fight and explore a decayed city ruled by cybernetic monsters, find upgrades and weapons to unlock new areas. Cyberpunk and body horror with gritty retro aesthetics.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co55d2.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Platonic Partnership","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208421,"name":"Starting Life In Another World Naked","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"You will venture into a world much like ours before you are \"taken\" to another world, a fantasy world. You are the hero of this new world, but sadly you start off with nothing. You must survive and build your way to defeating the Demon King; that's why you were summoned in the first place.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yl2.jpg","releaseYear":2022,"developers":[{"id":0,"name":"AsGLeague","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208422,"name":"Carnivores +","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"The spiritual successor to the now defunct Carnivores Reloaded, Carnivores+ is a partial conversion mod for Carnivores 2 whose goal is to recreate the first Carnivores game on the Carnivores 2 engine. Its goal is not only to recreate the assets, looks and atmosphere of the original game on the more advanced engine, but also to extend on the concepts of the original while remaining true to the spirit of what made Carnivores great. The mod adds new terrain to Carnivores' original maps, entirely new areas never seen before and new huntable and ambient animals to the roster to supplement the old classics.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yl3.jpg","releaseYear":2017,"developers":[{"id":0,"name":"P.Rex","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208423,"name":"Freeland","genres":[],"avg_score":0.0,"description":"freeland is an infinite prairie, away from buzz and noise, where you can mentally stay, rest and regain your strength and balance, through nature, solitude, and serenity.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yl9.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Li Yang","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Mac"}]},{"id":208424,"name":"Dr. Mario","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Dr. Mario is a falling block tile-matching video game, in which Mario assumes the role of a doctor, dropping two-colored medical capsules into a medicine bottle representing the playing field.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zyc.jpg","releaseYear":1990,"developers":[{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Game Boy"}]},{"id":208425,"name":"Arcade Archives: Rabio Lepus","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"\"Rabio Lepus\" is a shooting game released by Video System in 1987.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yld.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":208426,"name":"Frogo","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yle.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":208427,"name":"Necrocrisis","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Necrocrisis is an on-rails fight for your life through a graveyard full of gun-toting zombies.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9ccn.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Strangest.io","games":null},{"id":0,"name":"Strangest.io","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":208428,"name":"Delivery Quest","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Deliver the package and escape the cursed sword.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208429,"name":"Art7","genres":[],"avg_score":0.0,"description":"1-bit Art Gallery for the Playdate console","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":208430,"name":"OneBit Berzerk","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Classic arcade Berzerk gameplay for your PlayDate console","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":208431,"name":"Rachel's Game Pack","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A pack of minigames for the PlayDate","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7c6j.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":208432,"name":"Skull and Bones: Premium Edition","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Skull and Bones Premium Edition includes:\n- Base game\n- Up to 3 days early access.\n- The Ballad of Bloody Bones Collection\n- 2 extra missions: The Ashen Corsair & Bloody Bones Legacy.\n- Digital Artbook of 84 pages and digital selected game soundtrack.\n- Smuggler Pass token (Unlocks a premium battle pass and additional content. Usable when new seasons release.)","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co68uo.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Ubisoft Berlin","games":null},{"id":0,"name":"Ubisoft Singapore","games":null},{"id":0,"name":"Ubisoft Entertainment","games":null},{"id":0,"name":"Ubisoft Chengdu","games":null},{"id":0,"name":"Ubisoft Blue Byte","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"}]},{"id":208433,"name":"Let's Build a Zoo + Dinosaur Island Bundle","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Experience Springloaded's Zoo management sim Let's Build a Zoo, alongside the newest DLC, Let's Build a Zoo: Dinosaur Island, with the ultimate bundle!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ylh.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Xbox One"}]},{"id":208434,"name":"One True Hero","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"One True Hero is an epic 3D platforming adventure featuring a young hero who can barely save himself! Explore ancient ruins, defeat an army of evil minions and unravel the mystery of the sinking town!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5jyx.jpg","releaseYear":2022,"developers":[{"id":0,"name":"No Gravity Games","games":null},{"id":0,"name":"Rat Cliff Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":208435,"name":"Dead Train","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A zombie survival game that takes place in a post-apocalyptic wasteland. You must manage your food and water carefully because resources are limited. You need to make your way to the end of the railway and back to civilization.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5g1v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208436,"name":"E-Elementals","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"In E-Elementals you will play as E-Elemental 1k7. E-Elementals are advanced bots that are tasked with doing a variety of different tests and trials. Initially the tests seem normal, but 1k7 will quickly learn the truth behind them...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5gmr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208437,"name":"Mars 2055","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"You wake up, alone, on a planet that appears to be Mars. There is not much else I can tell you.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5kog.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208438,"name":"City Limits","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Relax and build cities on a desolate tranquil island. Plan ahead to cover the island efficiently by combining buildings and cementing your place on a tile. Each turn an entity spreads, attempting to take over barren or unstable tiles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co52ku.jpg","releaseYear":2022,"developers":[{"id":0,"name":"SpaceMyFriend","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":208439,"name":"Land of Nod","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Land of Nod is a low-poly art-style sci-fi shooting game. The player will fight against colonial leaders on a far beyond colony planet: The Planet Nod. And explore the secret hidden in this planet and the entire universe.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5iam.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208440,"name":"The Horror of Oz","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Horror of Oz is a maze runner that has Dorothy returning to a frightening rendition of Oz, where she must peruse through dark and treacherous mazes in search of escape, while being chased by corrupted versions of her dearest friends.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5n4c.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Sunamii","games":null}],"libraryGames":null,"platforms":[]},{"id":208441,"name":"Never Ends Act","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5jpc.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208443,"name":"Light Them Up","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Light Them Up is an ambient PC puzzle game about constellations.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ixb.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208444,"name":"Fracture: City of Destruction","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Welcome to Fracture: City of Destruction. An online multiplayer First Person Shooter offering a fast paced, arcade style shooter experience. Customize your weapons with camos, optics, and weapon kits and jump into battle.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5och.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208445,"name":"Party Pie","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Party Party is a VR party game, you can draw and share your own characters, chanllenge large number of unique levels with them. We will also add the map editor in the future , you can create your own levels!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5kbh.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208446,"name":"Dreamland: Village Life","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A Reimagined Open-World Game Inspired by Classics. Farming, Fishing, RPG Adventures, Weapons Manufacturing, Mining, Diving, World Exploration, and Making Friends with Cute Villagers!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5hkw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208447,"name":"Descension","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Descension is a Horror themed FPS That features FREE episodic releases, and large open-world environments.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5g61.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208448,"name":"Forza Horizon 5: 2019 Nissan 370Z Nismo","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Forza Horizon 5 2019 Nissan 370Z Nismo","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co90i4.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Xbox Game Studios","games":null},{"id":0,"name":"Playground Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"Xbox One"}]},{"id":208449,"name":"Starship","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In the game, you have different spaceships and 13 different skills. Gain money, parts, and skill pieces in victory and create your own ship skill set. In combat, anticipate your opponent's actions, avoid his damage, allocate energy properly, deploy skills, and push him to his death step by step.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5o7p.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208450,"name":"Nympho's Path","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Nympho's Path is a hentai puzzle game for adults, where your goal is to defeat every enemy who stands in your way of pleasure. Are you ready to make everything try to satisfy your lust?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5juw.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208451,"name":"Prostitute Simulator","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Experience the life of an attractive and sensual prostitute and seduce your clients in a city full of policemen, gangsters and cheated women in Japan, where prostitution is prohibited and your life is in danger at every corner.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5mpi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208452,"name":"Strong Moon","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Explore Lunaria's planet and become stronger with new allies help, Moon Shards and Strong Moon's mighty muscles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7if1.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":208453,"name":"Zaccaria Pinball: Deluxe Tables Pack 1","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ym7.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"}]},{"id":208454,"name":"Box to Box","genres":[],"avg_score":0.0,"description":"A fun platform puzzle game. 20 levels are waiting for you to challenge. Gamepad","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208455,"name":"Zaccaria Pinball: Zombie Invasion","genres":[{"id":0,"name":"Pinball","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ym8.jpg","releaseYear":2019,"developers":[{"id":0,"name":"Magic Pixel Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":208456,"name":"Crypt of the Serpent King: Remastered - 4K Edition","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ym9.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"}]},{"id":208458,"name":"Censored Files","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Censored Files is the one and only crime fiction word-puzzle game!\nUse your sixth sense to figure out what happened.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208459,"name":"Retro Pocket Rocket","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Launch your rocket into a new galaxy in the Retro Pocket Rocket universe. Join our astronauts and get an interstellar score by destroying asteroids.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ymd.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208460,"name":"Crazy Plane Landing","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Fly high and try to stick the landing. Will you survive or will you crash?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yme.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208461,"name":"Our Summer Sports","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Beat the heat with some thrilling summer games! Pass around the Joy-Con controllers and compete with up to four players! From Surfing to Jet Ski and even the Water Slider, there are ten exciting sports to try!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5wd5.jpg","releaseYear":-1,"developers":[{"id":0,"name":"SAT-BOX","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208462,"name":"Mira: A Bird's Flight","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Play as a bird, avoid traps, over 46 levels, and a final boss to beat","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4z0c.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":208464,"name":"Runewatch: Age of Arcanum","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Runewatch is a Single-Player Roguelite First-Person Shooter with Role-Playing Game elements for PC. The player controls an elementalist who makes use of their magic abilities while exploring randomly generated dungeons, defeating enemies, and progressively becoming a master elementalist through exploration, killing, death and repetition.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ymh.jpg","releaseYear":2022,"developers":[{"id":0,"name":"D4 Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208466,"name":"Code: To Jin Yong","genres":[],"avg_score":0.0,"description":"Code: To Jin Yong is a tribute to well-known wuxia writer, Jin Yong. The new game is based on the world created in his wuxia novel series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yih.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Tencent Games","games":null},{"id":0,"name":"Lightspeed Games","games":null}],"libraryGames":null,"platforms":[]},{"id":208467,"name":"La Isla de lo Mono","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A black humour parody of the videogame \"The Secret of Monkey Island\" featuring characters from the argentine web series \"Alejo y Valentina\".","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7chl.jpg","releaseYear":2006,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208469,"name":"Shutokou Battle Gaiden: Super Technic Challenge","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Shutokou Battle Gaiden: Super Technic Challenge is a Racing game, developed by Mitsui & Co. and published by MediaQuest, which was released in Japan in 1996. It features 25 licensed vehicles. The gameplay consists of drifting your vehicle with arcade-like handling in drift zones and recieving scores based on the angle, length and speed of the players's drift. Events are set up as a 1 v 1 battle between the player and a CPU, with the winner being whoever has the highest drift score at the end of the lap.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yml.jpg","releaseYear":1996,"developers":[{"id":0,"name":"Mediaquest","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation"}]},{"id":208470,"name":"Cube","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A short and sweet game about pushing cubes, inspired by the Game Boy's graphics.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ymm.jpg","releaseYear":2022,"developers":[{"id":0,"name":"LooseTile Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208471,"name":"Chatbotaged","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Chatbotaged is a twitch interactive Chase horror game built in Unreal, where the player assumes the role of an unnamed clone, developed solely for the purpose of testing and demonstrating the effectiveness of Genespliced weapons developed by a company called Pyontech Industries.\n\nThe clone's task is to find the correct keycard in a contained space, while avoiding and potentially escaping the Weapons.\n\nTo raise the stakes, there's a timer, and Twitch Chat has the ability to \"bend the rules,\" in ways that modify the game's behavior.\n\nWill the player escape? Will the clock run out? Will Chat have mercy? There's only one way to find out!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5fwr.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Poor Rolemodel","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208473,"name":"Dungeons of Sundaria","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Dungeons of Sundaria is an action-packed RPG where Heroes adventure through epic dungeons facing fearsome creatures either solo or with a group of friends. Master your class, loot everything, and destroy the foul creatures of the deep!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ymw.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Industry Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"}]},{"id":208474,"name":"Do not Donut.","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ymx.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Kasatana","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":208475,"name":"Eye Can See You","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"“Eye Can See You” is an otome horror game that follows a girl with psychic abilities that allows her to see spirits. As she enters a new school, she finds spirits residing in her school and makes it her goal to help them fulfill their deeds. But there is evil lurking in the shadows with its own agenda.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ymz.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Gongon Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208476,"name":"The First Descendant","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Launched in July 2024, The First Descendant is a next-generation third-person co-op action RPG looter shooter featuring high-quality graphics developed using Unreal Engine 5. In the game, players become a Descendant whose mission is to combat against alien invaders – The Vulgus who crossed dimensions over 100 years ago and brought with them the devastating Colossi and destruction– for the survival of humanity and to protect Albion and the continent of Ingris. Players will encounter spectacular stories as they grow stronger through various missions and raids to finally discover the Descendants' secret. Cooperation is crucial as players team up with one another in strategic 4-player boss fights where teamwork and tactics are key. New equipment, materials, and items obtained through a myriad of missions and boss fights will contribute to players’ character development.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co94bd.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Nexon Games","games":null},{"id":0,"name":"Nexon Korea","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 4"}]},{"id":208478,"name":"Yamabiko ha Ojou-sama no Osoba ni","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"A doujin game by Nuu based on the Touhou Project series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7781.jpg","releaseYear":2018,"developers":[{"id":0,"name":"BOOTH","games":null},{"id":0,"name":"Nuu","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208479,"name":"Mega Man Eternal","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Mega Man Eternal is a fan game made by Daniel Page. In the year 20XX, the world was at peace for the time being, all thanks to Mega Man putting an end to Dr. Wily's schemes once more. During this time, Dr. Light had developed a new prototype technology to enhance Mega Man's memory and copy abilities called the \"Mega Data\". He intends to use the data to bring back all his previous creations to destroy Mega Man and take over the world. Using the Mega Data, Dr. Wily even created eight original Robot Masters as a part of his new Mega Data Number (MDN) series. Now it is up to Mega Man to stop him, save Rush, and put to stop to Wily's evil scheme again.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ypc.jpg","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208480,"name":"FSR: French Street Racing","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"A racing game in which we participate in competitions held in different corners of the title France. We choose from fifteen different sports machines, which can also be tuned to a large extent.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ypd.jpg","releaseYear":2008,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208481,"name":"Inflation RPG","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A game where the goal is to raise your levels within a limited number of battles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8pbx.jpg","releaseYear":2013,"developers":[{"id":0,"name":"Tatsuki","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":208482,"name":"Werft-Simulator 2013","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ype.jpg","releaseYear":2012,"developers":[{"id":0,"name":"astragon Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208483,"name":"Cooking Academy 2: World Cuisine","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Cooking Academy 2 is the second entry in a cooking simulator series. The goal remains the same, the player has to use the mouse to slice and dice vegetables and meat on the chopping board, liquefy ingredients in the food processor, and perform other common kitchen activities before the timer at the top-right corner reaches zero.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7wwt.jpg","releaseYear":2009,"developers":[{"id":0,"name":"Big Fish Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208484,"name":"Patchy's Magical Maze","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A seamless blend of first person dungeon crawling with fast-paced action RPG combat, explore the magical maze as Alice while fighting off foes as her doll, Shanghai.\n\nProject made for Touhou Pride Game Jam 4.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yn8.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208486,"name":"Shadow the Ronin: The Revenge to the Samurai","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Dokuganryū, a legendary samurai of ancient capital imperial was deprived and expelled from their lands, and all your family was killed by the orders of the emperor.\n\nAfter these events, he swore vengeance against his opponents until death. However, the emperor knowing of Dokuganryū's plans organized a group of ninjas highly trained assassins to defeat him.\n\nThus begins a long and bloody battle in the Edo period.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yiz.jpg","releaseYear":2020,"developers":[{"id":0,"name":"LGS Games Productions","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":208488,"name":"ExpressLane","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"ExpressLane is a 32 player multiplayer 1st person shooter. You and your friends team up to destroy enemy teams' respawn points, while defending your own. The map is built from randomly-selected floating islands connected by ExpressLanes that players can fly through. Last team standing wins!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5i4p.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208489,"name":"BloodPit: Skelton II","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Find travelers and fight mutants through the violent waves and endless levels of the blood pits.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7gmq.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208490,"name":"Hexoplanet","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"You take control over a robot civilization that recently achieved self-consciousness and needs to prepare a new planet for their masters, the humans.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5e9c.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Sirnic Games","games":null},{"id":0,"name":"Sirnic Games","games":null}],"libraryGames":null,"platforms":[]},{"id":208491,"name":"Combo Card Clashers","genres":[{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Tactical","games":null}],"avg_score":0.0,"description":"Combo Card Clashers is an auto battler meets roguelike deckbuilder - Choose cards for your combo grid and play them all each turn! Build a balanced deck, craft powerful card combos, and use tactical decisions to unravel each hero's mystery while saving the world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7avr.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Erabit Studios","games":null},{"id":0,"name":"Burnt Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208492,"name":"Smash","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This game takes you into the mysterious world, where each level is striking in its beauty and harmony. You have to explore it.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5lys.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208493,"name":"The Legend of Zelda: Mystical Seed of Wisdom","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Legend of Zelda: Mystical Seed of Wisdom is an unreleased game in The Legend of Zelda series that planned to be a released with Mystical Seed of Courage and Mystical Seed of Power. The game was cancelled due to difficulties linking all 3 games together. Some of its elements were integrated into Mystical Seed of Power, which was renamed Oracle of Seasons, while Mystical Seed of Courage became Oracle of Ages.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[{"id":0,"name":"Flagship","games":null},{"id":0,"name":"Flagship","games":null},{"id":0,"name":"Capcom","games":null},{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Color"}]},{"id":208494,"name":"Gary Grigsby's World at War: A World Divided","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Gary Grigsby’s World At War: A World Divided brings you to back to the dawn of the greatest and most terrible war the world has ever seen. Take command in this dynamic, turn-based strategy game of World War II that puts you in the role of some of the most legendary leaders of history. In Gary Grigsby’s World At War: A World Divided, you have complete control over the production, research and military strategy for your side.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yno.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Matrix Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208495,"name":"Gun Star","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Doujin game of the comedy slice-of-life series LuckyStar... with guns! GunStar takes the player in a series of side-scrolling levels blasting everything in sight, but unlike most side-scrolling shooting games GunStar aims for an FPS experience in 2D with WASD movement and mouse aiming, even emulating weapon recoil.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yog.jpg","releaseYear":2007,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208496,"name":"Night Detective: Decrepit Manor","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Night Detective: Decrepit Manor is a retro styled and retro inspired point-and-click adventure. Solve the mystery of the Decrepit Manor by following clues, examining objects, and finding new items to help you through the manor.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yoh.jpg","releaseYear":2022,"developers":[{"id":0,"name":"TreeFall Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":208497,"name":"Dragon Blaze","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Dragon Blaze is a vertical-scrolling shooter game that first appeared in arcades in 2000. The heroes are the four dragon riders. Attack using normal shots, bombs, magic shots, and powerful close-range dragon shots.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yoi.jpg","releaseYear":2022,"developers":[{"id":0,"name":"City Connection","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":208498,"name":"Kingdom of Drift","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yol.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":208499,"name":"Easter Candy Run","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Easter Candy Run is a Runner style arcade game where the user leaps and dashes through obstacles to get to the finish line. Play and survive through 12 levels as you complete your quest as a Blue Bunny.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yom.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Smobile","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":208500,"name":"Hack Net","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A seemingly routine request for help turns deadly quickly in this version of the Hack RUN series! When the network you are hired to hack reveals its secrets, will you be able to use that information for good? Hack Net uses old-school prompts (like DOS and UNIX) to access virtual programs and systems. Gain access to users’ files and emails to discover new ways to dig deeper and deeper.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yop.jpg","releaseYear":2014,"developers":[{"id":0,"name":"i273 LLC","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":208501,"name":"Hack Watch","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Apple Watch support! Ever wanted to be a hacker? Your adventure continues as you're asked to save the world again. Hack Watch uses complex memory puzzles to simulate hacking into enemy systems. As you unravel the details of your secret mission, you will learn about your opponents and how deadly they can be.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yoq.jpg","releaseYear":2015,"developers":[{"id":0,"name":"i273 LLC","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":208503,"name":"Fire Fighter","genres":[],"avg_score":0.0,"description":"Deus Apparatus, an evil machine, has set fires to five regions. In this action packed game, it is your job as a fire fighter to extinguish all the fires. Put out fires before they destroy buildings and trees. These fires spread rapidly, but you can use your ax, water, and shovel to gain control of the fires. Fire Fighter as 50 levels.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7yi8.jpg","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208504,"name":"RedNeg 3Stars","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Doujin bullet hell STG by あうとさいど.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ypj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208505,"name":"Pita-Ten Minigame: Gohan to ka dekimasu","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[{"id":0,"name":"Broccoli","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208506,"name":"New Super Realistic Mario Bros.","genres":[{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"New Super Realistic Mario Bros is a kind of creepypasta game but not really?\nIt starts off normally, like a classic Super Mario Game, but suddenly, it acts weirdly...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yow.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Tassilo59","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208508,"name":"Pokémon XG: NeXt Gen","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Pokémon XG: NeXt Gen is a rom hack of Pokémon XD: Gale of Darkness.\nNotable features include:\n\n- Physical/Special Split\n\n- Gen VII type matchup chart including fairy type\n\n- New set of shadow pokemon and other obtainable pokemon\n\n- Over 100 Shadow Pokemon\n\n- Over 50 Shadow Moves\n\n- Over 75 Wild Pokemon\n\n- Moves and abilities from later generations\n\n- Mostly Gen VII Game Mechanics\n\n- More challenging opponents","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ypz.jpg","releaseYear":2016,"developers":[{"id":0,"name":"StarsMmd","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo GameCube"}]},{"id":208510,"name":"Sloth Simulator Almost","genres":[{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sloth Simulator is a round based combat mini game with fun gadgets and action heavy movement skills to unlock. Play as and upgrade your slot! Defeat enemies and unlock different islands as you adventure!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yp4.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Cyberwave","games":null},{"id":0,"name":"Jonas Manke","games":null},{"id":0,"name":"StudioInkyfox","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208511,"name":"Nantettatte Aki Shimai","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A doujin game by Nuu based on the Touhou Project series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co70qg.jpg","releaseYear":2019,"developers":[{"id":0,"name":"Nuu","games":null},{"id":0,"name":"BOOTH","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208514,"name":"LAZ3RZ","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Fast paced dystopian, action packed, mobility focused, competetive first person shooter.\n\nSail with us through space in the world of LAZ3RZ! You can currently choose one of 8 available characters and meet friends & people around the world\nin the social area or battle your enemies in one of the arenas.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co52sp.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208516,"name":"Popgoes Arcade 2","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A new POPGOES Arcade adventure!\nAnother day working at Fazbear's Fright. Your work has lead you to find old drawings, some vintage training tapes and recently, a real robot from the original location!\nThis attraction doesn't skimp on details. So there's one last thing... To tie everything together, a new arcade game, celebrating the history of Freddy Fazbear's Pizza, was just introduced for the location!\nNow that you've left some voice memos for a co-worker, you have to make sure everything about the game is in working order.\nThat kind of job can't be too hard, right? It's just a simple kids game, right?\nYou don't regret something you've done recently... right?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co66jc.jpg","releaseYear":2017,"developers":[{"id":0,"name":"Kane Carter","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208517,"name":"Dead Oculus","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Dead Oculus is a lethal fast-paced bullet-hell where you can brutalize your foes by wielding custom weapons with cataclysmic attachments","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8ugn.jpg","releaseYear":2024,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208518,"name":"Coin Operated Carnage","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Tactical","games":null}],"avg_score":0.0,"description":"Coin Operated Carnage is a single-player rogue-like complemented by a unique tactical fight mode. Maneuver up to three lovable heroes at a time through tile-based adventures composed of hundreds of unique unlockable game elements interacting with each other.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4zuo.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208519,"name":"Can Gym Break This?","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Competition with yourself will improve your power, memory, and ideas to achieve big things in life. It will make you healthy and with health, you can achieve anything in life. The beautiful environment will give you the pleasure to play the game and try the different modes (Day, Night).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ch4.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208520,"name":"Satus","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Satus - global fantasy strategy, in which you can lead one of the 4 fractions: magicians, dwarfs, dark side, hell virus. Every fraction is unique. Capture all the enemies, arrange the end of the world, build a great empire!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5kpl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208521,"name":"Mountain Offroad Simulator","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Put on your safety helmet because we're starting a new off-road adventure right now!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ll4.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208522,"name":"Summer Road","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Summer Road is a new RPG based on the concept of playing RPGs more casually. It targets people who are tired of AAA RPGs and want to play in a short time, and want to immerse themselves in nostalgia.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ome.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208523,"name":"Revenge of the Orcs: Flag of Conquest","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A fantasy visual novel about the end of an era when humans and orcs are at war. Driven by a burning desire for revenge, one orc hoists a flag of rebellion. Soon, it will become a flag of conquest!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5mer.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Shiravune","games":null},{"id":0,"name":"Dieselmine","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208524,"name":"SGS Operation Downfall","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Project Manhattan failed! Operation Downfall, the Allied plan for the invasion of the Japanese home islands is set in motion. Start with Operation Olympic to capture Kyushu, and move on with Coronet, the landing near Tokyo. Force Japan surrender with the largest amphibious operation in history.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5l21.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208525,"name":"Magicians and Monsters","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Flying battles, controlling Excalibur attacks, taming monsters, land and air battles, experiencing a different magical journey...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5igj.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208526,"name":"Pixa Clicker","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Pixa Clicker is a game in which the objective is to earn an absurd amount of money. To do this you'll need a lot of stores that offer a variety of items or jobs.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5kh2.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208527,"name":"8 Days","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You have 8 days before the final fight. At your current state, you do not stand a chance! Explore this Open World to gain new skills and abilities for the battle. Choose where you go, what you do carefully. You cannot waste time! You have 8 days.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5cwo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208528,"name":"Cells of Immunity","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Become a young white blood cell in training and learn how they mature and fight against invading pathogens. Team up with other types of cells, with unique strengths and weaknesses, and overcome disease for good. To serve and protect the human body at all costs.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5cln.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208529,"name":"SS Survivor","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The last ship against the endless. Exterminate as many as you can, gather points to upgrade your ship, and stack the deck in your favor. Will your choices be enough to overcome the thousands that are hunting you? Survive the swarm in this rogue-lite + survivors + asteroids mashup.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5nzo.jpg","releaseYear":2024,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208530,"name":"Fight For It","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Turn-based, rogue-like adventure of randomness. Roll lots of dice to test your luck.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co59me.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208531,"name":"Neon Breaker","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"You break bricks. There's music. There's chaos.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5j6q.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208532,"name":"A Webbing Journey","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A Webbing Journey is a physics-based sandbox game where you play as a cute little spider. Explore a giant house, create crazy web structures, and complete oversized chores in creative and fun ways.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8mcv.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Fire Totem Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":208533,"name":"Shogun Showdown","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Shogun Showdown is a turn-based combat game with rogue-like and deck-building elements. Position yourself and attack at the right time, upgrade your tiles and combo them to get ready to face the Shogun!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6oh5.jpg","releaseYear":2024,"developers":[{"id":0,"name":"Goblinz Publishing","games":null},{"id":0,"name":"Roboatino","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Web browser"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Linux"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"}]},{"id":208534,"name":"Scare Train VR","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Scare Train VR is a Ghost Train in fully immersive Virtual Reality. A six-minute ride through a Creepy abandoned mine, that is far from empty. Please take a seat and Prepare for Suspense and Jump Scares. Are you brave enough to ride the Scare Train?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5kqq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208535,"name":"Banana Hell: Mountain of Madness","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Jump your way to get the blue diamond as you try to survive a very annoying banana monologue! A REALLY HARD game!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co59j6.jpg","releaseYear":2024,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":208536,"name":"Carnival of Gods: Oppression","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"An imprisoned Tyrant God risks to escape thanks to the help of his disciples. In a mission for your Gods and your people travel to his prison, Limbo, a powerful magical place and stop his rising before its too late or your world will be ruined.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5cil.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":208537,"name":"The Monster Mole","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"An asymmetrical PvP horror survival game where you either try to survive and escape a vicious beast with your teammates, or hunt your prey as the nearly-blind monster that inhabits the surroundings of the fictional town of Dry Lake.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5n8i.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]}]