[{"id":197694,"name":"Catchee","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The simple, happy musical catch em up!\nCatch as many Catchables as you can in this happy little musical Catch-Em-Up! Multiply your points with spin flips and go for perfects to max out your score! Play offline too!\nFree, addictive, fast gameplay with challenging perfects, loads of songs and Catchee themes to unlock!","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197695,"name":"Total War: Medieval II","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Medieval II brings Total War's compelling mix of massive real-time battles and intricate turn-based strategy to iPhone and iPad. Set across three continents during the turbulent Middle Ages, spectacular conflicts and scheming rivals line the path to power as the great kingdoms of the medieval world vie for supremacy. Be it through diplomacy or conquest, trade or subterfuge, you must secure the resources and loyalty required to rule an empire from the shores of Western Europe to the sands of Arabia.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6hdl.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197696,"name":"The Enchanted Cave","genres":[],"avg_score":0.0,"description":"Enter the Enchanted Cave, collecting artifacts, stat gems and gold as you fight to reach floor 100! Use the Escape Wings to teleport out and recover, then head back in with powerful artifacts to delve deeper into the cave each time.","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197697,"name":"Sarcoph","genres":[],"avg_score":0.0,"description":"The Sarcoph monster is back in a new perspective on Action Horror! You are trapped inside a secret floor of an abandoned building. Find and recover the 5 idols back to the elevator. The Occupant guards the idols and will try to stop you. Hide and use your tool to survive.","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197698,"name":"Space Station Racer","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Space Station Racer is a unique racing game that uses realistic space flight physics. Race around 12 different race courses located on imaginary space stations from around the world, using nothing but your powerful thrusters to accelerate, turn, and brake.","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197699,"name":"Street Food South East Asia","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"You inherited your fathers street food stall which has been apart of the family for generations and you will need to bring it back prosperity. Along your journey, you set out to expand your hawker stall empire, pick up gifts, serve up spicy dishes, earn a Michelin star, become a celebrity chef, don't make your customers sick and become the Street Food tycoon.\nStreet Food South East Asia brings back all the simple gameplay from the original but with new RPG gameplay elements.","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197700,"name":"Sbaceball","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Baseball. In Space!\nHit a home run every time in this high scoring baseball batting game. Put the balls through the rings to build up your score!","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197701,"name":"Nifty Drifty","genres":[],"avg_score":0.0,"description":"If you enjoy drifting on the edge of control, then this game is for you! It takes niftiness and practice to avoid the obstacles and get through the checkpoints before the time runs out, it’s challenging, but it’s fun!","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197702,"name":"Magic Guqin","genres":[],"avg_score":0.0,"description":"Magic, miracle and full of imagination… Guqin, a Chinese traditional instrument, brings us the newness with the combination of Chinese ancient culture. Its sweet and agreeable tunes with miraculous eastern appearance will take you to the music journey that you’ve never experienced. Maybe you don’t know music at all, or you have no ideas about eastern culture. It can’t prevent you from experiencing the charming eastern music from Magic Guqin. Even an impromptu can gives you, your family and friends much pleasure. You will definitely fall in love with it! Don’t miss it!!!","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197703,"name":"Die For Metal","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Die For Metal is a 2D Platformer where you play as a pagan metal-viking, battling though 3 worlds, with 45 levels, from ridiculously easy, to extremely hardcore.","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197704,"name":"Jackal Squad: Classic Shooting","genres":[],"avg_score":0.0,"description":"World War II broke out, the Fascists attacked the Allies. Your brothers in arms are hostages behind enemy lines. The Jackal squad has been given a mission to drive an armed jeep into hostile territory in order to rescue and extract prisoners of war. As a soldier of an elite group that has undergone a harsh training regiment to survive in any environment, can you complete this mission and put an end to the war?","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197705,"name":"Bumper Boat Kids Tilt","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Cruise in the endless pool while you tilt the device to bounce off your bumper boat friends and avoid Spike the bumper bully!","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197706,"name":"Moto Hero","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"An endless bike driving game. It`s different every time, and easy to play.\nTilt your device to lean the bike. Touch right screen to accelerate. Touch left screen to brake. Touch both left and right screen to jump.","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197707,"name":"Monkey Drum Deluxe","genres":[],"avg_score":0.0,"description":"Making music has never been so fun, or so easy! Create real music just by drawing and watch as the creatures play your creation. Get creative and re-mix your songs with different instruments, or accessorize your characters with a hat and sunglasses.\nPlay realistic instruments and watch as little jungle animals copy your tunes. See their funny reactions as you feed them bananas, spin them, or bop them on the head! Make them happy and see them reward you with a special song!","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197708,"name":"All-in-One Board Games","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197709,"name":"Arithmagic: Math Wizard Game","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Explore the world as a magician wielding the power of arithmetic! Practice your addition, subtraction, division and multiplication skills by casting, flipping and combining all of your math spells to defeat enemies.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197710,"name":"Poker Tower Defense","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Defend the kingdom and earn spectacular rewards!\nDeploy cards and Heroes with various abilities!\nMerge and upgrade your cards to fend off enemies!\nUse powerful Hero Skills to escape dangerous situations!\nSee what you can do with the cards you've been dealt!","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197711,"name":"Project Plink","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Project Plink is a relaxing, pachinko, or plinko board, style art game.\nIt is the first, of what I hope to be many new and exiting offerings.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197712,"name":"MythForce","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Inspired by beloved 80s cartoons, MythForce unites swords & sorcery with gripping 1st-person combat in a roguelite adventure fit for Saturday mornings. Brave the dungeon alone or join forces with friends to take on an ever-changing Castle of Evil!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nwg.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Aspyr Media","games":null},{"id":0,"name":"Beamdog","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"}]},{"id":197713,"name":"Man at Arms TD","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Man at Arms is the newest hit in TD strategy games! Play fast-paced action gaming with hundreds of units, then collect unique cards to increase the strength of your army!","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197714,"name":"Should Shoot","genres":[],"avg_score":0.0,"description":"With Should Shoot, you can play together on one device! This is the most fun you’ll have playing together on a Mobile device ever! Tired of beating your friends? Then try one single-player modes and set a high-score!","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197715,"name":"Camel Up","genres":[],"avg_score":0.0,"description":"Witness the craziest camel race of all time, as things really go topsy-turvy when camels stack up and entire pyramids turn upside down. As members of Egyptian high society, you gather in the desert with one simple goal: to gain the most money by backing the right camel to win a leg or even the entire race. However, in this race, it’s not just the lucky ones who can beat the odds. Reading the dynamics of the race and having a good sense of timing is just as important when it comes to backing the right camels and taking the victory.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197716,"name":"S&T: Medieval Wars Deluxe","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"In Medieval Wars: Strategy & Tactics you are to lead the armies of England and France as well as the armies of crusaders in three campaigns and try to win the biggest wars and battles of European medieval history. Scenario maps will let you take part in Russian feuds, stop the Saracens under the flag of Charles the Great and lead The Hussites.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197717,"name":"Galaxy Trek","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Also check out Galaxy Trek for iPad - now available in the App Store. The galaxy is being overrun by an invading horde of enemies know as Swarmers. The swarmers are fast and ferocious and attacks in swarms, hence their name. The swarmers have decimated the entire fleet of warships leaving the inhabited planets and remaining spaces stations defenseless.","imageUrl":"Sin imagen","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197718,"name":"Warlords Classic Strategy","genres":[],"avg_score":0.0,"description":"The mission is simple – you should eliminate the other sides by capturing their cities. But victory is never easy - it can only be achieved by building massive armies, training and equipping mighty heroes, befriending legendary allies, and exploring the deep dark secrets hidden within Illuria's ruins.\nSo make your choice! Will you lead the Sirian Knights, the Gray Dwarves, the Storm Giants, the Orcs of Kor, the Elves of Elvallie, the Horse Lords, the mysterious Selentine Empire or the evil Lord Bane? Whomever you choose, fortune and glory await you!\nDetailed User Manual is included. We strongly recommend you to read it through carefully to refresh your memories and know about a few differences between this version and original game.","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197719,"name":"The Escapee","genres":[],"avg_score":0.0,"description":"The Escapee has been remastered and a great number of improvements has been added, such as built in hint system, improved gameplay and controls.","imageUrl":"Sin imagen","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197720,"name":"Sudoku Sweeper","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A minimalist mashup of Minesweeper and Sudoku. Logic puzzle perfection.\nEvery row, column and zone contains a bomb and one of each number. Tap the numbers, avoid the bombs.","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197721,"name":"ShapeOminoes","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The goal is simple: fill generated shape three times using different types of ominoes.\nEach level has its own unique shape to fill and consists of three sublevels that need to be solved in order to unlock the next one. Each sublevel has its own omino type to use. Difficulty is scaling throughout the entire game. In the beginning, levels are simple and teach how to play. After that, they get bigger, more complicated and more challenging. There are over 120 levels in total to solve.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197722,"name":"Rune Ranker","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Rune Ranker is a 2D side-scroll action game. You will play as the new student at the magic academy, \"Rune Academia\". Customize your own character, fight against monster, collect the treasure, explore the world and challenge other students to become the top of Academy, King.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197723,"name":"Dragon's Blade: HoL","genres":[],"avg_score":0.0,"description":"Explore a massive pixel art world and engage in classic turn-based RPG combat in this sequel to the hit RPG series Dragon's Blade!\nCreate your custom party from 9 different classes with unique abilities and set out on your adventure. You'll find challenging dungeons, unforgiving boss fights, dynamic item creation, and a deep elemental magic system that allows for virtually endless character customization and replayability.","imageUrl":"Sin imagen","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197724,"name":"Pixel Machines","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Drive your tiny cars over tabletops, stoves, pianos, and more!\nPlay against your friends online or through challenges and prove who's best!","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197725,"name":"Scotland Yard","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Scotland Yard is the digital version of the award-winning board game. Since its creation 35 years ago, Scotland Yard has sold over four million copies. Now the game enjoyed by millions of people is available as a universal iPad and iPhone app!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8bqc.jpg","releaseYear":2012,"developers":[{"id":0,"name":"Ravensburger Verlag","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":197726,"name":"Light Touch: Pixel Block Escape","genres":[],"avg_score":0.0,"description":"Light Touch brings fluid gaming to the next level.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197727,"name":"Cubix: Match-3","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Over 1,000 levels can vary from 2 to 4 colors for the cubes to cycle through, challenging your abilities by increasing their difficulty even further!\nAnd there's more! Cubix also includes 5 different special cubes that introduce new challenges that fully change the approach you must take to solve a level perfectly. Don't forget to complete 60+ achievements with hilarious pop culture references!\nWant to build your own levels? Cubix comes with a level editor, where you can test and save new levels!","imageUrl":"Sin imagen","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197728,"name":"Project Hyrax: Beyond Time","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Welcome to Project Hyrax: Beyond Time, a gripping interactive fiction that keeps you in suspense from beginning till the end. You will read Robin’s messages and make decisions from the simplest to the life-threatening actions. From mysterious occurrences to exploring the ancient Earth, Robin will communicate with you throughout his extraordinary journey.","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197729,"name":"Ultimate Solid: Origins","genres":[],"avg_score":0.0,"description":"Ultimate Solid is a physics-based game in platform world full of challenging obstacles and fun puzzle elements.\nUnlike the traditional platform games movement is limited to jumping only! By adjusting the strength and angle of each jump, the goal is to not collide with any hostile elements on the way to the finish line. Or rather, a vortex that sucks you all the way in to the next level.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197730,"name":"Climb! A Mountain in Your Pocket","genres":[],"avg_score":0.0,"description":"Climb! A Mountain in Your Pocket, a challenging game about climbing a mountain with an easy to learn, hard to master control.\nOne button to grab with the left hand, another for the right; swing, jump, use your momentum and grab the diverse rocks to help you ascend through the mountain. But be careful, a single mistake could mean a fall down to the base camp.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6g6y.jpg","releaseYear":2016,"developers":[{"id":0,"name":"Ivan Alcaide Ferrer","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":197731,"name":"Pango Kumo","genres":[],"avg_score":0.0,"description":"Become Kumo: a small cloud from Pango's world.\nUse your powers of water and fire.\nEverything is grey and sad.\nBut with Kumo's magic you can bring life and colour back to Pango's World!","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197732,"name":"Pipe Ball","genres":[],"avg_score":0.0,"description":"This is a highly addictive puzzle game where you must route the ball to the finish using pipes and speed boosters. With 45 and 90 degree pipes, steer the ball, bounce off walls, retrieve keys to unlock walls, and overcome the friction associated with turning, bouncing and rolling with 2-way and 4-way speed booster pipes. Get maps, create maps, and compete for the best solution to all maps. Maps are stored on a central server and are shared among users once solved.","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197733,"name":"Railroads of America","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Enjoy a challenging railroad construction time management game in which you have the mission to build a big railroad across United States.\nUse various pieces of railroad, which you have to connect and use, to build a track for the train, from the start to the end station. As you play through the game, levels become more and more complex, as they start to feature terrain elements such as: rocks, water, tunnels.","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197735,"name":"Line of Defense Tactics Prime","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197736,"name":"Rewind: One Last Chance","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Unravel the mysteries of the Rewind in this suspenseful interactive experience in which truth is on trial. When Commander Kole Zamon is captured by those he terrorized, he is put on trial for crimes against humanity. But the Commander’s crimes are not the only thing on trial. His love for his daughter is tested. His loyalties are challenged. His religious beliefs are called into question. Beneath the surface of this Rewind—this mysterious trial—lurks a world of intrigue, a world that needs to be uncovered. In an ever-unfolding plot that twists and turns, the path to truth must be found.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197737,"name":"Ria Action Adventure","genres":[],"avg_score":0.0,"description":"Ria is a mythology-based action-adventure open world overrun by monstrous dark creatures. God has sent his son (Ria) to save humanity and clean it for the first civilization of humans on earth. You’ll set out alone to face down hordes of deadly enemies and epic bosses, and try to prevent the dark souls from summoning the queen of Dark-Soul. If she is awaken , the world will suffer endless time of darkness. It's going to take everything you've got to stop the queen of dark soul from being awaken.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197738,"name":"Tower of Fortune 3","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Tower of Fortune 3 is a retro style Slot/RPG. You play as a hero who must explore the legendary tower and find the way home.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[{"id":0,"name":"Game Stew","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197739,"name":"Dungeon Square","genres":[],"avg_score":0.0,"description":"It is an action adventure game in the form of 2D cross-scroll flatformer.\nExplore 100 square dungeons and defeat monsters.\nMy goal is to get various items and get out of the dungeon.\nIt's a level 1 dungeon consisting of more than 100 rooms.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197740,"name":"It is Highnoon","genres":[],"avg_score":0.0,"description":"It's high noon!\nPlay time for mobsters!\nThey are coming to rob the bank.\nYou must protect the bank from them!\nRemember their faces on the wanted posters and shoot them!","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197741,"name":"Electric Trains","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Electric trains is very dynamic and interactive train simulation game with a third-person view. The game has easy and intuitive controls. You can drive the train and control railroad switches ahead your train. Heavy traffic and railroad configuration will make missions more difficult to accomplish. You can transport passengers, coupling and carry cargo rail cars to earn maximum scores.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8tuz.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":197742,"name":"Retrogram","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Think you're a word nerd? Make as many words as you can using seven letters\nRetrogram is a love letter to the 1970s, and the most stylish word puzzle you'll play all year. Train your brain and discover new words every day\nSubscribe to get the Daily Puzzle. A new puzzle each day, hand-curated and full of interesting stories about your favorite words.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197743,"name":"Mystery At Woodbrook Hall: Hidden Object Game","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Danny and Jen looked up to the sky as the sun slowly began to set on the horizon. Their backs were to the grass beneath them, and they enjoyed the silence.","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197744,"name":"Clash of Clones: kill birds like a ninja","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Do you like bird clones? If not then join us to destroy as many as you can!\nSurvive and kill them all!","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197745,"name":"Little Viking","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"One of the best block breaking game for everyone! Addictive, endless gameplay with gorgeous graphics and sound!\nRules in a little viking's world are simple - prevent columns of blocks from falling from the edge by tapping and destroying two or more blocks of the same color. Time is running out and waves of the columns are increasing with each level! Don't wait, just try it out!","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197746,"name":"Cosmic Badger","genres":[],"avg_score":0.0,"description":"Cosmic Badger is a mobile platform game following the quest of a lone badger to save his planet using the majestic art of teleportation. A meteor is going to collide with the Badger Kingdom and must be destroyed before it's too late.\nCosmic Badger has travelled across the galaxy to track down the celestial bomb, and now he must navigate his way back home in order to destroy the meteor. Help our hero traverse dangerous worlds and avoid blowing up by teleporting past obstacles and terrain. Swipe the screen to place portals where the swipe starts and ends.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197747,"name":"Sticklings","genres":[],"avg_score":0.0,"description":"Sticklings is a unique puzzle game with the mission to get a herd of Stickmans into their goals by using various abilities. Like a Lemming, a Stickman just walks and walks and it is your objective to correctly assign the correct task to a Stickman to lead all other Stickmans the correct path. Abilities include blocking, self destruct, jump, bomb throwing, rush and bridge building.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197748,"name":"Fantasy Clicker of Cute Cocoa","genres":[],"avg_score":0.0,"description":"Fantasy Clicker of Cute Cocoa is a mini-game like a small candy for players to elevate their mood.","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197749,"name":"Finger Tied Jr.","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Fingers feeling nimble? Fingers feeling flexible? Twist, stretch, turn, and tie your fingers in knots to solve these puzzles! Are your fingers up for it?","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197750,"name":"A Knight's Life","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A Knight's Life is the thrilling journey of a young knight in medieval times! Build your new town and explore the lands! Slay monsters, loot bandits, ransack dungeons, and complete the King's quests! Upgrading your weapons and armor makes combat invigorating!","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197751,"name":"Dungeonette for Apple Watch","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You play a brave hero on a quest to enter the huge dungeons of doom and slay the evil reaper that has cast darkness over the land.\nWith your trusty armour and shield you must navigate the maze of dungeons ahead and vanquish all your foes.\nCollect as much gold treasure as possible on your quest and keep yourself from starving by finding food and water.\nYour journey ahead will not be an easy task as the reaper has sent out hordes of creepy monsters to stop you!","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197752,"name":"Cosmos Rings","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The Goddess is gone and time has stopped. Now it's up to you to traverse the Rift and stand against those who would see its flow stilled forever. Regrettably, the path to saving the Goddess of Time is not an easy one.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7rqe.jpg","releaseYear":2016,"developers":[{"id":0,"name":"Square Enix Business Division 10","games":null},{"id":0,"name":"Square Enix","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197753,"name":"Super Gridland","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Match tiles to collect resources while the daylight lasts. When night falls, the same tiles call bloodthirsty monsters to your meagre village.\nWhat else might be found in these lands?","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197754,"name":"MyTP Skateboarding","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Welcome to the streets of Randertown - no crazy bling bling, simply amazing and real skateboard action! Grab your board and explore the huge playground fully packed with rails, ledges, stairs, skateparks, half- and quarter pipes, big airs and sheer endless run possibilities!","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197755,"name":"Lunar Rescue Mission","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Using realistic physics pilot multiple vehicles to rescue stranded colonists from their doomed moons.\nVehicles include the Mothership, Rescue Lander, Magnetic Rescue Lifter, Moon Buggy, Magnetic Cargo Buggy, Cargo Lifter Platform, Cargo Buggy Platform & Crane.\nChallenging game play with a gripping story line, Lunar Rescue Mission delivers action and adventure in an eerie atmosphere.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197756,"name":"Destiny Fantasia","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Save the Earth from its end!\nThe main character, Lidim, works in a weapon shop in the capital of Alfria. He accidentally overhears secret negotiations between two countries. As Alfria doesn't agree to become a colony of the powerful Epsilom Empire, an envoy of Epsilom, who is also a witch, uses an unknown weapon to destroy Lidim's home village as a demonstration of power. Witnessing the tragedy, Lidim loses his temper and assaults an important figure from the Empire...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8xx7.jpg","releaseYear":2013,"developers":[{"id":0,"name":"Kemco","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":197757,"name":"Noukk","genres":[],"avg_score":0.0,"description":"Noukk is an enchanting platform game that has been created with lots of love and a passion for detail.\nThe little huntsman Noukk is trying to save the love of his life and the rest of his tribe, who have been attacked by outlaws and taken hostage. He embarks on a dangerous journey to try and save them all. Along the way he passes many dangers and exciting challenges.","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197758,"name":"Reflex Unit AR","genres":[],"avg_score":0.0,"description":"The year is 2035 and Tokyo has been overrun by an unknown force. Communications with the rest of Japan and the world are down. With the Tokyo Police and Japan Self Defence Force (JSDF) destroyed in the first few hours of the invasion, it is up to you as the rookie pilot of an experimental variable mech to fight back the invading forces...","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197759,"name":"Healer's Quest: Pocket Wand","genres":[],"avg_score":0.0,"description":"\"When evil forces awaken in the darkness, the world needs a team of heroes… But when these heroes are a ragtag bunch of unskilled jerks, only the healer can save the day.\nHealer's Quest is a lighthearted Comedy RPG where you take on the role of the most underappreciated party member in any fantasy realm: the Healer. Joining a band of inept misfits - a bossy tank, a handsome archer, a depraved mage, and a raging barbarian - you must keep your party’s health topped up whilst simultaneously managing dwindling mana reserves.\nNot only can your party be taken down when their health ebbs away, they can also be hit with a range of debilitating status effects. It’s like juggling with magic, and the crowd hates you. If you let party members die, they may well go into a sulk in subsequent encounters. Manage moods with magical curatives, death prevention, and witty dialogue choices.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197760,"name":"Live Cycling Manager 2","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Live Cycling Manager 2 is the ultimate cycling manager game.\nSelect or create the club of your dreams and manage each and every aspect! Become the Sports Manager of a professional team and compete against another 40 teams until you reach the top.\nControl all aspects of your club: from training sessions, transfers, staff, registration in races, racer selection and race strategies, to finances and designing your kit.\nHire the best cyclists, trainers, physiologists, doctors, mechanics... Control the finances and manage the club of your dreams. Overcome all the setbacks that come your way throughout the season.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197761,"name":"Doomdark's Revenge","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Those of you who took up their challenge and rode with them to battle against the cruel Witchking will need no reminding of that epic struggle. But now a new epic tale unfolds, the story of Doomdark’s Revenge.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6q0g.jpg","releaseYear":2014,"developers":[{"id":0,"name":"Mike Singleton","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"BlackBerry OS"},{"id":0,"name":"Mac"}]},{"id":197762,"name":"Castle Raid 2","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Castle Raid is back, bigger and more challenging than ever before! In this unique tug-of-war you once again fight to defend your castle against the enemy’s hoard. Get ready to enter the magical world of noble knights and sage wizards, dragons and assassins, and set out on a new epic adventure. Fight your way through the snow covered lands of the Frozen Plains and the beautiful open fields of the Greenlands. Learn the ways of your new enemy, the Reavers - You’ll be seeing a lot of them.\nCastle Raid 2 features tons of new exhilarating content guaranteed to knock your socks off. Play against your friend on the same device or take on the challenge of completing the game in campaign mode. With 20 new battlefields, three difficulty modes, gladiator and time challenges, 9 unit classes to choose from and upgrade, you’ll be sure to have a great time!","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197763,"name":"Trenches II","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Lead the troops through over 100 locations in a non-linear campaign - engaging in many of the most decisive and game-changing battles of the entire conflict. Customize your army with more than 20 different units. Win battles to earn Perk points and upgrade your offensive, defensive and support forces.","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197764,"name":"ThirdMiracle","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This game is a classic package style.\nStories of rebels against Empire tyranny.\nCharming little girl characters and beautiful stories.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197765,"name":"CuteBoy.TD","genres":[],"avg_score":0.0,"description":"This is the three-dimensional tower defense you have never played. Each level is full of characteristics, simple and interesting! At present, the first season is launched.\nPowerful skill system: properly help soldiers upgrade their skills, which will greatly improve their attack power.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197766,"name":"Trulon","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Enter a world of steampunk and magic by experiencing the debut title of the Trulon series. Trulon - The Shadow Engine is an adventure RPG with a unique card combat system. Battle enemies mutated by magic as you explore the kingdoms of peaceful Tripudia and dangerous Maelon. Unravel the threads of an insidious plot and uncover dark secrets to help bring an end to the mysterious disease threatening Tripudia.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197767,"name":"Club Life Visual Novel","genres":[],"avg_score":0.0,"description":"Sean is in his final year of school, close to the time for him to head off to college, his plans to keep his head down this year and avoid complications are ruined when his teacher demands he join two clubs if he wants her to write him a recommendation for college.\nWith his hands tied there are only a few choices for him to start his Club Life.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197768,"name":"Dungeon Army","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197769,"name":"Shieldwall Chronicles","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"In Shieldwall Chronicles, you lead a mercenary band into the perilous and cold northlands of Tarren. Your search for fortune will see you pitch blade and spell book against a host of enemies including the undead, demons, and lizardmen and many other creatures. In a battle that is part game-book and part tactical RPG, you will build a powerful band of warriors and wizards and tilt the balance of power in the northern kingdoms.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197770,"name":"Gloom: Digital Edition","genres":[],"avg_score":0.0,"description":"Gloom: Digital Edition is a dark, macabre game where your goal is to make your family as miserable as possible while bringing joy and good fortune to your opponent's families.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197771,"name":"Match the Deck","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Match the Deck takes the much loved match 3+ game mechanics and adds strategy and depth, by making you build a deck of Cards!","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197772,"name":"Minimal Maze","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Minimal Maze is a minimalist puzzle game which is played by rotating the mazes.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197773,"name":"Air Hockey Blue","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Arcade style Air Hockey with 3 levels of difficulty.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197774,"name":"Power Grounds","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You are trapped inside a very special temple, surrounded by dangerous monsters. You have no weapons of your own, but the ground is filled with great powers.\nIn Power Grounds, thinking strategically is very important when it comes to choosing your abilities. Would you be swift? Would you be strong? Would you be... wise? It much depends upon the situation.","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197775,"name":"Death Drive","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Death Drive is a deck-building open world survival RPG set in a zombie apocalypse. Combining in-depth turn based combat of card battlers and deck building, open world exploration, skills and character abilities, loot, trading, crafting, managing your caravan and survival all together!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4usy.jpg","releaseYear":-1,"developers":[{"id":0,"name":"ShotX Studio","games":null},{"id":0,"name":"Freedom Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197776,"name":"Hot Lap League","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Take complete control of your vehicle, perfect your driving, and prove your place in the Hot Lap League. Drift and race your car around 150+ mind blowing tracks, each requiring unique techniques and strategies. Improving your time by racing your best is the only way to the top.\nIt’s you, the track and the clock - no driving assist, no nonsense.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5a1k.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197777,"name":"DigRun","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Match-4 Puzzle with new twists and cute characters, and angry, angry blocks!\nA new match-4 puzzle game with unique gameplay and fun twists!\nIf it's colored, you can kill it. The same applies to these blocks too.\nStack them together and blow them in pieces, while charging up super powers and using items!","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197778,"name":"Math and Letters Air Control","genres":[],"avg_score":0.0,"description":"Count, calculate, differentiate between odd and even numbers, recognize alphabet letters, sort vowels and consonants…\nWhile playing, children exercise with numbers and letters.\n3 difficulty levels allow a smooth progression while having fun.\nBy starting with the \"solo missions\", a training camp, kids will learn at their own pace then they can play with the \"adventure mode\" with compulsory exercises.\nThere are 8 different solo missions, with 3 difficulty levels.\nThere are 10 missions in \"adventure mode\", also with 3 difficulty levels.","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197779,"name":"Alien: Isolation","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Engage in a terrifying quest for survival as you navigate the labyrinthine Sevastopol station. Unprepared and underequipped, you will need all your wits and daring to get out alive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co84mu.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Feral Interactive","games":null},{"id":0,"name":"The Creative Assembly","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":197780,"name":"Wicked World #1","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"You lead a band of adventurers into the deep dungeon.\nThis is not easy turn-based RPG.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197782,"name":"Geopoesis: Eos","genres":[],"avg_score":0.0,"description":"We destroyed Hestia, our home, our Earth. You have been charged to execute geopoesis on one of the scarce number of promising, but hostile, alien worlds, Eos. Our only chance of survival is for you to terraform the 13 very challenging areas on this hostile planet.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197783,"name":"Paradox: The Novel","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Paradox: the Novel is a visual novel Role-playing story, set in a strange dimension that is controlled by the forces yet unknown.\nThe world of Eternia was once a peaceful place, until a deception from an unknown source made young prince Henry of Landark start a war to avenge his father. This war was supposed to end after the final battle between Henry and the ruler of Noviest, lady Ayina. It never did, as an Evil Spirit had locked the heroes inside of a chaotic dimension called Paradox.","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197784,"name":"Endless Depths 2 RPG","genres":[],"avg_score":0.0,"description":"Endless Depths 2 is a rogue-like role-playing game that holds true to classic features such a randomly generated dungeon levels, a myriad of class/race combinations, a bunch of treasure to discover and a one-life-one-death difficulty level that can be quite addicting. In addition to what might be expected in a rogue-like RPG, Endless Depths 2 adds a level of persistence to the genre that allows for item farming, crafting, and even increased difficulty levels should a character make it to the end.\nEndless Depths 2 is a sequel to the popular Endless Depths and Endless Nights RPGs available in the app store. It uses the TitanFire RPG system, which focuses on building a strategic defensive combat system. This class-based game encourages a mixing and matching of classes, including special classes that can be unlocked as the character progresses.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197785,"name":"Make a Good Mega Man Level: Episode Zero","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"MaGMML: Episode Zero, an interquel set between the events of MaGMML1 and MaGMML2, is a massive collaboration fangame brought to you by the team behind the MaGMML series! Play as the legendary (?) Reploid (?) Zero as he journeys through over 60 different levels from 40 different creators in a unique blend of Mega Man Classic, X, Zero, and ZX! Blast through levels with the aimable Z-Buster, the trusty Z-Saber, the long-range Z-Burst, and the wildcard Blank Drive, all backed by an expanded version of the elemental chip system from the Zero series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co80sg.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197786,"name":"Peril","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Peril is an action adventure 2d platformer created using Unreal Engine 4. In this game the main character must battle through various worlds and defeat many enemies, all the while using a javelin as both a weapon and a tool to reach new places.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oiq.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Monster Doctor Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197787,"name":"Arabilis","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Arabilis: Super Harvest is an arcade farming puzzle game. You are planting, growing and harvesting vegetables in gardens filled with randomized challenges. Each season will provide a new garden for you to efficiently farm for points. Each year passing will increase the difficulty and amount of challenges you face, how many years can you last? How high will your score be?","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197788,"name":"Battle Alliance","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This a strategy game all about enemy troops trying to break through your defences at any cost. Choose a location, plan your strategy and lead your troops to victory. You alone decide how to use budget available to you – to buy new weapons or to improve and strengthen existing ones. A number of weapons systems (infantry, artillery, high-tech weapons, navy) are available to you. Since the enemy attacks with different kinds of units, it is essential to make the right choice and the right placement. However, make sure that you have only limited resources available and that the weapons systems have different characteristics. If the situation gets too tricky, you'll need air support. But be careful. The enemy has the same options as you! The intelligently designed maps and the wide selection of weapons open up a variety of tactical possibilities and countless hours of entertainment.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197790,"name":"Par 1 Golf 8","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"18 holes, 18 lives, its you against the 2d golf course in Par One Golf 8! To line up your shot, touch the golf ball and drag back then release to shoot. Learn the tricks and beat the golf course. The eighth installment of Par One Golf will challenge you and frustrate you just like real GOLF!","imageUrl":"Sin imagen","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197791,"name":"Convenience Stories","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Are you ready to redefine convenience?\nStep into the shoes of a convenience store manager in this charming business sim. Arrange and customize the store using a wide variety of products - candy, drinks, even hot meals. The choice is yours!\nIt takes care and attention to take your business to the next level. Listen to your customers, help them find what they're looking for, and they might just become regular shoppers!\nWhen the time comes to expand, cooperation is the name of the game. Negotiate with suppliers and other companies to discover new products and unlock your store's true potential!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7gqm.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Kairosoft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":197792,"name":"Rovio Classics: Angry Birds","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Rebuilt from the ground up, Rovio Classics: Angry Birds is a faithful re-make of the original Angry Birds game that took the world by storm!\nThe survival of the Angry Birds is at stake. Dish out revenge on the greedy pigs who stole their eggs. Use the unique powers of each bird to destroy the pigs' defenses. Angry Birds features challenging physics-based gameplay and hours of replay value. Each level requires logic, skill and force to solve!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oyl.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Rovio Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":197793,"name":"Clickmazes BoxUp","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Your goal sounds easy, just push the small red box inside the large blue box. Of course, it's not as easy as it sounds.\nThis is the genuine BoxUp puzzle game, as featured at clickmazes.com, now developed for iPad, iPhone, and iPod touch, by the original BoxUp inventors. The puzzle set includes over 100 brand-new puzzle challenges, with many unique and novel features.","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197794,"name":"Micro RPG","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Monsters have invaded the kingdom, taking advantage of the knights vacation! Crafty!\nOnly Theobald, a small peasant without story, can save the country!\nChange your spade for a sword and become a legend!\nMicro RPG is a turn-based game combining reflex, strategy and luck.\nA missed target or a wrong choice can be fatal!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8vqx.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":197795,"name":"Sparrows","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Mahjong Solitaire meets Scrabble!\nUse the available tiles to spell words and uncover more letters. Combine special tiles for Double Letter, Triple Letter, and Double Word bonuses to rack up the points.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197796,"name":"Deadlocked","genres":[],"avg_score":0.0,"description":"Welcome to Darkvale, you arrive at the outskirts amidst the endless hordes of undead.\nIt would be better to leave this place and you'd be wise to heed this advice.\nRun through distinct biomes while avoiding environmental hazards and obstacles. Defeat undead hordes and gruesome bosses. Select your weapon and upgrade it to suit your playstyle. Acquire new skills and best your enemies.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197797,"name":"M.Duck","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"M.Duck is a roguelite gallery shooter about a duck that knows magic.\nHelp Magic Duck fight his way up the mysterious tower that has been shining light on his pond each night and interrupting his sleep. Battle fearsome foes, discover new relics, uncover the secrets of the tower, and turn off that light once and for all!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o0c.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Protractor Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197798,"name":"Critical Slash","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Explore a procedurally generated world with tons of enemies, treasure, and secrets!\nVast exploration, intense battles, and awesome gear and loot! Endless level progression system!","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197799,"name":"Wizard is Rolling","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Pick your skills and roll 4 wizard dices. If the dice combination matches, you will cast extraordinary magic spells. Let's roll for an epic adventure. More than 70 skills with different dice combination. Build your mighty wizard to fight against more than 70 unique monsters.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197800,"name":"Volley Heads","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Play 1 on 1 volleyball in the gym, or on the beach with the Volley Heads! Hold and drag to maneuver your player, do head volleys or fake out your opponent and hit off the walls, first to 10 points wins!","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197801,"name":"Vacation Adventures: Park Ranger 13","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Help run Pinecreek Hills and New England’s Minuteman Valley Help the famous Park Rangers run Pinecreek Hills. Have fun organizing events on Bluewaters lake, Cherokee river and Apache trail.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5hxt.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Casual Arts","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197802,"name":"Par 1 Golf 9","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"18 holes, 18 lives, its you against the 2d golf course in Par One Golf 9! To line up your shot, touch the golf ball and drag back then release to shoot. Learn the tricks and beat the golf course. The ninth installment of Par One Golf will challenge you and frustrate you just like real golf!","imageUrl":"Sin imagen","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197803,"name":"Circles galaxy","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Circles galaxy is a simple, logic, endless puzzle game. Arrange circles, but do not rush, relax while you play for the most calming of gaming experiences.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197804,"name":"Get Ogre It: Escape Dungeons","genres":[],"avg_score":0.0,"description":"Play as Gobby, a little ogre who's been cursed and turned into a human in this, roguelike dungeon crawler. Shapeshift between ogre and human, escape ever-changing dungeons, deceive and hide from your enemies.","imageUrl":"Sin imagen","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197805,"name":"Space Trader 2018","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Travel the galaxy, become an expert trader, fight pirates, and run from the police in Space Trader! A much-anticipated remake of the hugely popular, timeless strategy game from the 1980s, Space Trader is a historically accurate port of the original Palm Pilot game by Pieter Spronck. It features the original ten commodities and more than 100 original planets, each with unique tech levels, governments, resources, and other characteristics.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197806,"name":"Dungeon Crawlers","genres":[],"avg_score":0.0,"description":"Dungeon Crawlers is a Turn-Based Strategy game. Take command of the Dungeon Crawlers team as they explore goblin-infested hallways, lava-drenched caverns, and other hostile environs in pursuit of loot, women, and monsters to crush.","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197807,"name":"MonsterKill","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"They're cute, they're cheeky - you just want to slice the life out of the little monsters!\nHordes of tiny terrors have broken free of their chains and are running amok! Summon a variety of spells as you battle against these classic mini-monsters in multiple game modes: Normal, Endless & Onslaught!","imageUrl":"Sin imagen","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197808,"name":"Papa Penguin","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Papa Penguin is a simple and cute casual arcade game for children and their parents. Play as Papa Penguin who puts all his efforts in trying to get some fish for his two little children. And as all children, little penguins eat their fish very fast and demand for more.\nHelp Papa Penguin feed his little children!","imageUrl":"Sin imagen","releaseYear":2011,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197809,"name":"Seven Sacred Beasts","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Grow and evolve your monsters and then Summon and battle your monsters.\nDominate arenas to earn your spot as the greatest Summoner in the world!\nThey can also learn skills at Training Camps in town, and monster Eggs, along with other specific monsters, can evolve.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8xx2.jpg","releaseYear":2014,"developers":[{"id":0,"name":"Kemco","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":197810,"name":"Artisan Adventure","genres":[],"avg_score":0.0,"description":"Artisan Adventure is thrilling, innovative new Adventure/Role-Playing Game. Unlike the traditional adventure, here you are free to choose your adventures, featuring a non-linear storyline that will take challenge the Hero with tons of challenges. In the world of Artisan Adventure you are free to go train various skills or go slay the most powerful monsters that threaten the existence of your beloved town.","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197811,"name":"Dofus: Battles 2","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Say goodbye to Tower Defence gameplay and get ready for Tower Attack!\nThis time around, you'll play as Jeff Stobbs, your old enemy, who finally managed to free himself from Naz T Peasawerk's demonic hold.\nTame the World of Twelve's monsters to form an army and use Jeff's new invention, the Slablet, to send them into battle and defeat your foes.\nYour enemies are in position, and so are their traps. They're ready for battle… Are you? Prepare your strategy, line up your waves of monsters and march forth!","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197812,"name":"Sea Crypt: Infinite procedural dungeon crawler","genres":[],"avg_score":0.0,"description":"Explore endless dungeons with your party, gather items and fight enemies!\nAn infinite number of Dungeons are waiting at the Sea Crypt! Pick a party member and fight your way through enemies in increasingly difficult levels. Explore the tunnels and loot items to equip your squad.","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197813,"name":"Heartland","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Help Amy and the crew train horses all over the world in this fast paced time management game. Heartland is a sprawling family drama that follows sisters Amy and Lou Fleming and their grandfather, Jack, through the highs and lows of life on a horse ranch.","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197814,"name":"Vaultbreakers","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"MOBA","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Vaultbreakers is a hardcore top-down PvPvE ARPG that blends epic brawler combat with tense, tactical extraction gameplay. Fight alongside friends —or as a lone wolf— to survive intense, dangerous missions in a dynamic fantasy world. Defeat deadly foes, outsmart rival players, and claim your spoils.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9bwe.jpg","releaseYear":-1,"developers":[{"id":0,"name":"BetaDwarf","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197815,"name":"Battle Hero","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nwv.jpg","releaseYear":-1,"developers":[{"id":0,"name":"LionGames","games":null}],"libraryGames":null,"platforms":[]},{"id":197816,"name":"Calm Colors","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"In the game you will find 200 low poly illustrations to fill (animals, nature, origami and more), solo mode with hours of soothing gameplay, up to 4 players local co-op mode, a simple and enjoyable way to reduce anxiety and train mindfulness\n\nDiscover your inner artist by playing Calm Colors.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nx4.jpg","releaseYear":2022,"developers":[{"id":0,"name":"naptime.games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":197817,"name":"Same! Same! Same!","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A shooting game developed and published by Toaplan, released in 1989. The Original Japanese version of what was released in the west as Fire Shark, 'Same! Same! Same!' is notable for being single-player only and having a dramatically heightened degree of difficulty compared to its western release, as well as lacking a number of glitches that came as a result of the conversion to a 2 player game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9ci1.jpg","releaseYear":1989,"developers":[{"id":0,"name":"Toaplan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":197818,"name":"Hearts of Demons: Revenant","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Hearts of Demon is a compilation of wads allowing you to play as various demons: Baron of Hell, or Revenant. Hearts of Demon features new weapons and player models, as well as many demonic abilities to use.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nxi.jpg","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197819,"name":"Den'ei Shoujo: Virtual Girl Lum","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nxr.jpg","releaseYear":1999,"developers":[{"id":0,"name":"Banpresto","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197820,"name":"Areigna Tactics","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Areigna Tactics is a top-down hex based strategy game taking place in the world of Areigna, a fantasy world of Humans, Goblins, Dwarfs, and much more. Play in this multiplayer real time strategy game online in ranked matches with people all around the world.\n\nUnlike many strategy games which are based on resources held and build times, Areigna’s gameplay and balance focuses instead on cooldowns. These cooldowns vary across different units, and their attack and movement. You will need to balance these cooldowns and constraints in your building of new units, as well in the actions you command your units making their way to the enemy nexus.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nxt.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Hirschfield Software","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197822,"name":"Date Knight","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"An upcoming comedic visual novel where you're a knight dating other knights in your local area.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nxx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197823,"name":"Kingdom Maker","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Kingdom Maker is a massive multiplayer strategy game with only one rule... yours!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nz5.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Scopely","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":197824,"name":"Jinx & Minx's Tower Escape","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"It's Halloween, and the skeleton Jinx and Minx bunnies are trapped high in an abandoned tower! It's up to you to guide them through spooky corridors, haunted rooms and puzzles, collecting the keys and the candy to get the bunnies out and back together!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":197825,"name":"Fueled Up","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Fueled Up is a chaotic couch co-op spaceship recovery game for up to four players. You and your crewmates must fuel, fix and rescue damaged spaceships before the evil space octopus gets its tentacles on them!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nzg.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Fireline Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197828,"name":"AOFrost","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"AOFrost is a server based on \"Argentum Online\"\nWith more than 13 uninterrupted years in its development.\nEnter a world full of adventures and become the best!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ojp.jpg","releaseYear":2011,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197830,"name":"Peridot","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In Peridot, players will raise magical beasts called Peridots.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nyg.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Niantic Labs","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":197831,"name":"I.B.: The Future, Destined by Unsociable Me","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"\"Kazuto Sorai” is a genius hacker boy, who by the trigger of one incident develops a communication support AI, and applies for an App Development Contest. That app gained massive attention from the company which hosted the contest, and one day a lady who works at the company visited him…\n\nIt’s a SF youth story with a visual novel game style, where the untalkative main character and a little-off lady grow through various incidents. It’s a story where you can both laugh and cry! What is the mysterious project for “PEACE”…? What is the form of their ideal future…?\n\nDo not miss out on the ending of the “future” which is selected by two humans and one AI!!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co86or.jpg","releaseYear":2018,"developers":[{"id":0,"name":"Entabridge Co., Ltd.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":197832,"name":"Captain Sabertooth and the Trials by Fire","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Captain Sabertooth story follows the adventures of Tiny, in his quest to earn a place on the crew of Captain Sabertooth’s ship, the Dark Lady. Tiny desperately wants to become a pirate but finds it increasingly hard to get the pirates to take him seriously. The Captain and his pirates are hard to impress...\n\nTiny is challenged in everything from deck-scrubbing to treasure hunts, but makes a new friend in Raven, an Indian girl who stowed away on the Captain’s ship, Tiny sets out to win over the crew of the Dark Lady and earn his place on the ship.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co766c.jpg","releaseYear":2011,"developers":[{"id":0,"name":"Pan Vision","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197833,"name":"Mad Father","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Witness the tale of a most foolish family. A remake of the classic horror exploration game makes its way to Steam. This version includes revamped in-game graphics, new scenes, and a 'Blood Mode' that changes events for a second playthrough.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6l6k.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Sen","games":null},{"id":0,"name":"PLAYISM","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197835,"name":"Legends of Pindorama","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"In the west of the Holy Lands lies an ancient and unheard place, sailors and soldiers will to explore that intriguing land, with tribes and also scary and heinous animals. The earth of Vera Cruz hides secrets and wealths","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5iuv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197836,"name":"Dastardly","genres":[],"avg_score":0.0,"description":"A frenetic local multiplayer arena combat game for 1-4 players. Jump, dash, and shoot your way to victory, making use of an array of powerups like shields, cloaks, and jetpacks.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5d09.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197837,"name":"Animal Crusaders","genres":[],"avg_score":0.0,"description":"Crusade to distant lands and fight your friends in this chaotic 4 player skill based brawler or play survival alone. Defeat players and AI in order to unlock unique projectiles, weapons, magic, and cosmetics. Use spacing and custom loadouts to defeat your foes in battle.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co57vx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197838,"name":"PongBreak","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Clean up the scattered programmable matter in a fun and challenging tennis like format. Multiple control schemes allow for casual or precise gameplay.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5l0y.jpg","releaseYear":2025,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197839,"name":"Honey Homer","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Hit Homer to reach quota!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5edk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197840,"name":"One Hell of a Week","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"A 18+ Yuri romance Visual Novel taking place in a tropical paradise. Oh, and there's Satan.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5jyf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197841,"name":"Melty Blood: Type Lumina - Mario Playable Character","genres":[],"avg_score":0.0,"description":"This will add “Additional Character - Mario” to Melty Blood: Type Lumina.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197842,"name":"Melty Blood: Type Lumina - Powered Ciel Playable Character","genres":[],"avg_score":0.0,"description":"This will add “Additional Character - Powered Ciel” to Melty Blood: Type Lumina.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197843,"name":"Euro Truck Simulator 2022","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nz1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197844,"name":"American Truck Simulator 2022","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"American Truck Driving Simulator 2022 with Cargo Truck Game Get ready for new, offline, and free truck driving simulator in cargo truck game creator of gaming engine.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co80fk.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Card Guru Game Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197845,"name":"Jean's Club","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Jean start new business, managing club after the big hits of Jean's Boutique Fashion.\nServe customers as fast as you can to keep them happy. If the customers wait for too long, they get angry and eventually leave the club. Clean! Dance! Music! Challenge to the best club through upgrade and employee.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197846,"name":"Dinkigolf","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Golfing on the fairway is one thing, but how about inside a volcano, up a mountain, or across city rooftops? In Dinkigolf, the objective of reaching the hole remains, but there may be plenty of varied hazards and obstacles in between!","imageUrl":"Sin imagen","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197847,"name":"Demon Party","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Demon Party is a retro-inspired RPG style.\nAnd it's the begining story of Andromeda Galaxy epic tale.\nThere is one sacred realm that goddess created , Tautarus...\nAt the begining, Tartarus realm has none a single soul exist.\nUntil the Goddess of life and Death came to the realm and created different kinds of life-form.Years and centuries has passed. They live peacefully and happily. One day, Goddess has not answer the call so the time of chaos began..\nMysterious invader overrun without any sight. Darkness has dominate Tartarus.\nHelp Asha to find her sister together with companions and fight the horde of monster.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197848,"name":"Deadman Diaries","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Readers can choose between trying to save the character or sending him to the largest imaginable number of deaths. Using the form of a personal diary, readers are immersed in the life of John Riggs, a bank worker who has to pay off a gambling debt that will lead him to different illegal, and often lethal, situations. Readers are given different options and can choose between trying to save the character or killing him off in as many ways as possible.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197849,"name":"Lucky Luke Shoot & Hit","genres":[],"avg_score":0.0,"description":"Become the best gunslinger in the West.","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197850,"name":"Police Precinct: Online","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Police Precinct: Online is a cooperative board game of skill and strategy for board game lovers. Based on the popular board game by Common Man Games, Police Precinct challenges you to work as a team in order to clean-up crime in the city and put this murderer in jail.\n\nSo get ready because now's your turn to become a cop to not only solve a murder but maintain peace in your city. It won't be easy though, the clock is working against you and so far you don't have any evidence but you and your team are the best, that's why you've been chosen for this case. Well, time to bust some punks and eat some donuts!","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197851,"name":"Pokaboo","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Pokaboo is a simply haunting puzzle game in which you join blobs of the same color together. As the ghost, you will work in increasingly challenging layouts to combine matching colors into abstract shapes from all around the board. As you merge colors together successfully, that particular color will disappear, bringing you closer to level completion.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197852,"name":"The Unrest Age","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Introducing The Unrest Age: an Action-RPG in the large open world of Russia of the early 17th century that offers an amazing combination of dynamic battle system and nonlinear storyline, an advanced character growth system and detailed dialogues, a seamless world and a wide variety of things. The whole amazing world right in your pocket. The Unrest Age combines the best ideas from desktop platforms and brings them to the mobile format.","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197853,"name":"Castle of White Night","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You play as an adventurer and need to defeat 100 twisted souls to remove the curse in the castle.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197854,"name":"SchoolX","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197855,"name":"Next Stop Mobile","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Next Stop is a game that will send you on a trip down a railroad, which needs to be pulled up from dilapidation and defended against a bank that wants to lay hands on it to offset its debts. By making a lot of stops, you can repair and build up all damaged parts of the railroad, but you need to ensure that you have enough resources. Trade and train passage on your reviving railroad will bring you a substantial income.","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197856,"name":"Stratosphere Defense","genres":[],"avg_score":0.0,"description":"Grab one side of an iPad and play as one of three unique teams, taking on your opponent with defensive towers and 12 different creatures that you can send to assault their gates.\n\nMiss the magic of playing board games with friends? Transform your touch screen into a realtime, interactive strategy game and challenge friends of any skill level. Stratosphere is easy to learn, but has many layers of strategy to master.\nWhether you're face to face with a friend or playing over the Internet, Stratosphere is a whole new, multiplayer take on the TD genre.","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197857,"name":"Invasion of the Zombie Monsters","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Invasion of the Zombie Monsters is an arcade-platformer in wich you take control of Ned, who must try to save the world from the zombie hordes and take back his girlfriend!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nzl.jpg","releaseYear":2010,"developers":[{"id":0,"name":"RELEVO Videogames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"MSX"},{"id":0,"name":"Amstrad CPC"},{"id":0,"name":"ZX Spectrum"}]},{"id":197858,"name":"Chester's Revenge","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Take control of Chester the pig as you avenge your herd and set out to retrieve the Sacred Carrot. Armed only with his trusty hand cannon, Chester must battle his way through Rad Ralph’s lieutenants in an over-the-top style revenge romp to reclaim the Carrot and stop Rad Ralph from world domination.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nzi.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Bonus Stage Publishing","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox Series X|S"}]},{"id":197859,"name":"Abunai Koi no Sousashitsu","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"A visual novel released in 2012 for PSP.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7vdy.jpg","releaseYear":2012,"developers":[{"id":0,"name":"GignoSystem Japan, Inc.","games":null},{"id":0,"name":"QuinRose","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation Portable"}]},{"id":197860,"name":"S-In","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Easy and relaxing puzzle game to play. The player's goal is to do whatever they can to reach the green goal to pass all the levels.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nzj.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197861,"name":"Reversilly","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Reversilly is a new type of real time chaos action game! that combines the familiar game of \"Reversi\" with real-time action elements.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5meu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197862,"name":"Bunnies vs Zombies","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"\"You'll wish you had less fun!\" Tower Defense, Jokes and serious story, Choose Your Own Adventure, Do What You Want.Punch zombies in their face, set them on fire, run them over with your car... Do What's Fun.Cross Platform Multiplayer + Solo Campaign. Play How You Like.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ces.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197864,"name":"Detective Barbie 2: The Vacation Mystery","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Detective Barbie 2 is primarily an adventure game where Barbie explores the inn and surrounding areas, such as the greenhouse and the lighthouse. Further, the inn was constructed by an eccentric inventor who built all kinds of secret passages and other surprises into the location. Find and use items, leverage your high-tech gadgets, interview the people who work at the inn, and solve the mystery.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6t6p.jpg","releaseYear":1999,"developers":[{"id":0,"name":"Mattel Media","games":null},{"id":0,"name":"Gorilla Systems Corporation","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197865,"name":"Kidsongs: Musical Mystery","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197867,"name":"Lewdle","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Quiz/Trivia","games":null}],"avg_score":0.0,"description":"Try and guess the Lewdle in 6 turns.\nEvery guess must be a valid lewd word. Hit the enter button to submit.\nAfter each guess the tiles will change colors to show how close your guess was to the Lewdle.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co54z6.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":197868,"name":"Demon Turf: Neon Splash","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Demon Turf is back and better than ever! Join Beebz in this neon lit adventure where speedy platforming reigns supreme!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4nzu.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Playtonic Friends","games":null},{"id":0,"name":"Fabraz","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197871,"name":"Batman: Rise of Sin Tzu","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bc6.jpg","releaseYear":2003,"developers":[{"id":0,"name":"Ubisoft Entertainment","games":null},{"id":0,"name":"Ubisoft Montreal","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":197872,"name":"Batman: Vengeance","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7h0x.jpg","releaseYear":2001,"developers":[{"id":0,"name":"Ubisoft Entertainment","games":null},{"id":0,"name":"Ubisoft Montreal","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":197873,"name":"CSI: Crime Scene Investigation - Deadly Intent: The Hidden Cases","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6kag.jpg","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197874,"name":"Nomad Survival","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Battle against hordes of enemies, conquer Boss encounters, and explore various character and skill combinations in this time-based auto-attacking Roguelite in your quest to become stronger and defeat the most menacing of creatures that lay in wait at the end of each run.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4qgp.jpg","releaseYear":2022,"developers":[{"id":0,"name":"The Fox Knocks","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197875,"name":"Mearth","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Seeking revenge and re-establishing the kingdom, Asteria struggles to escape from the land of dark beings. She wants to defeat Dragos and reunite with her father and her former kingdom.Join this game full of high graphics.İt's a story mode single player RPG game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5kvw.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197876,"name":"Emorrior","genres":[],"avg_score":0.0,"description":"Emorrior is rogue-like dungeon crawler about the struggles in your own life. Where you must assemble your own army of positive emotions to conquer all the bad thoughts that try to ruin your day. Fight, Collect and Survive, seize that happy ending you know you deserve.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5grm.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197877,"name":"3D Puzzle: Farm House","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Collect a 3D puzzle, transferring things to the right places to create a beautiful house.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ccq.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197878,"name":"Ai-(Onic)","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Fight your friends as a small robot tank and get an outlet for your emotions by destroying your friend's buildings.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5abe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197879,"name":"Super Spy Agents 3D","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197880,"name":"Evony: The King's Return","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Ever-changing strategies to solve puzzles, freely build kingdom cities, explore relics, train exclusive troops, recruit legendary heroes to expand the territory of the empire, and become the emperor of the Seven Kingdoms! It's all in Evony: The king's Return, the hottest real-time war strategy MMO of 2022!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co68aq.jpg","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":197881,"name":"Need for Speed: Carbon - Own the City","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Dominate the streets and build your reputation in Need for Speed Carbon: Own the City for the Nintendo DS. This action-packed racing game lets you take control of the city, one neighborhood at a time, with an immersive storyline and intense street racing action.\n\nCustomize and tune a wide range of cars with an array of performance upgrades and visual modifications to suit your style. Assemble your own crew of skilled racers, each with unique abilities, to help you in your quest for supremacy. Utilize your crew members strategically during races to gain the upper hand against rivals.\n\nRace through diverse urban environments, from sprawling cityscapes to winding mountain roads, with the DS's dual-screen setup providing intuitive controls and an engaging HUD display. The touch screen interface makes car customization and crew management seamless and fun.\n\nExperience thrilling race modes including Circuit, Sprint, and Pursuit, where you must outrun aggressive police forces. Challenge your friends in wireless multiplayer races and prove who truly owns the city.\n\nWith its dynamic gameplay, captivating story, and endless customization options, Need for Speed Carbon: Own the City for the Nintendo DS offers a high-octane racing experience that you can take anywhere. Get ready to own the streets and carve out your legacy!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6c2y.jpg","releaseYear":2006,"developers":[{"id":0,"name":"Exient Entertainment","games":null},{"id":0,"name":"Electronic Arts","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197882,"name":"Justice League Heroes","genres":[],"avg_score":0.0,"description":"The Nintendo DS version of Justice League Heroes. This version shares a similar visual style and gameplay mechanics to the console version, but serves as a prequel to its story.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6gxz.jpg","releaseYear":2006,"developers":[{"id":0,"name":"WB Games","games":null},{"id":0,"name":"Sensory Sweep Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197883,"name":"Marvel: Ultimate Alliance","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Marvel: Ultimate Alliance lets players create their ultimate team from the largest superhero alliance ever as they engage in an epic quest to determine the fate of the Marvel universe. Players can control their own completely unique team by selecting from the largest roster of legendary superheroes ever assembled in one game. Through the epic campaign, the heroes will battle, team-up, and interact with over 140 characters from the Marvel universe and ultimately confront notorious villains.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8dcb.jpg","releaseYear":2006,"developers":[{"id":0,"name":"NEC Interchannel","games":null},{"id":0,"name":"Barking Lizards Technologies","games":null},{"id":0,"name":"Activision","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":197884,"name":"Stuntman","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6p7y.jpg","releaseYear":2003,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":197886,"name":"Tank Battle: East Front 1941","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Tank Battle: East Front 1941 gives a unique wargaming experience on iPhone and iPad. A game of tactical combat on the Russian Front, during the German Invasion of 1941.Fight as the Germans or the Soviets in a series of ever more complex missions. At the beginning of the year both sides have relatively obsolete equipment such as the Panzer I and T-26. As the war progresses more advanced tanks such as the excellent T-34 become available. Missions vary from straightforward wipe out the enemy missions, to capture key objectives, to protect vital supply convoys. There is a whole range of missions to reflect the tactical complexity on warfare on the Eastern Front. The game system is based on, and a major upgrade of, the successful game engine developed for ‘Tank Battle: North Africa’.","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197887,"name":"Professional Darts Championship","genres":[],"avg_score":0.0,"description":"Invite friends to challenge you via Game Center, challenge rivals on Bluetooth or tackle our tricky AI players in tournament mode. Professional Darts Championship is the most comprehensive and enjoyable darting experience on the iPhone and iPad.","imageUrl":"Sin imagen","releaseYear":2011,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197888,"name":"Moto Race","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Moto Race: Collect coins and don’t crash, complete the levels as fast as possible to achieve maximum score points.","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197889,"name":"Gloomhaven: Jaws of the Lion","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Tactical","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Jaws of the Lion DLC is the digital adaptation of the eponymous board game and expansion to Gloomhaven the critically acclaimed grim Tactictal RPG. Recruit 4 exclusive mercenaries and explore a new side of the world of Gloomhaven through an arching story filled with new enemies and bosses.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5dp7.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox One"}]},{"id":197890,"name":"Age of Empires II: Definitive Edition - Dynasties of India","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This expansion brings three new civilizations of India plus three full new campaigns to Age of Empires II: Definitive Edition for the first time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yca.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Tantalus Media","games":null},{"id":0,"name":"World's Edge","games":null},{"id":0,"name":"Xbox Game Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"}]},{"id":197891,"name":"Bitch Hell","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Alex is a girl plagued by constant nightmares of flesh, rust and grime.\nFight your way through the night as you spiral into... Bitch Hell.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8rcm.jpg","releaseYear":2024,"developers":[{"id":0,"name":"erysdren","games":null},{"id":0,"name":"evie_src","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197892,"name":"Arcade Archives: The Legend Of Valkyrie","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The Legend Of Valkyrie is an action game released by Namco in 1989. Valkyrie No Bouken features the popular Valkyrie once again, for an even higher-power adventure! When the seeds of gold are watered by the northern spring, a miracle will spring forth in the doomed land.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o0d.jpg","releaseYear":2022,"developers":[{"id":0,"name":"HAMSTER","games":null},{"id":0,"name":"Namco","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":197893,"name":"Crazy Machines 2","genres":[],"avg_score":0.0,"description":"Crazy Machines 2 for the DS is the sequel to the well-known puzzle and experiment solving game. The professor is back and leaves his lab to travel around the world this time, to build up new experiments to solve for the player. During his travels he reaches places like beautiful beaches, the Great Wall of China and the pyramids of Giza, to name a few.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co86zi.jpg","releaseYear":-1,"developers":[{"id":0,"name":"dtp entertainment AG","games":null},{"id":0,"name":"FAKT Software","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197894,"name":"Chaotic: Shadow Warriors","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o0s.jpg","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197896,"name":"Tennis Elbow","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o0v.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Neko Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197897,"name":"Best of Arcade Games DS","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o0y.jpg","releaseYear":2009,"developers":[{"id":0,"name":"DreamOn Studio","games":null},{"id":0,"name":"Big Ben Interactive","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197899,"name":"Jade Wolf","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Jade Wolf is a platformer game created and developed by Sedition Games in March 2009. In this game, the player controls the titular white wolf venturing in a world inspired and based on Chiang Mai and Thailand, where the creator lives. The gameplay is largely inspired by Sonic The Hedgehog, as well as the Zelda games to a lesser extent. The player must collect 12 Jade Ornaments, and use their power to send the Standing Apes back to the ancient city from whence they came.","imageUrl":"Sin imagen","releaseYear":2009,"developers":[{"id":0,"name":"Sedition Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":197900,"name":"Jade Wolf 2","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The wolves need your help! Find the 6 magical amulets, to restore communication between the cloud palace and Earth.","imageUrl":"Sin imagen","releaseYear":2010,"developers":[{"id":0,"name":"Sedition Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":197903,"name":"Xordle","genres":[{"id":0,"name":"Quiz/Trivia","games":null}],"avg_score":0.0,"description":"A daily word guessing game where players must uncover two secret words on one shared board. The secret words share no common letters. Has both a daily and an unlimited variant.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7j76.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Keldor","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":197904,"name":"Aerinde","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Ærinde is a first person point and click adventure game, created by Cloak and Dagger Games for AdventureJam 2016.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o1o.jpg","releaseYear":2016,"developers":[{"id":0,"name":"Cloak and Dagger Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197906,"name":"Borneo: A Jungle Nightmare","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Borneo: A Jungle Nightmare is an interactive horror graphic adventure, with the direction and script of Ruggero Deodato. Take control of different characters in a desperate expedition to the virgin jungles of Borneo.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o1n.jpg","releaseYear":2025,"developers":[{"id":0,"name":"Fantastico Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197907,"name":"I Love Food","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Play as a hungry seagull and uncover tantalizing culinary creations across dozens of puzzle stages, each with unique layouts and some light platforming for our fearless fowl to navigate! Grab your ball and throw it at the stacks above you.\n\nIf you match 3 or more, the connected orbs will come tumbling down to reveal a part of the image beneath. Be careful, though! The ceiling slowly creeps downward, threatening to crush you under the remaining orbs if you’re not fast enough.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oi2.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Naughty Seagull","games":null},{"id":0,"name":"EastAsiaSoft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":197908,"name":"SpaceSlog","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Slog through space in SpaceSlog. A difficult sci-fi spaceship sim with an emphasis on ship building, crew interaction and story development. Inspired by titles such as Rimworld, Starship Theory and X-COM inc Firefly, Battlestar Galactica and Stargate Universe.\n\nYour capital ship has been attacked by an unknown enemy. Several survivors have managed to escape in a small ship, now alone, hungry and lost in space, you must guide them to safety.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8pwi.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Produno Games Studios","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"}]},{"id":197910,"name":"I H8 Ur Face","genres":[],"avg_score":0.0,"description":"Want to slap the sh*t out of someone but don't want to do time for it? Load an image of the poor bastard on to the dummy and release your rage!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5h79.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197911,"name":"The Oracle Land","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"\"The Oracle Land\" is a 3D fantasy MMOARPG, set in the magnificent story, enjoy a journey of mission in the western fantasy world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5n9l.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197912,"name":"Planet Omnia","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Welcome to Planet Omnia! A multiplayer sandbox game with a focus on exploration, secrets and having fun with your friends!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5kif.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197913,"name":"Arena Brutal","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Shoot lead & blow heads in Arena Brutal, an action shooter that'll put your weapons proficiency to the test! You'll need to manage the uniquely simulated recoil of each gun, keep on top of ammo & avoid getting your face blown off while speeding to the exit for the highest score & the next challenge","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5831.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197914,"name":"The Vaults","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"The Vaults is a turn-based RPG card game where you will engage with creatures and beings of other worlds, Explore powerful scrolls and weapons, find treasures, learn abilities, and upgrade your keepers to save the mysterious world of Alexandria!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5nec.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197915,"name":"Matchmension: House of Mist","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Matchmension: House of Mist congratulates you as the chosen winner of the royal lottery! Your prize: Mist Mansion! But the mansion has been left in terrible shape and the estate is in dire need of repairs. Direct your own robot butler and harness the power of mysterious stars to fuel your creative endeavor. Renovate and restore Mist Mansion to its former glory in Matchmension: House of Mist!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o20.jpg","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197916,"name":"NeonLore","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Discover the future...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o22.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 5"}]},{"id":197917,"name":"Magi: Mind Game","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Magi: Mind Game takes the essential elements of a fighting game and turns it into an easy to learn difficult to master turn based strategy game. Focus on manipulating and predicting to outsmart your opponent. No need to memorize combos and difficult controls.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5igt.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197918,"name":"Nonogram Minimal","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Enjoy 200 hand-crafted puzzles, share and play user-made levels!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7ybc.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":197919,"name":"Turn Tack","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A world on the verge of doom, and the girl who holds the key. An exotic puzzle-platformer adventure game based on Aztec myth in South America.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o27.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":197920,"name":"Reversi 32","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Play Reversi (32 piece style) on the Wii U GamePad against a friend or Bigley.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5aqw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197921,"name":"Japanese Nekosama Escape: The Old Inn","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A hot spring inn on a land of mythtery my frinds recommended. Back from bath, I found my room completely different!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o26.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197922,"name":"Seashells","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A short first-person horror exploration game that takes around 20-30 minutes to finish.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yjk.jpg","releaseYear":2020,"developers":[{"id":0,"name":"LEAKYFINGERS","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197923,"name":"ARCA Sim Racing X","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"ARCA Sim Racing X (ASRX) is sim racing game that was created after updates to the XPatch were abandoned. ARCA Sim Racing X (ASRX) combines the original ARCA08 stock car with the TSF Trucks and other mods from Community members and make a stand alone game to accessible and include multiple class to race in Oval track.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5fr6.jpg","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197925,"name":"Dogs of Wallstreet","genres":[],"avg_score":0.0,"description":"Dogs of Wall Street is fast-paced party game where you play a group of dogs playing the market to be top dog!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o7x.jpg","releaseYear":2020,"developers":[{"id":0,"name":"TeamSmoothBear","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197926,"name":"Star Wars: The Force Unleashed","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In Star Wars: The Force Unleashed players take the role of Darth Vader's secret Apprentice, hunting down hidden Jedi across the galaxy. The game closely follows the story of the console versions, but with various differences, such as different characters changes in vehicles and Wookiees becoming enemies instead of allies.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5w5r.jpg","releaseYear":2008,"developers":[{"id":0,"name":"n-Space","games":null},{"id":0,"name":"LucasArts","games":null},{"id":0,"name":"ak tronic","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197927,"name":"Pokémon Sigma Platinum","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null}],"avg_score":0.0,"description":"Pokémon Sigma Platinum is a ROM Hack/Mod of Pokemon Brilliant Diamond & Shining Pearl to recreate the events and gameplay of a Game Freak-styled Platinum remake, as opposed to ILCA's remakes.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6iw0.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Lewtwo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":197928,"name":"Crash of the Titans","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"The Nintendo DS version of Crash of the Titans is a platform game with beat 'em up elements, it differs from the console version in its plot and extensive use of the touchscreen and microphone.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8dwi.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Amaze Entertainment","games":null},{"id":0,"name":"Sierra Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197929,"name":"Crash of the Titans","genres":[],"avg_score":0.0,"description":"The Game Boy Advance version of Crash of the Titans features linear 2D gameplay where the focus is to break crates while jacking Titans, it also has its own story merging the DS and console versions.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5xv2.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Amaze Entertainment","games":null},{"id":0,"name":"Sierra Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":197930,"name":"Fantastic Four: Rise of the Silver Surfer","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4x77.jpg","releaseYear":2007,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197931,"name":"Full Auto 2: Battlelines","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6px0.jpg","releaseYear":2007,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation Portable"}]},{"id":197932,"name":"Suddenly Meow 2","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"In the second part of the fantastical Match3 game, Tim the cat is hungry for more adventure! Lord Devious broke free from the seal of the fairies and now his ominous shadow is threatening the peace of the forest. Help Tim use his meowtastic skills to save the fairies!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5okr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197933,"name":"Idle Business Tycoon: Build Simulator","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Expand and grow! The possibilities are plenty in Idle Business Tycoon - Build Simulator Build. Earn money to unlock new establishments and expand your business all over town. The more you build, the more money you make!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5h66.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197934,"name":"Loony","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Loony is a multiplayer strategy, role-playing and thriller where one player takes on the role of the killer and kills those who try to escape from the map, and other players try to escape the map by finding the killer or completing missions.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4pa6.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197935,"name":"Edge Run","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"You have to go through an amazing test, the outcome of which will decide your whole future life. However, not everything is as simple as it seems.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5gmm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197936,"name":"ARCA Sim Racing 08'","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"ARCA Sim Racing is a stock-car racing simulator that focus on 2008 ARCA RE/MAX season that happen on OVAL and road courses.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o81.jpg","releaseYear":2007,"developers":[{"id":0,"name":"The Sim Factory","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197937,"name":"Snatcher","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Snatcher is a cyberpunk-themed graphic adventure game directed and written by Hideo Kojima and produced by Konami. The setting and story of Snatcher is heavily influenced by cyberpunk and science-fiction media, taking place in a large futuristic dystopian city. The story revolves around an investigator named Gillian Seed assigned to investigate a breed of bioroids known as \"snatchers\", who are killing humans and taking their place in society. The game is set in a primarily first person perspective and uses a menu-based interface that allows the protagonist to interact with his environment. The player can choose to \"Look\", \"Investigate\", \"Talk\", \"Ask\" and \"Move\" (in addition to other options) to acquire key items or receive vital information from other characters. The player can analyze items in Gillian's belongings or show it to other characters. During key points of the game's story, the player must pass shooting sequences to defend Gillian from assailants. These shooting segments use a 3x3 grid which the player can target to fire at enemies. A shooting trainer, called \"Junker's Eyes\", is accessible at Junker HQ that allows the player to measure their accuracy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o2q.jpg","releaseYear":1988,"developers":[{"id":0,"name":"Konami","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"MSX2"},{"id":0,"name":"PC-8800 Series"}]},{"id":197939,"name":"Lode Runner","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"A remake of the 1984 classic arcade puzzle game with the same name.\nYou're a highly trained Galactic Commando, deep in enemy territory.\nYour mission: to recover a fortune in gold, stolen from the Bungeling people by their power-hungry leaders.\nYou'll be running, jumping, and climbing heroically, solving perplexing puzzles.\nWith your laser pistol, you'll drill passageways through stone floors and barriers.\nTo get through this mission alive, you'll need more than fleet feet and good looks.\nYou'll need your quick wits and brains. And more than just a little luck.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4yw5.jpg","releaseYear":2006,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197940,"name":"Are You Smarter Than a 5th Grader? Game Time","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co75yn.jpg","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197941,"name":"James Pond: Codename Robocod","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"In his second adventure, James Pond must retrieve the toys Dr. Maybe has stolen. Pond has been armed with an Inspector Gadget-style stretch device, which he can use to view higher areas or claw onto ceilings so as to slide across them.\n\nThe gameplay takes place across worlds themed around particular types of toys, such as sporting goods, candy, and aircraft. The levels scroll sideways, although a small amount of vertical movement is included. On each level Pond must collect 2 penguins and reach the exit, although there are usually multiple exits and lots of secret areas to explore. After completing each pair of two worlds (each of which has three sub-levels), a boss must be faced.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ze1.jpg","releaseYear":2005,"developers":[{"id":0,"name":"Vectordean","games":null},{"id":0,"name":"Play It","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197942,"name":"Dodge Racing: Charger vs Challenger","genres":[],"avg_score":0.0,"description":"Rev your engines and hit the highways and byways of the USA in the ultimate racing tournament. Dodge Racing: Charger vs. Challenger pits two of the mostic American vehicles in a Battle Royale to determine which one is the greatest muscle car of all time. Burn rubber and peel out in your Dodge Charger or Dodge Challenger, pushing these bad boys to the limits to win Championship Points for your team","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co75z8.jpg","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197943,"name":"Monster Galaxy","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"Monster Galaxy was a social role-playing video game developed by Gaia Online. It was released around November 2010 as a Flash-based Facebook social game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o2y.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Gaia Interactive","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":197944,"name":"Big Catch Bass Fishing","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o2z.jpg","releaseYear":2007,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":197945,"name":"Isle of Arrows","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Build an impenetrable fortress, tile by tile. Place buildings, build roads, and expand your isle to defend against waves of invaders in this roguelike fusion of tower defense and board game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o32.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Gridpop","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":197946,"name":"The Mysterious Case of Dr. Jekyll & Mr. Hyde","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o33.jpg","releaseYear":2011,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"},{"id":0,"name":"Nintendo DSi"}]},{"id":197947,"name":"Ore no Imouto Maker EX: Imouto to Koi Shiyo? Portable","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Ore no Imouto Maker EX: Imouto to Koi Shiyo? Portable is a short visual novel that comes bundled with Ore no Imouto ga Konnani Kawaii Wake ga Nai Portable.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o3d.jpg","releaseYear":2011,"developers":[{"id":0,"name":"Banpresto","games":null},{"id":0,"name":"Namco Bandai Games","games":null},{"id":0,"name":"guyzware","games":null},{"id":0,"name":"Banpresto","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation Portable"}]},{"id":197948,"name":"Bacteriophage","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Bacteriophage Roguelike Platformer takes place inside the body of someone with many bacterial infections. You play as a cyborg named Terri (“like bacteria”), with a gun that shoots bacteriophage DNA-infused bullets. Your job is to make your way through this human body and destroy any and all bacteria and infections that stand in your way.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o7t.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197949,"name":"GrimGrimoire OnceMore","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"GrimGrimoire OnceMore is a real-time strategy video game developed by Vanillaware and published by Nippon Ichi Software.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o88.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Vanillaware","games":null},{"id":0,"name":"Nippon Ichi Software","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":197951,"name":"Trails of Illusion","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This is a JRPG free-to-play fan game with reference to the Falcom Trails series, and the battle mode is turn-based combat.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o3t.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197952,"name":"Smoking Snakes","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"In Smoking Snakes you are part of the Brazilian Expeditionary Force (B.E.F) fighting Axis in Italian territory during World War II.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co589t.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Weendie Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197955,"name":"Legend","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"The player controls a young commander which uses a green armour and helmet and must defending the kingdom lands from invading enemies, following the orders and instructions given by the old king, for it you'll have to use money to making defect the enemy and recruit under your commands to form a legion of soldiers and make uses of different arms collected on the way, like bombs and arrows to defeat other enemies while you jump and dodges his attacks, always avoiding contact with any enemy for not to die and continue his legendary journey.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o4a.jpg","releaseYear":1986,"developers":[{"id":0,"name":"Sega","games":null},{"id":0,"name":"Kyugo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":197956,"name":"Snezhnaja Koroleva","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"USSR maze game based on the 1967 Soviet film based on the 1844 fairy tale by Hans Christian Andersen.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o4b.jpg","releaseYear":1988,"developers":[{"id":0,"name":"Terminal","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":197957,"name":"M.V.P.","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Comical baseball game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o4c.jpg","releaseYear":1990,"developers":[{"id":0,"name":"Sega Enterprises, Ltd.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":197958,"name":"Mouja","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A cross between \"Money Puzzle Exchanger\" and \"Puyo Puyo\".","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o4d.jpg","releaseYear":1996,"developers":[{"id":0,"name":"Etona","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":197960,"name":"Time is Solid Here","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A long, yellow hallway. A floating head who talks of monster trucks and places in-between. A painting, three a plenty, each with someone in need of moving on.\n\nSuch is the horror puzzle game, Time is Solid Here, recently selected for the Goethe-Institut's Stillstand/Standstill Project Exhibition.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o4e.jpg","releaseYear":2021,"developers":[{"id":0,"name":"AlgebraFalcon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Web browser"}]},{"id":197961,"name":"Bomberman Max: Ain Version","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A limited edition of Bomberman Max: Blue Champion distributed only in Japan. It has all the unlockables without the need of having the other version.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d7g.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Color"}]},{"id":197962,"name":"Jaded","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Platform and fight your way through mountains and forests to accomplish your purpose as a Jade being. Slow down time using your 360-degree directional dash, and lock on to targets to strike! Fight soldiers and creatures on your quest in this gem of a game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5fw1.jpg","releaseYear":2025,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":197963,"name":"Still Heroes","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A digital comic about the story of Emeline. She tries to live her dream of being a superheroine after her friends decided to change their career paths. A gentle and moving story, drawn by hand.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ob3.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"}]},{"id":197964,"name":"Axolotl is Dry","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Axolotl is Dry is a precision platforming game where you play as a little axolotl taken from his home. You'll need to jump, dash and slide your way through the harsh desert before you sweat yourself dry. Help the axolotl get to his home!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co596k.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Manodeix","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197965,"name":"Dungeon Adventurer","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"In this dungeon, you have to play a brave man, defeat monsters with barrage shooting to obtain more powerful weapons, and go to the depths of the dungeon.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5hn7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197966,"name":"Gold Wiper","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Gold Wiper is an arcade game like Qix and Gals Panic. If you delete the screen and restore the hidden picture, you will be rewarded incomparably with Qix and Gals Panic.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5drh.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197967,"name":"N-Age","genres":[],"avg_score":0.0,"description":"Live as one of the young cyberspace character inside the world of N-Age and discover the secrets and story behind it. Build communities, fight other schools and prove your mettle. Fight the crippling darkness and evil that wants to throw the civilization into disarray once more.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5ins.jpg","releaseYear":2001,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197968,"name":"Cozy Grove: New Neighbears","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Word of your legendary scouting deeds has spread throughout the spirit world... and that means more ghosts want your help. The \"New Neighbears DLC\" adds four new ghost bears, each featuring lengthy personal stories and no long waits between their requests.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5se7.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Spry Fox","games":null},{"id":0,"name":"The Quantum Astrophysicists Guild","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":197969,"name":"4D Chess","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"VR Chess that isn't flat. Move up and down, between levels, and attack from all directions. All the pieces you know with extra moves that add interesting complexity. Several different volumes to choose from ranging from 4x4x4 to 8x8x8. 4d checkers, 3d chess and checkers are included.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5cvk.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197970,"name":"Monica the Story of Far Worlds","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Stylized 3D platformer with puzzles and traps. The game tells about the adventures of a little girl who got into an unknown world. Help Monica unravel the mysteries of these ancient lands. Solve puzzles, explore the worlds, defeat enemies, and find your way home!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5li7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197971,"name":"CellSar","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A sandbox game about collecting cells, building machines and organs out of cells and keeping them alive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5clm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":197972,"name":"Yumsters!","genres":[],"avg_score":0.0,"description":"These adorable hole-dwelling creatures will please everyone. They are mad about fruit and even participate in a world fruit-eating cup. You'll need to gather a team of super-yumsters from different countries to win this competition.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5shz.jpg","releaseYear":2007,"developers":[{"id":0,"name":"KranX Productions","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":197973,"name":"Bomberman Land","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Bomberman Land is a theme park filled with people and different attractions. As in top-down RPG games, the player controls a character who can interact with the NPCs and objects on the map. Various spots give access to the attractions, in the form of mini-games. In some games, the player must pick-up sheep and lock them out of the field, complete jigsaw puzzles, look at equations and answer if they are true or false, etc. Completing various tasks will reward the player with numbered coupons that give access to new areas of the theme park.\n\nIn addition to the solo play, some games can be played in up to four players battles, or in a tandem cooperative mode.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co87mg.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null},{"id":0,"name":"Rising Star Games","games":null},{"id":0,"name":"Racjin","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation Portable"}]},{"id":197974,"name":"Dunkle Schatten","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o4v.jpg","releaseYear":2001,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197975,"name":"Bomberman Blast","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The international version of Bomberman Blast differs from the original Japanese version due to the lack of the Story Mode.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u67.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Wii"}]},{"id":197976,"name":"Bomberman Online Japan","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"An online Bomberman released only in Japan for PC.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d7p.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":197977,"name":"Simulator XL Bundle","genres":[],"avg_score":0.0,"description":"Big Simulator bundle with 5 games in 1!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o4w.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"}]},{"id":197978,"name":"Unsolved Riddles","genres":[],"avg_score":0.0,"description":"This bundle includes:\n\n- 9 Clues: The Secret of Serpent Creek\n\n- Ghost Files: Memory of a Crime\n\n- Noir Chronicles: City of Crime","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o4x.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series X|S"}]},{"id":197979,"name":"Docking Sequence","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A 2D Pixel Art game by Quantum Sheep, inspired by the docking sequence from the classic ‘Elite’ as well as Kubrick’s seminal work, 2001: A Space Odyssey. Pilot your ship across 10 systems to dock in 100 stations and make your way home!","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197980,"name":"Cyber Hacker","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Cyber Hacker is a high strategy game involving such features as social engineering, computer viruses, and industrial espionage. Work against a ticking clock in a highly realistic digital world.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197981,"name":"Mystic Maze","genres":[],"avg_score":0.0,"description":"Enjoy an immersive traditional outdoor maze. Wander around a traditional outdoor maze in the full 3D! Enjoy the tweeting of the birds as you try and find the secret object hidden somewhere in the maze.\nSimple touch controls in the corners of the screen allow you to navigate the maze.\nEnjoy yourself as you loose your bearings inside the Mystic Maze!","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197982,"name":"The Tower of Egbert","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The Tower of Egbert is a physics-based tower building game with a magic twist. You are able to build freely until the tower is tall enough to reach the target line of the current level. Hitting a start button activates gravity for a few seconds and your construction either stands or falls. If any single block of the tower is still above the target line after the physics simulation stopped, the whole building is magically “frozen” by Egbert, so that the already completed sections of the tower will never again be subject to gravity. In the next level you will have to build on this newly created, always different, often crooked, foundation – a task that can turn out to be quite challenging.","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197983,"name":"Tireur de Couleur","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Your perception will be sharpened in this special endless space shooter. In infinite levels you hunt various opponents and you don't just have to be a good shooter, you also have to quickly choose the right weapon beforehand. The aim is to survive as long as possible and achieve a high score by killing many enemies. This game requires all your concentration and skill, because you have to position your device correctly at the right moment in order to refuel your ship. You fly through beautiful abstract worlds and experience impressive color explosions.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197984,"name":"Castle Raid","genres":[],"avg_score":0.0,"description":"Castle Raid is an action packed fantasy strategy game set in medieval times. Challenge your friends and enemies in intense and exciting 5-8 minutes battles or conquer the kingdom by taking all thrones. You have to be smart and strike hard to crush your opponent's castle, but don't forget to defend your own!","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197985,"name":"Frantic Fall","genres":[],"avg_score":0.0,"description":"Frantic Fall! is a physics-based puzzler that is a unique blend of careful planning and hilarious fails. Your objective is simple: Rotate the world to land the orb in the cup.","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197986,"name":"Arrow Spam","genres":[],"avg_score":0.0,"description":"One button real-time arrow spamming fun!","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197987,"name":"Imagine: Fashion Designer","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"See all your designs in 3D and keep them in your own virtual walk-in closet. Free yourself from predefined patterns and create original pieces that YOU design.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co75zx.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Ubisoft Entertainment","games":null},{"id":0,"name":"Ubisoft Sofia","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 3DS"},{"id":0,"name":"Nintendo DS"}]},{"id":197988,"name":"Bomberman: Panic Bomber","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The Neo Geo port of Panic Bomber. It is a \"falling blocks\" puzzle game based on the Bomberman franchise. The goal of the game is essentially to cause your opponent to lose by causing their gameplay field to fill to the top with objects. You do this by causing chains of bombs to explode, sending useless rubble over to your opponent's field, which they must then remove themselves. Bombs are earned by causing chains of three identical blocks to disappear. Bombs can only be blown up with an explosion from a lit bomb, which falls from the top of the screen every so often. If the player causes enough damage, they can eventually earn a giant bomb, which will remove a large amount of debris from the playing field, and cause their opponent a good deal of trouble.\n\nThe game's regular story mode revolves around Bomberman's hunt for the Golden Bomber statue. During his trek, he fights against several different odd characters, like Drifty the balloon, or Cecil the tiger. However, all that can really be earned from playing through this mode is a harder difficulty level, earned by finishing the entire story at the \"hard\" difficulty level.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oax.jpg","releaseYear":1995,"developers":[{"id":0,"name":"Raizing","games":null},{"id":0,"name":"Eighting","games":null},{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Neo Geo MVS"},{"id":0,"name":"Neo Geo AES"}]},{"id":197989,"name":"Cargo Rush","genres":[],"avg_score":0.0,"description":"Train enthusiasts, fans of train games, and anyone who likes challenging puzzles, give CargoRush a try! A unique game where you decide whether you can become the CargoRush Master.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197990,"name":"Guildmasters","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197991,"name":"Tiny Rogue","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Tiny Rogue is a turn based rogue-like by the creators of Devious Dungeons, Random Heroes and League of Evil!\nIn Tiny Rogue you will descend as deep into the randomized dungeons as you can. Strategize your turns moving through the dungeons collecting treasure, using potions and spells, slaying foes, earning experiences and levelling up your hero. Can you compete on the high-score leaderboard?","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197992,"name":"Doodle God Griddlers","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Doodle God Griddlers is an exciting intellectual game for those who love logic puzzles and want to feel like a god. Discover six divine elements and protect them from destruction by creating new elements to build an entire civilization!This game is also known as Japanese scanwords, Japanese crosswords, nonograms, Japanese puzzles, hanjie, and picross. But whatever we call it, you’re sure to enjoy playing it!Six divine elements will unlock120 griddlers of varying difficulty along with fantastic graphics and pleasant music – everything a refined connoisseur of nonograms could wish for!","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197993,"name":"Black Block Blast","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Simple puzzle game with a new game mechanism to relax while having fun!","imageUrl":"Sin imagen","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197994,"name":"Partia 2","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Partia 2 is a SRPG (Strategy Role-playing) video game inspired by Fire Emblem and Tear Ring Saga series. In a high fantasy setting, the game will take players through an adventure where magic and sword collide and friendship and betrayal intertwine.\nPartia 2 : The Pretenders War is a sequel to Partia: The Broken Lineage. The game packs 22 stages that could present challenges to any SRPG fan.","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197995,"name":"Grooh","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Grooh is a cute (and lazy?) monster that loves pineapples. Today, Grooh decides to explore the abandoned \"Feilong Castle\". There's a huge dragon printed on the entrance door!! But most importantly, rumors say that there's a secret treasure hidden there, and *who knows*, maybe it's full of pineapples?\nThat's why you, oh mighty player, should help Grooh to find the treasure!","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197996,"name":"Techno Trancer","genres":[],"avg_score":0.0,"description":"Listen in amazement as music syncs with dazzling action in this pulse-pumping, high-speed shooting game! In addition to the current 2 modes, a hidden AWAKEN MODE has been added! Use your awakened might to evade over 10 times the normal onslaught of enemy fire! 2 exciting new music tracks have also been added!","imageUrl":"Sin imagen","releaseYear":2010,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197997,"name":"Final Freeway 2R","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Speed through several exciting stages. Pick a character and choose your path as you drive! The impressive sense of speed, catchy tunes and a super-retro look, will kick you back to the 80s! Beat the clock to the next checkpoint and don't let the pesky challenger beat you!","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197998,"name":"Sled Mayhem","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Action packed racer with awesome animation, tricks, wicked terrains, incredible snow effects, intense speed, full featured game editor, sharing, original music and tons more. Compete worldwide, perform stunts, wheelies, flips, spins, huge jumps, and survive incredible crashes. Toss the rider around with your finger and watch him tumble, roll, and slide after you wipe out! Hop into the editor and create complete new mountains with various themes to play around with. Draw terrain and caves with your finger, decorate with props then go nuts with your snowmobile!","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":197999,"name":"NebulArena","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Ever since the Mechorgs entered our galaxy, interstellar conflicts have been resolved in the NebulArena. Billions of lives and uncounted resources have been saved by this alternative to wasteful warfare.\nYou can now resolve your own interstellar conflict in the Mechorg's arenas.\nBattles take place in one of the 30+ arena layouts prepared by the Mechorgs or in your own custom arenas. Three battle modes are available depending on how advanced your civilisation is: Assimilation, Elimination and Strata:Gem. Each battle mode presents a different set of rules, drone units and strategies.\nYou can battle any of six alien species or bring your own opponent. NebulArena battles can be fought using a single shared device or between devices on the local network. Battles can be televised on your AppleTV so all can see your NebulArena prowess (or demise).\nThe Mechorg Arena Master, has prepared more than 50 challenges to test the skills of newcomers and veterans alike. Completing these challenges as well as other specific accomplishments will earn you achievement points so you can compare your proficiency with friends.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198000,"name":"Space Pixel Swarm","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Space Pixel Swarm is a free and simple strategy game where you are massively outnumbered. The enemy will expand quickly which leaves you with the option to either do the same or to fortify key worlds. With each world the enemy conquers or destroys, your own forces and economy will become stronger. Will you intentionally sacrifice your own planets to give your fleets an edge?","imageUrl":"Sin imagen","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198001,"name":"Tiny Runner","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"An endless running game. Tap the screen to jump and avoid all obstacles on the way. How far can you run?! Let's start an adventurous and exciting journey!","imageUrl":"Sin imagen","releaseYear":2014,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198002,"name":"VoxelCity","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"This is the premium city building game you have been waiting for!\nVoxelCity is a strategy focused city builder with a board game feel. Balance your finances, keep your people happy, and provide them with the things they need. No fiddly micromanaging to worry about.\nDo you love old school city builders? Then you probably hate the current crop of city building games available today. But this one is different. Build your city without ever waiting on timers or paying for any ephemeral IAPs.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198003,"name":"Paladog!","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Introducing Paladog, the apex of all defense games!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co78zx.jpg","releaseYear":2011,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":198004,"name":"Air Dip","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Air Dip is the coolest flight simulator game with amazing 3D graphics in a surreal world of adventure. Take the high wing aircraft through this breathtaking maze of different color and sizes, all floating in the air. Your goal would be to save the aircraft from crashing on to the obstacles. Gain energy by collecting the Energy Balls and last longer in the game till you complete the mission. The smooth control over the aircraft is what you will love about Air Dip.\nThe game gets more exciting as you level up by completing mission for each level. You will be presented with a new game environment and will need to take off again to start on the new mission. Each and every theme is designed with high quality graphics and alluring color. You will greatly enjoy the surrounded view while flying the aircraft in this amazing world of Air Dip.","imageUrl":"Sin imagen","releaseYear":2016,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198005,"name":"Universe Pandemic 2","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Can you conquer the universe with an alien made pathogen?\nCreate a pathogen and take over the Universe (including Earth) using your smarts as the commander of the Gaarg fleet.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198006,"name":"Dungeon Defense: The Gate","genres":[],"avg_score":0.0,"description":"Defeat all invaders to defend your dungeon!\nCollect more weapons and monsters to make them stronger.\nEnjoy various contents such as \"dungeon building, collect various weapons, achievements\".","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198007,"name":"Helicopter Black Shark Gunship","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Ultra realistic flight simulator of the Ka-50 attack helicopter. Black Shark offers an extreme level of realism in regards to flight dynamics, sound effects, and weapon systems.\nYou can roam the skies above various locations in Free Flight mode or enjoy the destruction power of the K-50 weapons in combat missions.\nBlack Shark brings a more realistic simulation experience than any other flight game for mobile devices.","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198008,"name":"Versus: Unfriendly Frenzy","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Three eccentric factions battle endlessly for dominance of their strange land. But who is this mysterious new foe? To emerge victorious, your strategy cannot be half-baked...\nVersus: Unfriendly Frenzy is a fast-paced take on real-time strategy, with outlandish units to command, wacky maps to explore and exciting challenges to overcome!","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198009,"name":"Into the Dark: Narakan","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You awaken, lost inside an ominous forest, abound with fearsome creatures intent on cracking your knight's plate armor open and feasting on your bloodied flesh. You brave the threatening black wood, searching for the radiantly-glowing child calling your name; wondering, too, how she knows your name. You didn't know it; not before she called it.\nFind the Child. Defy the Foe. Escape the Forest. Conquer Fear.","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198010,"name":"Stickman Tennis","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Stickman Tennis is a fast paced realistic tennis game on spectacular courts and an astonishing atmosphere, simple controls and tons of replay value. Play top spins, slices, lobs and smashes, play cross, longline or inside-out and choose between automatic and manual running. The revolutionary time machine will let you replay a point you lost, to give you a second chance. Play a quick game or complete tour season of Tennis against 100 different opponents. Collect trophies and improve your world rank in a complete season with 64 tournaments.","imageUrl":"Sin imagen","releaseYear":2013,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198011,"name":"Pixel Game Maker Series Dandan Z","genres":[{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The sixth installment in the fictional \"Game Buddy\" portable game console series! Play against a total of 10 characters!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o51.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"}]},{"id":198012,"name":"Get Packed: Couch Chaos","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Get Packed: Couch Chaos is the expanded edition of the couch co-op removals game that’s full of calamity and physics-based carnage for 1-4 players, and it’s now on Nintendo Switch!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o52.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198013,"name":"Castleparts","genres":[],"avg_score":0.0,"description":"Classic castle building and cannon shooting strategy is back, but better. Strategically place your walls and shoot the weak points of your opponent. Cast spells to defend yourself or crush your enemies. Convert crystals to gold to supercharge your energy and win!","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198014,"name":"Last Colossus","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Last Colossus is an ACT/RPG game. You play as a commander who gains control of a giant robot after crash landing on a war-torn planet.","imageUrl":"Sin imagen","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198015,"name":"Crazy Pong","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A simple game which provides a slight twist to the classic arcade game pong and provides a more family fun option to a previously boring game.\nIt shows the scores on each end of the screen and there's even an option to play multiplayer with a friend!\nAnd the options to play against the computer with the easy, medium, hard, and impossible difficulties.","imageUrl":"Sin imagen","releaseYear":2018,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198016,"name":"Abu's Adventures","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Thinking hard about getting more and more delicious nuts, Squirrel Abu finally decides to take a miraculous adventure that is full of danger.\nThus various traps and obstacles have been planted. Abu will encounter all kinds of little monsters. It is fortunate that Abu, who has zero attacking ability, is helped by brother Box (being forced) along his way, smashing away the little monsters.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co95j5.jpg","releaseYear":2012,"developers":[{"id":0,"name":"YFC Game Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198017,"name":"Look over the Edge","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"It's an original, innovative, polished 3D puzzle game with a lots of hand-crafting levels. Your main target is to find a way home. It sounds simply but in fact you'll discover it's really hard because you have to play and solve level puzzles in a full 3D world with many elements which ones of them help you get home and other not.","imageUrl":"Sin imagen","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198018,"name":"Warpspeed Infinity","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Get ready for a hair-raising experience even for the most experienced gamers!\nWarpspeed Infinity is a shockingly difficult minimalist flying game. Controls are as simple as it gets: Just tilt the device to fly through a psychedelic tunnel full of weird stuff.","imageUrl":"Sin imagen","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198019,"name":"Fishbowl Racer","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Control a fishbowl on top of a jolting cart, and a starving goldfish trying to snatch fish food from the shelves, both at the same time! Challenge your friends and prove once and for all, who has the better simultaneous capacity: Men or Women?","imageUrl":"Sin imagen","releaseYear":2012,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198020,"name":"Confined with Goddesses","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Confined with Goddesses is a light-hearted story based on hentai culture, in its \"funny\" aspect.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co57sx.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Eroniverse","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":198021,"name":"Cook Serve Forever","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Cook your way through the bustling solarpunk city of Helianthus as Nori Kaga, a food cart chef aspiring to make it big like her role model, the Culinary Queen herself, Chef Rhubarb.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u5p.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Vertigo Gaming Inc.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198022,"name":"JellyCar Worlds","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"JellyCar Worlds is a return to the classic softbody platforming series JellyCar, set to release 11 years after the last game in the series; JellyCar 3.\nJellyCar Worlds is similar to the classic trilogy, with a variety of platforming challenges you must overcome as a car made from \"jelly.\" Worlds introduces its titular feature, worlds, with an overworld level for each world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69pi.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Walaber Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"iOS"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":198023,"name":"Hot Wet","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A short linear text-based game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o57.jpg","releaseYear":2022,"developers":[{"id":0,"name":"communistsister","games":null},{"id":0,"name":"DOMINO CLUB","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198024,"name":"Ten Tales from the Record of the Adamant Gambit","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This anthology of ten short slice-of-life games explores life aboard a generation starship, originally made over ten days in December 2021 for the Variety Megajam.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o58.jpg","releaseYear":2022,"developers":[{"id":0,"name":"ModernModron","games":null},{"id":0,"name":"Sean S. LeBlanc","games":null},{"id":0,"name":"dumplingsquid","games":null},{"id":0,"name":"Carrie Z","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Linux"},{"id":0,"name":"Mac"}]},{"id":198025,"name":"Pokémon Blaze Black 2 Redux","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Pokémon Blaze Black 2 Redux is a rom hack of Pokémon Black 2 and a remake of another rom hack by the name of Pokémon Blaze Black 2.\n\nNotable features include:\n\n- The ability to catch all 649 Pokémon in a single playthrough.\n\n- A revamped trainer roster and two optional difficulty modes. Challenge Mode will push vertain players to their limits, whilst Easy Mode provides a relaxed experience. Normal Mode is roughly as tough as Renegade Platinum.\n\n- The addition of the Fairy Type, as well as changes to the Steel type introduced In Gen VI.\n\n- Documentation of all Pokémon changes, Item locations, important NPCs etc - as is standard in Drayano Hacks.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o5a.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Drayano60","games":null},{"id":0,"name":"AphexCubed","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo DS"}]},{"id":198027,"name":"Kirigirisou","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The main character is a completely normal student with nothing unusual about them. They get lost one night while returning home, left driving in a dense forest. Vision still obscured, they meet the mysterious beautiful girl Kirigiri Kyouko, and give her a ride.\nHowever, after getting into an accident, the two of them take refuge in a nearby Western-style house. That house is in fact where Kirigiri had been headed, but with a huge tree growing inside, it’s a bizarre place.\nThe heroes are assaulted by a creepy Western-style suit of armor, a skull buried in the garden, and a girl who’s just like Kirigiri Kyouko…\nYou are the protagonist. Can you solve the mystery of the house and escape from this strange place?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o5d.jpg","releaseYear":2016,"developers":[{"id":0,"name":"Spike Chunsoft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198028,"name":"Super Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Super Bomberman is an action-maze game, part of the Bomberman series, released for mobile phones","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u65.jpg","releaseYear":2003,"developers":[{"id":0,"name":"Hudson Soft","games":null},{"id":0,"name":"Living Mobile","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198029,"name":"Panic Bomber","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Panic Bomber is a puzzle game released for mobile phones in japan only and it is part of the Panic Bomber series.","imageUrl":"Sin imagen","releaseYear":2001,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198030,"name":"Panic Bomber Original","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2004,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198031,"name":"Taisen Panic Bomber","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2006,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198032,"name":"Bomberman 3D","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bomberman 3D or 3D Bomberman, is an action 3D game released for mobile phones.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u61.jpg","releaseYear":2004,"developers":[{"id":0,"name":"Matrix Software","games":null},{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198033,"name":"Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bomberman is a free multiplayer game for mobile phones (iOS and Android) available in the Google Play Store, developed and published by Konami, exclusively in Japan. The game features a single or multiplayer battle mode, as seen in many other entires in the Bomberman series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co964q.jpg","releaseYear":2014,"developers":[{"id":0,"name":"Konami","games":null},{"id":0,"name":"Konami","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":198034,"name":"Bomberman Kart","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u63.jpg","releaseYear":2002,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198035,"name":"Bomberman Island 3D","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d7i.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198036,"name":"Rose O'Neill Kewpie Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Rose O'Neill Kewpie ☆ Bomberman is a video game released on mobile devices on January 29, 2009, exclusively in Japan. It is a cross-over between Hudson Soft's \"Rose O'Neil Kewpie\" doll merchandise and the Bomberman series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ogc.jpg","releaseYear":2009,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198037,"name":"Super Gachapin Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Super Gachapin ☆ Bomberman is a video game developed and published by Hudson Soft and released on mobile devices on January 26, 2009, exclusively in Japan. It is a cross-over between the Gachapin series and the Bomberman series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oga.jpg","releaseYear":2009,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198038,"name":"Gachapin Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Gachapin ☆ Bomberman is a video game developed and published by Hudson Soft and released on mobile devices on August 7, 2007, exclusively in Japan. It is a cross-over between the Gachapin series and the Bomberman series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d7l.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198039,"name":"Concrete Crown","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"BEWARE THE MACHINES\nTHEY VOMIT SHADOWS","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5yjs.jpg","releaseYear":2019,"developers":[{"id":0,"name":"LEAKYFINGERS","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198040,"name":"Bomberman Kart 3D","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Bomberman Kart 3D is a 3D racing game developed by Matrix Software and published by Hudson Soft and released for mobile phones on October 10, 2005 in Japan. It is the sequel of the mobile game of same name.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u6b.jpg","releaseYear":2005,"developers":[{"id":0,"name":"Hudson Soft","games":null},{"id":0,"name":"Matrix Software","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198041,"name":"Edrick's Conquest","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Edrick's Conquest is an isometric open world Action RPG featuring unique gameplay, charming environments & competitive play. Explore Plesmur, a high fantasy world, on your own or with your allies.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o5o.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198042,"name":"Paranoiac: Remake Version","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Paranoiac is a freeware horror adventure game by Uri made in WOLF RPG Editor.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7rlb.jpg","releaseYear":2019,"developers":[{"id":0,"name":"Uri","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198043,"name":"BoomBoard!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A timed puzzler where you try to defuse all the bombs via number based clue information before the timer runs out.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o5w.jpg","releaseYear":2018,"developers":[{"id":0,"name":"tonyfinale","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198044,"name":"Numlock","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A mathematics based timed puzzler where you have to match numbers before being grabbed by a creeping hand. Calculate before you get caught in this endless game!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o5x.jpg","releaseYear":2018,"developers":[{"id":0,"name":"tonyfinale","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198045,"name":"Suite Snake","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A timed snake runner with a twist, a timer and a way to reduce tail size. Both performed by collecting card suit in different ways. See if you can balance in this endless snake clone!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o5y.jpg","releaseYear":-1,"developers":[{"id":0,"name":"tonyfinale","games":null}],"libraryGames":null,"platforms":[]},{"id":198046,"name":"Probably Poker","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A twist on normal Poker where you can see the cards left to be dealt. See how high you can score!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o63.jpg","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198047,"name":"Gridheart","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Play as a cute marshmellow creature in this short game where you hop around on changing tiles to get hearts in this chaotic score puzzler.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o66.jpg","releaseYear":-1,"developers":[{"id":0,"name":"tonyfinale","games":null}],"libraryGames":null,"platforms":[]},{"id":198048,"name":"Star Tetrinomino","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Match stars in a row to clear them before time runs out.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o6e.jpg","releaseYear":2021,"developers":[{"id":0,"name":"tonyfinale","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198049,"name":"Definitely Poker","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"A followup to 'Probably Poker'. This game plays like a normal round of video Poker with a twist. Play against the dealer for a highscore but have control over what they can't get via trump cards. Can you stack the deck in your favor?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o6f.jpg","releaseYear":2021,"developers":[{"id":0,"name":"tonyfinale","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Web browser"}]},{"id":198050,"name":"Bomberman Chains","genres":[],"avg_score":0.0,"description":"Bomberman Chains is a puzzle game released for mobile phones (iOS) in 2011 in Japan. Tone, style as well as genre is significantly different from other games in the Bomberman series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u6d.jpg","releaseYear":2011,"developers":[{"id":0,"name":"Konami","games":null},{"id":0,"name":"RucKyGAMES","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":198051,"name":"Bomberman Baseball","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Bomberman Baseball is a baseball video game released for mobiles phones in Japan.","imageUrl":"Sin imagen","releaseYear":2002,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198052,"name":"Bananab!!","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"An obstacle course game for two players -- with a twist! Contestants start on opposite ends of a single race track, one moving forward, the other backward in time.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o8o.jpg","releaseYear":2022,"developers":[{"id":0,"name":"wondermagenta","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198053,"name":"Yatterman X Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Yatterman X Bomberman is a video game released on mobile devices exclusively in Japan. It is a cross-over between the Yatterman and the Bomberman series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ogd.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198054,"name":"Bomberman Pinball","genres":[{"id":0,"name":"Pinball","games":null}],"avg_score":0.0,"description":"A pinball game in the Bomberman franchise, released for mobile phones.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6w4l.jpg","releaseYear":2005,"developers":[{"id":0,"name":"Hudson Soft","games":null},{"id":0,"name":"Living Mobile","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198055,"name":"Bomberman Jetters Vol. 1","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Bomberman Jetters Vol. 1 is a 2D platformer based on the Bomberman Jetters anime made by Hudson Soft and which was released on mobile phones.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4odx.jpg","releaseYear":2003,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198057,"name":"Bomberman Planet Vol. 1","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4odw.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198058,"name":"Bomberman RPG","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Bomberman RPG is a video game released on mobile phones (i-Mode, Yahoo! Mobile and EZweb mobile), exclusively in Japan.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o6j.jpg","releaseYear":2005,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198059,"name":"Bomberman Dojo","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u66.jpg","releaseYear":2011,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":198060,"name":"100-hito Taisen Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o6m.jpg","releaseYear":2012,"developers":[{"id":0,"name":"Konami","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Android"}]},{"id":198061,"name":"Bomberman: Disney Stitch Edition","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bomberman: Disney Stitch Edition was an action game developed by Hudson Soft and published by D2 Communications and released on mobile phones in August 2, 2010 in Japan. It features the Bomberman gameplay and the visuals of Disney's Lilo & Stitch franchise, more specifically the Stitch! anime series, with the alien Stitch as the playable character and the game is a timed score attack challenge.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oaw.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Hudson Soft","games":null},{"id":0,"name":"D2 Communications","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198062,"name":"Bomberman Collection","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d85.jpg","releaseYear":1996,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"}]},{"id":198063,"name":"Bomberman Next Gotochi Kanto-hen","genres":[],"avg_score":0.0,"description":"Bomberman Next: Gotochi Kanto Hen is a portable Bomberman game released on mobile phones in Japan in 2005. It was released along with Bomberman Next Gotochi Kinki Hen.","imageUrl":"Sin imagen","releaseYear":2005,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198064,"name":"Bomberman Next Gotochi Kinki-hen","genres":[],"avg_score":0.0,"description":"Bomberman Next: Gotochi Kinki Hen is a portable Bomberman game released on mobile phones in Japan in 2005. It was released along with Bomberman Next Gotochi Kanto Hen.","imageUrl":"Sin imagen","releaseYear":2005,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198065,"name":"Bomberman Land: Battles","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d7n.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198066,"name":"R20 Moe Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"R20 ☆ Moe Bomberman is a video game released on mobile devices, exclusively in Japan. It is a cross-over between Hudson Soft's R20 ☆ Moe series and the Bomberman series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u68.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198067,"name":"Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"In 1997, a Bomberman-themed LCD game was released by Bandai. The game is played much like the original Bomberman games, with the player having to destroy blocks in a grid-like maze in order to find the entrance to the next level. The game also features sound effects and music.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4odi.jpg","releaseYear":1997,"developers":[{"id":0,"name":"Bandai","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Handheld Electronic LCD"}]},{"id":198068,"name":"Don't Be Afraid: The First Toy","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Don't Be Afraid - The First Toy, is an introduction to the dramatic story of a boy kidnapped by a psychopath. Exploring the giant house of your torturer you will soon discover things worse than your childish nightmares. Take on the role of Jamie and see what phrase “The First Toy” actually means.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o6u.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Eneida Games","games":null},{"id":0,"name":"Broken Arrow Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198069,"name":"Rolling Car","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Drive your car on the looping conveyor belt where tight platforming awaits you. Use your ride's built-in rocket jump and turbo to nimbly overcome traps. Remember, speed isn't always the best option - some situations will require patience!\n\nRolling Car features 30 exciting levels of increasing difficulty that will put your skills to the test! Dangerous saws, spikes, rockers or multi-level constructions requiring daring jumps - all in precisely designed riddle levels.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4os6.jpg","releaseYear":2022,"developers":[{"id":0,"name":"RedDeerGames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198070,"name":"Jim's Adventure","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Jim's Adventure is a game where you need to follow Jim, the Native American in an exciting and challenging adventure. He is exploring a large world filled with perils, ranging from various creatures to obstacles, all trying to stop him. There are a multitude of levels to complete and Jim has a very limited amount of lives.\n\nEvery level has its fair share of challenges, and there are multiple game worlds ranging from haunted forests to deserts, caves and many others.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ihb.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Gametry","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":198071,"name":"Camper Van Simulator","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Get out of your house and begin the adventure today. Feel the summer breeze and prepare for a fun ride!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4pdn.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Pixelmob","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198072,"name":"ABC Search with Me","genres":[{"id":0,"name":"Music","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Discover new words and learn foreign languages in a fast, easy and fun way!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co66q5.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Prison Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198073,"name":"Puzzle Game Bundle","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A bundle of puzzle games for the whole family! Contains the classic game Among Pipes, the relaxing Fall Gummies and the game Zoo Dentist that will teach kids to treat their pets with love and care, while at the same time protect their own teeth!","imageUrl":"Sin imagen","releaseYear":2022,"developers":[{"id":0,"name":"Prison Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198074,"name":"Gyee","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null}],"avg_score":0.0,"description":"Through a magical Dice, you will travel to Luxium and encounter the Gyees.\nYou will come to understand each and everyone of them through this wonderful adventure.\nAnd the choices you make will help them through hard time when they are misunderstood or discriminated against.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o6y.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198075,"name":"Souldrop","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5y7e.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Tayanna Studios","games":null}],"libraryGames":null,"platforms":[]},{"id":198076,"name":"Happy Tails: Animal Shelter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198077,"name":"Hidden Object Classic Adventures","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198078,"name":"Hidden Object Classic Mysteries 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198079,"name":"Annie's Millions: A Hidden Object Shopping Spree!","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198080,"name":"Hidden Object Classic Mysteries 6","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198081,"name":"Hidden Object Classic Adventures 5","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198082,"name":"Hidden Object Classic Treasures 3","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198083,"name":"Hidden Object Classic Adventures 4","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198084,"name":"Hidden Object Classic Mysteries 4","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198085,"name":"Hidden Object Classic Legends","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198086,"name":"Hidden Object Classic Fantasies","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198087,"name":"Agatha Christie Hidden Object Collection","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198088,"name":"Hidden Object Classic Adventures 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198089,"name":"Hidden Object Mysteries 3","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198090,"name":"Gacharoku","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o72.jpg","releaseYear":2002,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 2"}]},{"id":198091,"name":"Matsukata Hiroki no World Fishing","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Matsukata Hiroki no World Fishing is a Sports game, published by BPS and Media Quest, which was released in Japan in 1996.01.19 and 1996.02.02 .","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o74.jpg","releaseYear":1996,"developers":[{"id":0,"name":"Media Quest","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Sega Saturn"},{"id":0,"name":"PlayStation"}]},{"id":198092,"name":"Werewolf: The Apocalypse - Earthblood Champion of Gaia Edition","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"You are Cahal, a powerful Garou who chose to go into exile after losing control of his destructive rage. On his quest for redemption and blood, Cahal plays a crucial role in the great war between the Garous and Endron, a powerful oil company that serves the Wyrm, whose destruction is ravaging the planet.\nHe can transform into a wolf and a Crinos, a huge ferocious beast.\nEach form has its advantages: the wolf can sneak around undetected, Cahal as a human can interact with other people, and the Werewolf can unleash its rage to tear enemies apart.\n\nThe Champion of Gaia edition includes:\n- Full game\n- 3 outfits for Cahal\n- 4 exclusive furs for the Wolf and Werewolf\n- A nature spirit to help you in combat\n- A unique finishing move","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o7a.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Cyanide Studio","games":null},{"id":0,"name":"Nacon","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"},{"id":0,"name":"PlayStation 4"}]},{"id":198093,"name":"Labyrinths of the World: Secrets of Easter Island","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"What starts as a relaxing getaway quickly takes a disastrous turn as your world is attacked by an ancient god and their stone statues! Can you stop the destruction before it's too late?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o7c.jpg","releaseYear":2017,"developers":[{"id":0,"name":"Dominigames","games":null},{"id":0,"name":"Big Fish Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198094,"name":"Labyrinths of the World: Secrets of Easter Island - Collector's Edition","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"What starts as a relaxing getaway quickly takes a disastrous turn as your world is attacked by an ancient god and their stone statues! Can you stop the destruction before it's too late?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o7d.jpg","releaseYear":2017,"developers":[{"id":0,"name":"Big Fish Games","games":null},{"id":0,"name":"Dominigames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198095,"name":"Supernova","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Dash through procedurally-generated levels with destructible obstacles and blast apart enemies with upgradable weapons in this EDM-themed runner/FPS hybrid!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o7h.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Beh3D","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198096,"name":"Ayleouna","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Take Ayleouna on an asteroid hopping adventure in this action platformer with gravity bending elements.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o7k.jpg","releaseYear":2022,"developers":[{"id":0,"name":"the voices games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"}]},{"id":198097,"name":"Super Duper Metroid","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Super Duper Metroid is an exploration oriented hack of Super Metroid that was originally being created by Daltone and later finished and touched up by Metaquarius. It uses v0.8.1 of Project Base, and also contains a mirror mode and a built-in randomizer!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oeh.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Daltone","games":null},{"id":0,"name":"Metaquarius","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":198100,"name":"Profound Red","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Profound Red is the twelfth game in the Carol Reed series. In the title Carol is contacted by her friend Stina. The hotel she works at received a suicide note through a text message from a woman called Louise Elliot, but no one knows the connection to the hotel. Carol investigates in Norrköping to find out who she is and whether there is any suicide involved at all. The game uses its trademark first-person view with photographs of real locations and objects in a fixed-screen slideshow style. There are puzzles to solve with items stored in an inventory near the top of the screen. A journal is used to keep track of objectives. Optionally hints can be activated or all hotspots can be revealed. As a long-running series, some locations are revisited in an updated way as life goes on and there is a cast of new and recurring characters. No knowledge of previous games in required to play.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o85.jpg","releaseYear":2017,"developers":[{"id":0,"name":"MDNA Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198101,"name":"The Birdwatcher","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Birdwatcher is the thirteenth game in the Carol Reed series. Set in Sweden in the summer, Carol has been down with the flu. She is contacted by Immodia, a character from a previous game Profound Red, because her future husband Henrik, a recent widower, has disappeared. She wants Carol to help her track him down. The game uses its trademark first-person view with photographs of real locations and objects in a fixed-screen slideshow style. There are puzzles to solve with items stored in an inventory near the top of the screen. A journal is used to keep track of objectives.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o87.jpg","releaseYear":2018,"developers":[{"id":0,"name":"MDNA Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":198102,"name":"The Fall of April","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Fall of April is the fourteenth game in the Carol Reed series. Set in Sweden Carol helps her friend Andrea who suffers from temporary memory loss induced by a drug. Soon it turns out this event is not only tied to the unresolved murder of Andrea's daughter two years before, but also to a Swedish Arctic balloon expedition in 1915. The game uses its trademark first-person view with photographs of real locations and objects in a fixed-screen slideshow style. There are puzzles to solve with items stored in an inventory near the top of the screen. A journal is used to keep track of objectives.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o89.jpg","releaseYear":2019,"developers":[{"id":0,"name":"MDNA Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":198103,"name":"Geospots","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Geospots is the fifteenth first-person point-and-click adventure game in the Carol Reed series, once again chronicling the adventures of the crime-solving British expat in Sweden. This time, Carol must solve the disappearance of a friend-of-a-friend by retracing their steps, made both easier and more difficult by the fact that cryptic clues to their recent activities abound, thanks to their geocaching hobby.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o8a.jpg","releaseYear":2020,"developers":[{"id":0,"name":"MDNA Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198104,"name":"Amos Green's Final Repose","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Point-and-click","games":null}],"avg_score":0.0,"description":"Amos Green's Final Repose is the 17th adventure of Carol Reed by MDNA, a young woman from England living in Sweden. Carol is contacted by her best friend Stina, because her contact infos were found on a dead man, whose body was discovered in a newly reopened part of a natural reserve. She doesn't know him, so Carol is tasked to find the connection...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o8b.jpg","releaseYear":2022,"developers":[{"id":0,"name":"MDNA Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198106,"name":"Spooky Waltz","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Halloween is here! It's time for the annual Halloween Ball on Halloween Town! Join KaraMaple and Punkpin as they prepare themselves for the most important night of the Year! Get your moves ready, tune your hear for the beat, and prepare to battle a legion of Cursed Candieswhile you dance to the spooky beat. Protect your festival from the Old Geezer Gang and drive them off Halloween Town, assuring the spookier festival ever!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o8f.jpg","releaseYear":2021,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198108,"name":"Star Wars: The Force Unleashed","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Star Wars: The Force Unleashed is a Star Wars video game that takes place between the films Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IV A New Hope. It is the centerpiece of the Star Wars: The Force Unleashed multimedia project,\n\nStar Wars: The Force Unleashed completely re-imagines the scope and scale of the Force and casts players as Darth Vader’s \"Secret Apprentice,\" unveiling new revelations about the Star Wars galaxy seen through the eyes of a mysterious new character armed with unprecedented powers.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5au4.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198109,"name":"Love Live Heardle","genres":[{"id":0,"name":"Quiz/Trivia","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"A clone of Heardle, but for Love Live songs.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o8m.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198112,"name":"This is the Only Level Too","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Do you like jumping? Do like spikes? There are both in this game, and a handful of different ways to try to beat the only level in the game. Confront each new stage challenge with a sort of heart and dignity that we can only befall on our most noble of creatures. Also you can unlock a velociraptor, how cool how is that?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6yey.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Armor Games","games":null},{"id":0,"name":"jmtb02","games":null},{"id":0,"name":"Tasselfoot","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198113,"name":"Saints Row","genres":[],"avg_score":0.0,"description":"Saints Row is a gritty 3rd person action/shooter game based on the XBOX 360 title from THQ. In the game you play as a member of the 3rd Street Saints on a mission to rise through the ranks and take over the city from rival gangs, one District at a time. Remember that your actions can have consequences so it is up to you to decide how best to make it to the top. Enough Talk. Let's Play.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o99.jpg","releaseYear":2006,"developers":[{"id":0,"name":"Mnemonic Studios Ltd.","games":null},{"id":0,"name":"THQ Wireless","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198114,"name":"Parallel Lab","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A two-player cooperative puzzle adventure, that is all about communication. Players have to follow parallel paths, explore a secret laboratory, describe what they see, and work together to unravel the mystery. Parallel Lab is played on two devices with a browser.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o9a.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Eleven Puzzles","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Android"},{"id":0,"name":"Web browser"},{"id":0,"name":"iOS"}]},{"id":198115,"name":"Saints Row 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o9b.jpg","releaseYear":2008,"developers":[{"id":0,"name":"G5 Entertainment","games":null},{"id":0,"name":"THQ Wireless","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198116,"name":"Sonic Unfair 2","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oct.jpg","releaseYear":2016,"developers":[{"id":0,"name":"Master Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Web browser"}]},{"id":198121,"name":"Mathuba","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A puzzle game in which you flip plus and minus symbols to shoot a ball into numbers trying to collect the highest sum.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o9k.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Florian Wolf","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":198122,"name":"HWY Chase","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A \"Galaxian\" type game. Shoot the flashing car (alien) on the screen the clear the level.\n\nHWY (pronounced Highway) Chase was released in December 1980 in the Japanese arcades. It was the very first video game made for this system (Cassette No. 01) along with Sengoku Ninja-tai (known as Ninja out of Japan) and Manhattan.\n\nIt is said the title HWY Chase (HWY instead of Highway) was selected to easily recycle source code and materials made for 'Mad Rider', released earlier as a PCB, and known as 'Mad Alien' out of Japan.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4o9p.jpg","releaseYear":1980,"developers":[{"id":0,"name":"Data East Corporation","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":198123,"name":"Quasar","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"\"The game consists of four different encounters in space, in which the player has to fight battles.\n\nUpon the successful completion of each series of encounters without losing all his ship, the game recommences, and the player is faced each time with greater difficulties. The skill of the player will enable him to play the game until such time as he enters into battle and all his ships are destroyed.\"","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7keh.jpg","releaseYear":1980,"developers":[{"id":0,"name":"Zaccaria","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Arcade"}]},{"id":198124,"name":"Samurai Warriors 3 Z: Special","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Samurai Warriors 3 Z: Special is a remastered compilation of Samurai Warriors and it's standalone expansion Samurai Warriors 3: Xtreme Legends ported to PlayStation Portable from Wii.\n\nThis version adds a 4-player competitive online mode via an ad-hoc network.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oa0.jpg","releaseYear":2012,"developers":[{"id":0,"name":"Koei Tecmo","games":null},{"id":0,"name":"Omega Force","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation Portable"}]},{"id":198126,"name":"Snow Bros.: Nick & Tom Special","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"One day, the peaceful country of Snow Land is suddenly invaded by King Artich of Kingdom Hotteda Kingdom! The twin princes of Snow Land, Nick, and Tom try to stop him, but in turn, are transformed into snowmen by the curse of King Artich. The twin princesses, Puripuri and Puchipuchi are abducted and Snow Land began melting down and disappearing. Nick and Tom start their long journey to regain peace in Snow Land, rescue the princesses and lift the curse.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oyt.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Clear River Games","games":null},{"id":0,"name":"CRT Games","games":null},{"id":0,"name":"Daewon Media","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198127,"name":"Hidden Through Time: Definitive Edition","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Hidden Through Time: Definitive Edition promises light-hearted puzzling fun for all ages and even the entire family! It is a cute hide-and-seek/hidden object game with objects taken from different fantastical eras of our world’s history – from missing dinosaur eggs to ancient Egypt and the Wild, Wild West. It is the first hidden object game with dynamic, bubbling, and colorful hand-drawn & animated levels.","imageUrl":"Sin imagen","releaseYear":2020,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":198128,"name":"Fighting Legends Pack","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"This edition includes the following:\n- Capcom Fighting Collection\n- Street Fighter: 30th Anniversary Collection International","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6dqt.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":198129,"name":"Final Vendetta: Super Limited Edition","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Final Vendetta is a hard-hitting action packed beat ‘em up for 1 or 2 players in the vein of classic arcade titles. Featuring stunning pixel art and a thumping soundtrack with exclusive tracks from Utah Saints! Brawl with bad dudes and tough girls as you fight through dangerous environments.\n\nThe Super Limited Edition of Final Vendetta includes:\n- Box contents\n- Game: Final Vendetta\n- Deck of 32 Collectible Character Cards\n- Original Soundtrack\n- A4 landscape Artbook\n- A3 Poster\n- Barrel USB\n- A radical “Bin Chicken” sticker!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ow5.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Bitmap Bureau","games":null},{"id":0,"name":"Numskull Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":198130,"name":"My Universe: Green Adventure - Farmer Friends","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Become an environmentally friendly farmer! Explore your farm's surroundings, clear your overgrown fields and find a new way to fertilize your crops. Roll up your sleeves and get ready to dig and water your crops regularly to reap the fruits of your labor. Be sure to follow the complete production cycle of a green farmer! Every day is an adventure thanks to the different quests.\nMake some animal friends! During your adventure, you will be in charge of the entire farmyard, cows, hens, goats, sheep, ducks, and more. You'll have to renovate various buildings to home your new companions. Care for them, show them plenty of affection and have fun with them thanks to the many mini games.\nMeet the villagers' needs! The further you progress in your adventure, the larger your choice of seeds will get. Flowers, fruits and vegetables, pay close attention to the villagers' orders to be sure to meet their needs. With a little creativity you will improve your recipes and create new flavors for your yogurts, jams, etc. It's up to you to show off your local production and your traditional recipes to the village's inhabitants!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4owm.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Smart Tale Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Mac"}]},{"id":198131,"name":"White Night: Deluxe Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ow7.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198132,"name":"Yuppie Psycho: Collector's Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6zuf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"}]},{"id":198134,"name":"A Drunk Man Looks at the Thistle Decoded","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Come read this Scottish poem from 1926.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ob5.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198136,"name":"Red Bull MotoCross 2D","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Gorgeous graphics and effects, realistic physical models, all this awaits you in Red Bull Freestyle Motocross. Gather together all the power, skill, courage and talent to organize a real show for your friends. Discover new motorbikes and tricks. Improve your accomplishments. Red Bull Motocross game features: Six different game modes Four tracks (Mexico, Egypt, Moscow, Rome) and X-Fighters tour Four motorcycle, each one with its own behavior 12 different tricks, 8 of them must be unlocked Game keeps track of more than 20 different statistic data Full realistic effects Replays of your best races.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5umv.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Digital Chocolate","games":null},{"id":0,"name":"Xendex","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198137,"name":"Serious Sam","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A port of Serious Sam: The First Encounter and Serious Sam: The Second Encounter for Xbox that compiles them into one cohesive game. Features a visual makeover with a redesigned menu and main character model which are far more cartoonish, alongside expanded story cutscenes.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ocg.jpg","releaseYear":2002,"developers":[{"id":0,"name":"Croteam","games":null},{"id":0,"name":"Gotham Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox"}]},{"id":198139,"name":"2901 Freelancer","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Experience daily life in bustling Prodcity #2901 in year 2901! Trashy cyberpunk sim -time/mood management!\n\nScavenge, work, sell drugs, freelance and make ends meet any way you can to find a way to survive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oc3.jpg","releaseYear":2019,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Web browser"},{"id":0,"name":"Linux"}]},{"id":198140,"name":"Illuvium","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Step into the adrenaline-fueled Arena, where strategy and action converge. Whether facing the relentless waves of Illuvials in the Survival Arena or outwitting foes in competitive duels in the Ascendant Arena.\n\nIlluvium: Overworld will be an expansive third-person RPG set within a diverse and dynamic open world. Across this alien terrain, mystical creatures lurk—each with potent abilities. Craft gear to explore, collect precious resources, and empower your team. Every decision shapes your path, carving out your legacy in the wilds of an alien world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7ew7.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Illuvium","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":198144,"name":"Duskworld","genres":[],"avg_score":0.0,"description":"Duskworld is a retro-styled first-person shooter video game, set in the fictitious rural town of Dusk, Pennsylvania. Players will engage into action where they must survive and find the exit of the level while surviving all hazards on the way. You'll come across different horrendous opponents such as demonic livestock, robed cultists, sentient scarecrows, and possessed soldiers. You have a variety of powerful weapons at your disposal. The game also has a multiplayer option and an online deathmatch mode which supports up to 16 players. Gather your friends and head-up for the challenge. Will you survive?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ocj.jpg","releaseYear":2017,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198146,"name":"Top Stars Football","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ocl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198148,"name":"Falcon Beertender","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Falcon Beertender is a Swedish freeware game by E-Game and a promotional tie-in with Falcon Brewery. It is a remake of Tapper with the same objective, to serve your customers a mug of beer each.\n\nFalcon Beertender enhances the gameplay of Tapper in two ways. First, your customers can sometimes be very thirsty: they will toss back an empty beer mug for you to fill. You'll have to catch those mugs and pass them more beer. Secondly, breaking a (glass) mug also costs you a life, so you must make sure that you're not tossing more beer mugs than necessary, lest they crash into a back wall.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7qrz.jpg","releaseYear":2000,"developers":[{"id":0,"name":"E-game, SA","games":null},{"id":0,"name":"Falcon Brewery","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198149,"name":"Bloom","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Bloom is a real-time narrative-driven social sim about starting up a flower shop made exclusively for Playdate. Tend to Midori's garden while texting friends and family as she starts a new chapter of her life. The game takes place over many real-life days.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4p8a.jpg","releaseYear":2022,"developers":[{"id":0,"name":"RNG Party Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":198150,"name":"Sprout","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sprout is an action-adventure game for Playdate made by RNG Party Games in the Pulp engine. You control the robot AL1C3 in a quest to grow a plant by collecting water from different corners of the world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4odl.jpg","releaseYear":2022,"developers":[{"id":0,"name":"RNG Party Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":198151,"name":"Xenoblade Chronicles 3: Special Edition","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A collector's version of Xenoblade Chronicles 3 which contains a steelbook and a collection of art from the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ocp.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Nintendo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"}]},{"id":198152,"name":"World War II: Battle combat","genres":[{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Play the cool WW2 weapons game to get real shooter game experience.\nIf you like war games with world war setting, then you must play this cool game. Incredible graphics, exciting gameplay, lots of historical weapons and armor will give you the opportunity to immerse yourself in the world of heroes.\nYou can choose between different online action games, such as Team Deathmatch, Deathmatch, Capture Position, Arms Race, Knife Only and even Bomb Mode.\nUse different FPS strategies on different maps, be smart and don't forget the tactics aspect.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ohh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198153,"name":"Rogue Door Defense","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Rogue Door Defense is a tower defense mazing game with rouge-lite elements. Choose a door, defeat the enemies behind it and claim your unique reward. Build and upgrade different towers. Design your own maze to defend your lives against the attacking waves of monsters and powerful bosses.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ocy.jpg","releaseYear":2022,"developers":[{"id":0,"name":"BrimselGames","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198154,"name":"Amid Evil VR","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A retro FPS for the ages! Completely rebuilt from the ground up for VR! Once branded a heretic, now you have been chosen as our champion! Reclaim our sacred weapons. Take back our ancient lands. If you can stand... Amid Evil.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a6x.jpg","releaseYear":2023,"developers":[{"id":0,"name":"New Blood Interactive","games":null},{"id":0,"name":"Indefatigable","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"SteamVR"},{"id":0,"name":"Oculus Quest"},{"id":0,"name":"Meta Quest 2"},{"id":0,"name":"PlayStation VR2"}]},{"id":198156,"name":"Walkabout Mini Golf: Myst","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Putt through the surreal world that defined adventure games. Myst island—the starkly beautiful setting tinged with mystery and shrouded in intrigue. Challenge yourself and your friends to unlock 18 easy and 18 hard mode holes, each a puzzle unto themselves. Rediscover the best-selling computer game of the 20th century, and the island that invented an entire genre.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4rob.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Mighty Coconut","games":null},{"id":0,"name":"Cyan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Windows Mixed Reality"},{"id":0,"name":"SteamVR"},{"id":0,"name":"PlayStation VR2"},{"id":0,"name":"Oculus Rift"}]},{"id":198157,"name":"World of Warcraft: Dragonflight","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The dragonflights of Azeroth have returned, called upon to defend their ancestral home, the Dragon Isles. Surging with elemental magic and the life energies of Azeroth, the Isles are awakening once more, and it's up to you to explore their primordial wonder and discover long-forgotten secrets.\nMaster the art of Dragonriding, with a new form of aerial movement, venture into the ancient prison of the Primal Incarnates before their malevolent power can be unleashed against the Dragon Aspects in the new raid.\nFight to reclaim Neltharus, stronghold of the black dragonflight, explore previously unknown chambers of Uldaman, defend the Life Pools of the red dragonflight, and more! In new dungeons!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co67z6.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Blizzard Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":198158,"name":"Walkabout Mini Golf: Jim Henson's Labyrinth","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Explore the world inhabited by creatures, faeries, goblins, and iconic scenes so memorably brought to life by Jim Henson’s 1986 classic film with a dazzling mini golf course of fantasy and adventure! Walkabout Mini Golf: Labyrinth is a vivid, challenging, character-filled, and richly realized course for players where they can escape, explore, and play solo or rendezvous with up to four other players for 18 easy mode and 18 hard mode holes—complete with realistic physics, and beloved creatures from the film. Master the course, collect 18 special lost balls, and follow the clues of the Labyrinth-themed “fox hunt” scavenger expedition as well as expansive mazes and gardens to discover.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8da2.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Mighty Coconut","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation VR2"},{"id":0,"name":"SteamVR"},{"id":0,"name":"Windows Mixed Reality"},{"id":0,"name":"Oculus Rift"}]},{"id":198159,"name":"Star Sled","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Steer your lightning-fast Star Sled through multiple missions designed to test the reflexes of even the most dedicated space pilots! Encircle and capture life-giving Sparks with your Sled’s laser lariat while avoiding deadly Trion Sentries. Advance to the end and take on the Trion Emperor himself!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ts3.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Panic","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":198160,"name":"Inventory Hero","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Inventory Hero is a frantically paced role-playing game where you leave the exploration and the monster battles to the computer so you can focus on the true meaning of adventure: managing your inventory.\n\nDrop the trash, equip the good stuff, save the potions for a rainy day, and remember to watch out for rabbits…","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4v63.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Panic","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":198161,"name":"World of Warcraft: Wrath of the Lich King Classic","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The Lich King's forces await you in the icy continent of Northrend. World of Warcraft: Wrath of the Lich King Classic is coming, and with it another chance to relive the legend and face one of Azeroth's greatest villains.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co55cd.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Blizzard Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198163,"name":"Super Metroid: Redesign - Axeil Edition","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A refreshing remake of a classic hack, with improved physics, automated/streamlined mechanics for improved accessibility, an optional hint system, rebalanced enemy damage, neat features like area nameplates, and new secrets and puzzles. Even if you know where to go from playing Redesign, or just from using the hint system, it manages to feel like a whole new game. It even has extra stats at the ending under your percentage.\n\nDrewseph has spent the last 9 years taking the criticism of Redesign to heart, and the result is Super Metroid Redesign: Axeil Edition.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oda.jpg","releaseYear":2018,"developers":[{"id":0,"name":"Drewseph","games":null},{"id":0,"name":"Metroid Construction","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":198164,"name":"Sketch, Share, Solve","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sketch, Share, Solve is a nonogram game for Playdate, fitting loads of puzzles onto the tiny screen. Play on your own or create puzzles with your friends.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7cj7.jpg","releaseYear":2023,"developers":[{"id":0,"name":"veubeke","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":198165,"name":"Bomber Panda","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Help the 'Bomber Panda' save his species from extinction by... blowing stuff up! This fun and challenging game has 31 levels of increasing difficulty for you to blast through. Collect power-ups to increase your bomb capacity, explosion size and walking speed. Avoid or blast the aggressive enemies while you try to find the exit.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oi9.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Rob Seto-Patchett","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":198166,"name":"Ribbit Rabbit","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Help Ribby catch yummy carrot-flies for his lunch across 40 fun levels of ever more devious puzzles! Encounter traps, mazes, and monsters across four zones!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4q22.jpg","releaseYear":2022,"developers":[{"id":0,"name":"reverendmalerik","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Playdate"}]},{"id":198167,"name":"Grow Nano 3","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null}],"avg_score":0.0,"description":"Heal the little blue man by picking the objects in order","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ods.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Eyezmaze","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198168,"name":"Pocket Heroes","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Command a party of elite heroes, fight monsters and demons in various dungeons. Use magic and different weapons. Take vengeance for king Arthur's death in this Android game. Defeat strong monsters like cyclops, carnivorous plant, giant sandworm and so on. Organize your hero parties in such a way so their classes and abilities complement each other. You have mages warriors, archers and priests. As you level up you can choose one of two paths of each hero class.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co95fe.jpg","releaseYear":2014,"developers":[{"id":0,"name":"Elite Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":198171,"name":"Zenkoku Dekotora Matsuri","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oe5.jpg","releaseYear":2006,"developers":[{"id":0,"name":"Suzak","games":null},{"id":0,"name":"Jaleco","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Wii"}]},{"id":198173,"name":"Maniac Mansion Deluxe","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Maniac Mansion Deluxe is a 1:1 remake of the original \"Maniac Mansion\" on 256-colour. Sandy, girlfriend of the games' hero Dave has been kidnapped by evil scientist Dr. Fred Edison. So Dave has to gather two friends around him and go to the old mansion to rescue her.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oef.jpg","releaseYear":2003,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198174,"name":"Sonic the Hedgehog Forever","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Based on the recent decompilation of the mobile version, Sonic the Hedgehog Forever adds a number of abilities, options, and game modes to enhance the experience and celebrate the replayability of the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oh3.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Team Forever","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198176,"name":"Sunky.Mpeg","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"A funky parody of Sonic.exe in which Sunky gathers all his friends to dance!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4smc.jpg","releaseYear":2015,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198177,"name":"Ninja Saga","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Fighting","games":null},{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A leading casual RPG which allows you to create and customize your own Ninja, train up with more than 1,000+ animated Jutsu, Missions, Weapons, Pets. Challenge your friends in real time PvP battles. Clan system is up and running, Play now!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oet.jpg","releaseYear":2009,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198179,"name":"The Witcher: Versus","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"The Witcher: Versus (initially called The Witcher: DuelMail) was a free Flash-based multiplayer fighting browser game, developed for CD Projekt RED by one2tribe, that has you create a character from one of three classes and challenge other players to deadly battles.\n\nThe game was later ported from webBrowser to iOS in 2011. Since 2014 however both versions aren't playable anymore and the game is considered delisted.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oeu.jpg","releaseYear":2008,"developers":[{"id":0,"name":"One2tribe","games":null},{"id":0,"name":"Chillingo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"},{"id":0,"name":"Web browser"}]},{"id":198180,"name":"Supertan Marioner 3D Infinity World Adventures","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The adventures of Super marioner continue. This time with 3D design. Travel through the jungle with marioner. Jump between platforms. Try not to fall in this endless speeding adventure. You have 3 rights. Try to make the highest record","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oew.jpg","releaseYear":2022,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198181,"name":"Maya the Bee: Garden Adventures","genres":[],"avg_score":0.0,"description":"This game uses the license from the famous German TV series Biene Maja. Maja's best friend Willi is kidnapped by the hornets, the enemies of the bees. In this game you are playing Maja the bee and has to free Willi. In this adventure you have to solve some puzzles, finding things to get further. Inside the hornets nest you have to hide and seek to not get caught.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4os7.jpg","releaseYear":2000,"developers":[{"id":0,"name":"Acclaim Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Color"}]},{"id":198182,"name":"Taisen Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Taisen Bomberman is a mobile Bomberman game with online features. It is the first game in the Taisen ☆ Bomberman series.\n\nYears later, a game called Taisen! Bomberman was released, but they are unrelated.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u69.jpg","releaseYear":2004,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198183,"name":"Taisen Bomberman 8","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Taisen Bomberman 8 is the second game in the Taisen ☆ Bomberman series. It is an enhancement over the previous game, adding a 8 player multiplayer mode.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oez.jpg","releaseYear":2005,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198184,"name":"Taisen Bomberman 24","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The third game in the Taisen ☆ Bomberman series. It was named after its 24 players multiplayer support.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4of0.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198185,"name":"Taisen Bomberman +","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The fourth game in the Taisen ☆ Bomberman series.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4of3.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198186,"name":"Taisen Bomberman 24+","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Fifth game in the Taisen ☆ Bomberman series, and the second in the series to support 24 players multiplayer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4of4.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198187,"name":"Taisen Bomberman Geek","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sixth game in the Taisen ☆ Bomberman series. It added support to purchase power-up items.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4of5.jpg","releaseYear":2009,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198188,"name":"Taisen Bomberman Cross","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The seventh game in the Taisen ☆ Bomberman series. It is an expanded version of Taisen Bomberman +, adding a cross-play compatibility between different mobile phone carriers (i-Mode, EZweb, Yahoo! Keitai).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4of6.jpg","releaseYear":2009,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198189,"name":"Bomberman Kart","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"A racing game using simulated 3D in the vein of OutRun or Rad Racer, now with a rainbow of Bombermen in the drivers' seats! Race against five opponents across three difficulties of Grand Prix, for a total of six courses. Racers can collect items from question mark panels, ranging from projectiles such as bombs, missiles and Slime Bombs, to situational items like landmines, shields and nitro boosts. There are six different colours of Bomberman and three karts to choose from, each with their own unique stats.\n\nAlongside the Grand Prix, you can race any track alone in the Time Trial mode and aim to beat your personal beat. Records for both Grand Prix and Time Trial can be uploaded to a national server.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u64.jpg","releaseYear":2005,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198190,"name":"Bomberman Kart Special Mini","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"A compact version of Bomberman Kart (Special in Japan), which was released at lower price.","imageUrl":"Sin imagen","releaseYear":2005,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198191,"name":"Bomberman '08","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A remake of Bomberman '94 for mobile phones. The game boasts remastered and reshaded graphics, applying the modern designs to Bomberman and Louie. There also appear to be altered level designs, but outside of being refitted for a mobile phone interface, no sources note the changes in full.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ofd.jpg","releaseYear":2008,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198192,"name":"Bomberman for Gree","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A free-to-play \"social game\" distributed on GREE SNS, designed to be accessible to veterans and newcomers alike. Players proceed through single-player stages, battling enemies, collecting items, and encountering bosses at the end of each area.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d7k.jpg","releaseYear":2011,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198193,"name":"Pac-Man x Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Pac-Man x Bomberman is a crossover title in the Bomberman and Pac-Man franchise.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4off.jpg","releaseYear":2010,"developers":[{"id":0,"name":"D2 Communications","games":null},{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198194,"name":"Gachapin & Mukku no Daiundoukai","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A sports minigame collection featuring characters from the Gachapin franchise and from Hudson Soft properties.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ofg.jpg","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198195,"name":"Bomberman Act:Zero Mobile Type","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The mobile port of Bomberman Act:Zero.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d84.jpg","releaseYear":2006,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198196,"name":"Bomberman 2004","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A port of Bomberman GB2 released only in Korea.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ofl.jpg","releaseYear":2004,"developers":[{"id":0,"name":"Hudson Soft","games":null},{"id":0,"name":"@Data","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198197,"name":"Taisen Daifugo","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2005,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198198,"name":"Taisen Daifugo +","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198199,"name":"Taisen Daifugo Cross","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Taisen Daifugo Cross adds cross-platform multiplayer compatibility.","imageUrl":"Sin imagen","releaseYear":2009,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198200,"name":"F1 22","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Race the stunning, new cars of the Formula 1 2022 season with the authentic lineup of all 20 drivers and 10 teams, and take control of your race experience with new immersive or cinematic race sequences. Test your skills around the new Miami International Autodrome, and get a taste of the glitz and glamour in F1 Life. Create a team and take them to the front of the grid with new depth in the acclaimed My Team career mode, race head-to-head in split-screen or multiplayer, or change the pace by taking supercars from some of the sport’s biggest names to the track.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4r57.jpg","releaseYear":2022,"developers":[{"id":0,"name":"EA Sports","games":null},{"id":0,"name":"Codemasters","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Xbox One"}]},{"id":198201,"name":"Super Sus","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Join the next level of 3D Among Us game - Super Sus: Who is the Imposter! The best free mobile game to social with local friends and those from worldwide offers you an unique experience to be space crews, who struggles to prevent the spaceship from crashing while for imposters, killing crew mates is all they want.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8oxx.jpg","releaseYear":2021,"developers":[{"id":0,"name":"Giant Interactive Entertainment","games":null},{"id":0,"name":"PIProductions","games":null},{"id":0,"name":"Giant Interactive Group Inc.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"iOS"}]},{"id":198202,"name":"Taisen Mahjong","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Mahjong multiplayer game featuring Bomberman characters.","imageUrl":"Sin imagen","releaseYear":2006,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198203,"name":"Taisen IQ","genres":[{"id":0,"name":"Quiz/Trivia","games":null}],"avg_score":0.0,"description":"Quiz game featuring Bomberman characters.","imageUrl":"Sin imagen","releaseYear":2006,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198204,"name":"Taisen IQ +","genres":[{"id":0,"name":"Quiz/Trivia","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198205,"name":"Taisen Panic Bomber +","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Updated version of Taisen Panic Bomber.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198206,"name":"Taisen Golf","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Golf game featuring Bomberman characters.","imageUrl":"Sin imagen","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198207,"name":"Dark Swords Firelink","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Dark Swords: Fire link is a 2D metroidvania game with a large locations to explore, fight with a lot creatures and epic bosses, and greats skills and power-ups to acquire. Have some of the better features that defines the 8/16-bits era, games like Ninja Gaiden, Super Ghost and Ghouls, Megaman, Castlevania and Super Metroid. Also, it gets inspired by the Dark Souls series, Hollow Knight and Blasphemous.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4wx8.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Lair Games Studio","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198208,"name":"Taisen Golf","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"An updated version of the previous Taisen Golf released circa 2008. The game is a golf game featuring Bomberman characters.","imageUrl":"Sin imagen","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198209,"name":"Taisen Reversi","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"An online game of Reversi (also known as Othello), featuring Bomberman icons to represent each player.","imageUrl":"Sin imagen","releaseYear":2008,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198210,"name":"Taisen Reversi Cross","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"An update to Taisen Reversi which added cross-platform multiplayer compatibility.","imageUrl":"Sin imagen","releaseYear":2010,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198211,"name":"Bomberman Land Mobile","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198212,"name":"Bomberman Reprint","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A remaster of the NES Bomberman game.","imageUrl":"Sin imagen","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198213,"name":"Bomberman 3D BT Wide-ban","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"An updated version of Bomberman 3D which adds widescreen and Bluetooth multiplayer support.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ofq.jpg","releaseYear":2007,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198214,"name":"3D Bomberman Atomic","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"3D Bomberman Atomic is a traditional style Bomberman game released for mobile phones.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d7h.jpg","releaseYear":2009,"developers":[{"id":0,"name":"Living Mobile","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198215,"name":"Bomberman Legends","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bomberman Legends, also known as Jaguar Bomberman, is an unreleased action-maze video game that was in development by Genetic Fantasia and planned to be published by Atari Corporation for the Atari Jaguar. It was going to be a unique entry in the Bomberman franchise, featuring its own dedicated single-player and multiplayer modes, with the latter having support for up to eight players by using two Team Tap adapters.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ofs.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Atari Corporation","games":null},{"id":0,"name":"Genetic Fantasia","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Atari Jaguar"}]},{"id":198216,"name":"Super Bomberman BT","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A version of Super Bomberman (mobile) with multiplayer support via Bluetooth.","imageUrl":"Sin imagen","releaseYear":2003,"developers":[{"id":0,"name":"Hudson Soft","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198218,"name":"3D Bomberman","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A port of the Japanese version of the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5u62.jpg","releaseYear":2005,"developers":[{"id":0,"name":"Living Mobile","games":null},{"id":0,"name":"Matrix Software","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Legacy Mobile Device"}]},{"id":198220,"name":"Breeze in the Clouds","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Become a force of nature in a stylish, combo-fueled 2D action-adventure! Jump, brawl, and command the powers of weather as Breeze, a scrappy and courageous corgi swept away from his regular life to fight pollution in a fantastic world in the clouds where animal forces control the weather.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6i5l.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Stormy Nights Interactive","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":198221,"name":"Bugaboo Pocket","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Bugaboo Pocket is a virtual pet game starring bugs from land, air and sea!\n\nPlay as a research scientist living in a cabin with just your bugs and a penpal for company. Spoil them with pets, minigames, food and furniture.\n\nRaise and release bugs to help Beetleback Ridge recover from a devastating fire.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6lm3.jpg","releaseYear":2025,"developers":[{"id":0,"name":"Elytra Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Nintendo Switch"}]},{"id":198223,"name":"Severen","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"An upcoming game featuring interchangeable limbs that allow for new abilities and secret paths to be found.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4og0.jpg","releaseYear":-1,"developers":[{"id":0,"name":"IZMA","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"},{"id":0,"name":"Web browser"}]},{"id":198224,"name":"Super Demo World: The Legend Continues","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Super Demo World: The Legend Continues is a project put together with the goal of displaying the capabilities of the SMW Level Editor Lunar Magic.\n\nSuper Demo World, was first released in 2001 as a few short levels to show off custom blocks which had varying requirements for when they could be broken such as the typical only when big breakable bricks or bricks that could only be broken with a fireball. Since then, the project has gone on to be a complete hack of SWM spanning across and heavily altering all of its levels.\n\nAs this hack is designed with the explicit goal of showing off Lunar Magic, players will find a wide variety of challenges across Super Demo World‘s many meticulously crafted levels and will assuredly find themselves stretching out fiber of their SMW muscles along the way.\n\nEach on of the castles in this hack come with a quirky blurb at the end once you defeat the boss, many of them referring to bizarre or somewhat dark scenarios where the Koopa’s were experimenting on the eggs or simply hording them for buffets.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4og2.jpg","releaseYear":2003,"developers":[{"id":0,"name":"Zero-G","games":null},{"id":0,"name":"SMW Central","games":null},{"id":0,"name":"FuSoYa","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Super Nintendo Entertainment System"}]},{"id":198225,"name":"NFL Pro Era","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"The first fully licensed NFL football simulation game made for virtual reality headsets.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6knn.jpg","releaseYear":2022,"developers":[{"id":0,"name":"StatusPRO","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation VR"},{"id":0,"name":"Meta Quest 2"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation VR2"}]},{"id":198227,"name":"Red Matter 2","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Red Matter 2 is an immersive, puzzle-adventure game that will transport you to the far reaches of space. Step into the shoes of Sasha, an agent awakened in a lunar base by an undercover operative and tasked with uncovering the secrets of the mysterious Red Matter.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8ccv.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Vertical Robot","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Meta Quest 2"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation VR2"}]},{"id":198228,"name":"Espire 2","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Experience unparalleled stealth action in both single player and cooperative campaigns with Espire 2: a full-fledged VR FPS on Quest 2.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ogv.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Tripwire Interactive","games":null},{"id":0,"name":"Digital Lode","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Meta Quest 2"}]},{"id":198229,"name":"Ruins Magus","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Ruins Magus is a VR action RPG developed for VR. Explore and cast your way in first-person through an immersive fantasy world. As a novice member of the RUINSMAGUS guild, work with the Enigma Research Institute to uncover the mysteries hidden beneath the gilded streets of Grand Amnis.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ogz.jpg","releaseYear":2022,"developers":[{"id":0,"name":"CharacterBank","games":null},{"id":0,"name":"Mastiff","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"SteamVR"},{"id":0,"name":"Oculus Quest"},{"id":0,"name":"PlayStation VR2"},{"id":0,"name":"Meta Quest 2"}]},{"id":198230,"name":"Bonelab","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sentenced to death, you embody an outcast escaping fate. Discovering a pathway to a hidden underground research facility. A series of challenging experiments and discoveries await. A road to the truth calls from the void.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4q6t.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Stress Level Zero","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"SteamVR"},{"id":0,"name":"Meta Quest 2"},{"id":0,"name":"Oculus Rift"}]},{"id":198231,"name":"Ghostbusters VR","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Strap on your proton pack and Quest 2 and step into the world of Ghostbusters in immersive virtual reality. Start your Ghostbusters HQ in a new city, San Francisco, and solve a deep mystery across a new chapter in the Ghostbusters universe.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oh2.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Sony Pictures Virtual Reality","games":null},{"id":0,"name":"nDreams","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Meta Quest 2"}]},{"id":198232,"name":"The Walking Dead: Saints & Sinners - Ch 2: Retribution","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Your tour through undead New Orleans continues in this new chapter to the Tourist’s story in The Walking Dead: Saints & Sinners. Hunted by the seemingly unstoppable Axeman and facing off against the Tower’s latest push for total dominance, discover what connects these new threats together before it’s too late. New faces, places, weapons and gear all await you on your journey to a final showdown for the city's fate. Do you have what it takes to survive it all?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4qbe.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Skydance Interactive","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"SteamVR"},{"id":0,"name":"Meta Quest 2"},{"id":0,"name":"PlayStation VR2"}]},{"id":198233,"name":"End Roll: Rewind","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"An in-progress fan game on a speculative prequel for End Roll.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ogf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198234,"name":"Retro64","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A mod which adds Mario from Super Mario 64, complete with all his abilities and physics, to Minecraft. This mod needs both Minecraft and Super Mario 64.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ogq.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Dylan","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198236,"name":"No Senses","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ohq.jpg","releaseYear":2022,"developers":[{"id":0,"name":"All4Life Games","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198238,"name":"Square Runner","genres":[],"avg_score":0.0,"description":"Square Runner is a fast-paced platformer where you try to go back to your home planet with the side effect of saving earth.\nWill you return home or will you be stuck on earth forever? Form a squad, explore the unknown Adamian archipelago and fight creatures in Square Runner","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oh8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198239,"name":"Meme Lordz","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Real Time Strategy (RTS)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Meme Lordz is a NFT based blockchain game powered by the BSC network. A top-down RPG, battle, bind and collect as you journey through a mysterious land powered by the collective thought-forms of humanity.\n\nThe Meme Lordz Beta release takes players on a 60+ hour nostalgic, retro journey through Planet Memnon. Players will experience a rich storyline, dynamic combat system, expansive item system & much more!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4q03.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":198240,"name":"Turning Red Dancing Tiles Hop","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Welcome to turning red with these new tiles revealed for tiles hop. If you love jumping ball games and,dancing with Mei Lee and her mother's obedient daughter and the chaos of her game, then you will love this game. It's very fun and time-killing, river dance, jump-ball with turning red and Mei Lee dance hop Tiles is one among the foremost widespread games.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ohb.jpg","releaseYear":2022,"developers":[{"id":0,"name":"pintoristo","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":198241,"name":"Saleblazers","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Embark on an epic adventure across the lands as a humble shopkeeper. Build your shop exactly the way you want it, sell goods from your travels, and defend your base from nightly horrors in this open world shopkeeping RPG for 1-8 players!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8fp4.jpg","releaseYear":2023,"developers":[{"id":0,"name":"Airstrafe Interactive","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":198242,"name":"Idol Days Sim Date","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Idol Days Sim Date is a dating simulation game created by Pacthesis. It was released on July 16, 2010.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ohf.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Pacthesis","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198243,"name":"Festival Days Sim Date","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"In this town, there is a cultural festival starting in 30 days and that there are rumors that the festival will make one's relationship last forever. It is here that the players goal is set: find a boyfriend in 30 days. There are 12 endings.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ohg.jpg","releaseYear":2010,"developers":[{"id":0,"name":"Pacthesis","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198244,"name":"Football Manager","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"The first football management simulator, many of the hallmarks of the incredibly complex games which exist in this genre today are found in embryonic form here. Club finances, player transfers, basic tactics, and perhaps most importantly of all, excellent white noise crowd sounds when your team scored.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8isn.jpg","releaseYear":1984,"developers":[{"id":0,"name":"Addictive Games Ltd","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Commodore C64/128/MAX"},{"id":0,"name":"Amstrad CPC"},{"id":0,"name":"BBC Microcomputer System"}]},{"id":198245,"name":"Shadow of the Tomb Raider: Limited Steelbook Edition","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Experience Lara Croft's defining moment.\n\nAs Lara Croft races to save the world from a Maya apocalypse, she must become the Tomb Raider she is destined to be.\n\nBecome the Tomb Raider\n\nLimited Steelbook Edition includes;\n- Shadow of the Tomb Raider (the game)\n- A steelbook\n- Three art cards.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ohj.jpg","releaseYear":2018,"developers":[{"id":0,"name":"Square Enix","games":null},{"id":0,"name":"Crystal Dynamics","games":null},{"id":0,"name":"Eidos Montréal","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Xbox One"}]},{"id":198246,"name":"Grand Theft Auto 64","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Grand Theft Auto 64 is an unreleased port of Grand Theft Auto for the Nintendo 64 which was cancelled before being revealed to the public.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6w37.jpg","releaseYear":-1,"developers":[{"id":0,"name":"Rockstar Games","games":null},{"id":0,"name":"DMA Design","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":198247,"name":"Velone","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Velone is a creative automation game inspired by the classic Opus Magnum.\n\nOn the mysterious planet Velone, aliens have tasked you with saving their dying home. A collision with an asteroid has disrupted the entire energy supply. Now it is your job to build and program hydraulic mechanisms that create and place valuable Velone stones, restoring power to a civilization in peril.\n\nUse logical thinking to solve difficult mechanical puzzles and come up with new and creative ways to program the Velone stones and beat every level. Enjoy the endorphin rush when constructs execute your plan flawlessly and everything slots into place in one fluid series of motions.\n\nEach solved level rewards you with new information about the planet Velone, its climate, population, technology, society and more.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4ohy.jpg","releaseYear":2022,"developers":[{"id":0,"name":"ZAR 21","games":null},{"id":0,"name":"Daedalic Entertainment","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":198248,"name":"Sonic the Hedgehog","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sonic Runner is a playable ad by Jack in the Box made to promote Tiny Tacos and the 2020 Sonic the Hedgehog movie.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co52ot.jpg","releaseYear":2020,"developers":[{"id":0,"name":"Jack in the Box","games":null},{"id":0,"name":"TreSensa Technologies, Inc.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":198249,"name":"Koisuru Otome to Shugo no Tate Portable","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co997q.jpg","releaseYear":2010,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation Portable"}]},{"id":198250,"name":"Mario In Clock Town","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Mario In Clock Town is a Super Mario 64 ROM hack/mod which imports Clock Town from Majora's Mask to Super Mario 64, adding contextualized Power Stars, each one based on a Mask or item from Majora's Mask.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oi5.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Romcad_","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo 64"}]},{"id":198251,"name":"Sonic Heardle","genres":[{"id":0,"name":"Quiz/Trivia","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"This is a clone of Joywave Heardle (which in turn was modeled on Heardle and K-Pop Heardle) that is focused on Sonic the Hedgehog.\n\nEach Sonic Heardle is randomly chosen from one of several songs from the franchise - mostly the games with a few from adaptations (like the OVA or SatAM) thrown in as well.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co5s1y.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Turquoise Coast","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":198254,"name":"The Pigeon P","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The clicking adventure you and your friends need. Donate gifts to the incoming drivers with our here of the game The Pigeon P.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co4oik.jpg","releaseYear":2022,"developers":[{"id":0,"name":"Webnetic s. r. o.","games":null}],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]}]