[{"id":243760,"name":"Kits","genres":[],"avg_score":0.0,"description":"Kits is an assembly game. Discover, construct and admire beautiful little works of art. Set your own complexity and challenge levels and enjoy KITS the way you like to play.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6c0s.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243757,"name":"Bad Piggies Build","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Bad Piggies Build is a cancelled webgame meant to release in 2012 by Rovio Entertainment, however, this game was never mentioned or announced by the company and was left in mystery until a SWF download was found on the Appspot link.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6c0k.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":243756,"name":"Bad Piggies: Create Your Own Angry Birds Levels!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Bad Piggies: Create Your Own Angry Birds Levels! is a cancelled webgame meant to release in 2011 by Rovio Entertainment, the game was never mentioned or announced by the company and was left in mystery until a website was found in 2021, and its data was already deleted from the server thus it wouldn't load, but an earlier version of the game was found that actually worked, but you need to have Adobe Flash though for it to load.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6c0j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":243755,"name":"In-Flight Tennis Club","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6c0i.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243754,"name":"3D Football","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"A football game that comes as a part of the Emirates In-Flight Entertainment.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243753,"name":"3D Cricket","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"A cricket game that comes as a part of the Emirates In-Flight Entertainment.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243745,"name":"Farkle King","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"FarkleKing play online with unique features and exciting play modes is always full of strategy and highly confrontative that makes it more special than others – what you throw may not make you win but what you choose in a wise way will make you King.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243744,"name":"Faily Brakes 2","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Let’s start the race on a high speed in the car crashing game Faily Brakes 2! You have to stay behind the wheel as long as possible and not crash the car. Watch out the cars which will try to hit you! Smash 'em all, survive as long as possible on the road & win in the demolition derby. Get ready and take part in the race for survival!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243743,"name":"Century City","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Mine the fortune low underground and build the greatest city of the century.\nGo on an adventure with your cute little miner buddies. Tap to mine for gold, and watch as the money keeps piling up. Slowly build up your city with all kinds of different buildings from homes, schools, banks to parks and markets.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243742,"name":"Beat Bop: Pop Star Clicker","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"You've got an audience wherever you go, so gather your bandmates, upgrade your guitar and costumes, avoid media scandals, wear your best idol smile and put on the show of your life.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243741,"name":"Bull King of Circus","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"The new play-style 3D racing & action game that it is easy to control.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243740,"name":"Beach Mini Golf 2","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"This sports game is a new, high-quality, and easy-to-use 3d minigolf 3d game for your phone and tablet.\nPlay up to 60 levels golf course in a beautiful island.\nEach hole contains additional obstacles and complex angles. Aim well and make putts in a minimum shots !\nTry to stay below par on every hole to win 3 stars! Train yourself to become the master of mini golf club.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243739,"name":"Basket and Ball","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Tap the jump button to bounce the living ball as if you are dribbling it! Lead the stray ball into the basket passing acrobatic trials and solving puzzles. Test your throwing aim every 3 levels. Use the time stopping bonus to get out of difficult situations. Avoid robot cops and fire traps, jump over spikes, dive into water, and propel yourself with explosions on 120 challenging levels. iCade and MFI gamepads are fully supported!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243738,"name":"Baseball Battle","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Step up to the plate in Wil & Shelby's Baseball Battle and take on the world in classic pitcher-vs-batter duels. Hit and pitch with ease using intuitive multi-touch controls. Earn points to increase your power, accuracy and intuition with each victory. Featuring input from 2013 Rookie of the Year Wil Myers and St. Louis ace Shelby Miller, the battle for baseball supremacy is on!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243737,"name":"Air Hockey Halloween","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Air Hockey Halloween is a great air hockey game with halloween theme, beautiful graphics, great effects, easy to learn, hard to master gameplay, and it's free! Play against the gruesome, horrifying monsters with the fearless monster hunter in the game's campaign, and try to beat each enemy the best way you can to unlock new content, or play against your friend on the same device! 24 different monsters to beat on 4 levels.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243736,"name":"Jigsaw Tile","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"This is a very addictive innovation crush game, Unique gameplay will make you unconsciously indulge them forget the time. The game is very easy to get started, but it is very difficult to get a high score!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243735,"name":"Jumpox","genres":[],"avg_score":0.0,"description":"Follow Jumpox on its adventure to the new lands\nChallenge yourself with this simple, yet difficult game\nTap anywhere to jump up or down\nAvoid all deadly spikes","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243734,"name":"Kick and Cows","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Kick and Cows is a mixture of football and animal teams, top-down arcade game and logic challenges in all levels. In a nutshell, you have to score a goal in every of the 30 levels in each of the 7 worlds. Each and every one of the worlds has a unique design and new features making the game more challenging and compelling.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243733,"name":"Jack the Knight Adventures 2","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"An unprecedented touch reaches you: The Adventures of Jack Knight\nJack, this brave knight of whom all great heroes are inspired ...\nYou're the only one who can help Jack in this adventure !!!\nYou will help him to overcome Fear, loneliness, brave a thousand dangers to conquer the ultimate goal: Love !!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243732,"name":"Smartsquid","genres":[],"avg_score":0.0,"description":"Smartsquid - how fast is your brain?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243731,"name":"Grids","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Welcome to Grids!\nGrids is a tactical turnbased online strategy game where you take control of your very own army!\nThe objective of the game is to defeat your opponents commander-unit (the tower).\nYou can choose between connecting to our grids-servers, and get matched against an opponent, or you can host your own game and let your friends connect to you. Hosting a game requires port forwarding.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243730,"name":"Gyro Skate","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Gyro Skate turns your iPhone into a skateboard for your fingers.\nYou do a trick and Gyroskate knows what’s going on.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243729,"name":"Golden Manager","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243726,"name":"Sleepy Squares","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The goal is to help the Sleepy Squares get to sleep by placing them next to their fellow squares. The catch is they only close 1 eye for every square adjacent to them and they all have a different number of eyes.\nThat’s right, it has infinite potential if you are up for the challenge. Show off to your friends in our global sleepy leaderboards and see where your sleep IQ stacks up. Unlock multiple game modes and play them simultaneously with all your game data kept intact.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243725,"name":"Santa Draw Ride","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Santa Draw Ride is a physics based endless winter game which give you a Christmas mood! Santa rushes on his magic sleigh in search of lost Christmas gifts. Your task is to draw an icy road that will help Santa Claus to collect gifts and bonuses, as well as avoid dangerous traps and obstacles such as birds, snow islands, snowmans, x-mas trees etc.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243724,"name":"PayaPaya","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"PayaPaya is a drop-type puzzle game.\nThis is obtained score by connecting at least 4 of the same color coming from above the two blocks.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243723,"name":"Pam's Fantastic Escape","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Are you up for a cozy escape-room puzzle adventure...in a dream-like world? Let's go now!\nLinn (that's you!) is going camping with Pam (Pandora, your best buddy) and Tammy (Pam's sister) for the weekend. The game starts from Pam's garage, then moves on to a mountain cottage and more mysterious places.\nIn order to go on your adventure, you need to solve puzzles to find the way forward through multiple chapters!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243722,"name":"Out of Body","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Souls are on the loose! They need your help in guiding them higher and higher towards the heavens in this terrifically twisted and exciting endless adventure!\nBeing dead sure isn’t easy. These poor souls have to navigate tricky environments in order to spirit away. Help them evade obstacles (these souls don’t like bonking their heads on things any more than living people do!) and collect precious gems; use these gems to unlock new worlds and explore amazing new stories.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243721,"name":"Mini Boxing","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"You control \"Nick-Joe\" the Fighter so help him to win the Boxer championship tournament!\nBut you need to defeat six great-funny boxer to win the challenge.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243720,"name":"Magic Words: Craft Words","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Welcome to Magic Words, a new free game! This puzzle game will improve your vocabulary and spelling skills. Use letters and make words together with a young magician, try dozens of challenging and fun tasks.\nDon’t get confused if you can't find a word. There are lots of different hints that will help you - highlight a correct word, use magic letters or just refresh all of them.\nMake the application and input languages different to learn new foreign words, increase your vocabulary and practice your spelling skills.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243719,"name":"Universe 42","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Welcome to never-ending world of the Universe 42.\nUniverse 42 is a 2D endless runner game.\nYour mission is to collect resources to discover new planet that fits for life.\nUniverse 42 presents you with a infinite world to explore, filled with unique planets and lifeforms, and constant danger and action: asteroids, electric fields, dangerous obstacles.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243718,"name":"Twisted Machines","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Master the wasteland by killing off marauding freaks in their twisted machines. Unleash these monstrous racing machines to bash your way through the hazardous wasteland highway. Avoid endless riders from ramming into you to be victorious.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243717,"name":"Top Dungeon War","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Your are hero and mission is clear: defeat the monsters, claim the treasure, and save the hostages who have been taken captive by the evil forces that dwell within the dungeon. But this will not be an easy task. The monsters are relentless, and their numbers are vast. From hordes of slavering goblins to towering giants and deadly dragons, you will need all of your skills and abilities to overcome the obstacles that stand in your way.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243716,"name":"Super Boy Adventurous","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The year is 2999 and the galaxy is in chaos. Humanity has discovered alien technology allowing space travel between the planets, opening up the universe for exploration and conquest.\nWar happen from more alien attack on our planet.\nThe Super Boy Adventurous have a mission impossible. Must be destroy all the enemy, keep the earth for our child.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243715,"name":"Super Swish","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Shoot Hoops Like it's 1990!\nWith simple one-handed game play, Super Swish is a basketball game that's easy to pick up and play whenever you feel like shootin' some hoops!\nThere's no timer - it's just you vs. the hoop. The more swishes you make in a row, the more you score. The more you score, the harder it gets. Miss 3 shots and it's game over!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243714,"name":"Slide On Ice","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Do you like taking on the hardest games ever to constantly push your skills to the edge? If your answer is yes, then Slide On Ice is just the perfect game for you right now!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243713,"name":"Spangled","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Another brain twisting puzzle game from Unexpect3rd Development. Match 3 with a twist! Slide and drop pieces then match either colors or patterns. Survive long enough to score high or clear stage goals.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243712,"name":"Whacky Ball","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"In Whacky Ball, your device's camera transports you into a world of challenging ball games. Using motion recognition, you whack the balls virtually on the screen using your hands or head as if you are really there.\nWhack the birds and other flying objects before they whack into your ball. Score three times in a row to win bonus points.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243711,"name":"Wizard Golf RPG","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This is the story of an adventuring hero who doesn't mind being below par. As a powerful wizard, you'll make your way through each floor of a treacherous dungeon, one hole at a time. Instead of using a ball and clubs, you'll propel yourself through each carefully constructed corridor. The hazards on these courses are a bit more hazardous than usual. Don't worry: you've got a spell or two you can use against the monsters that lurk in the roughs.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243710,"name":"Yum! Finger","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"\"Yum finger\" is a leisure exciting game, players in the game's role is a little fat man is trying to lose weight, you need to finger on the screen, moving through crazy escape cake, ham, green beans, donuts, bananas, etc., which are small monster, once they touch, the fat man will explode! But don't worry, food monsters will be according to their own favorite fixed track running, so as long as your response fast enough, or after a few sessions, just to avoid them well!\nSet in the game, there are props, novice players can through use of them to put into this crazy game as soon as possible and then got gold and the great achievement badges. Do not hesitate to begin the fun and exciting trip to burn calories glory!!!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243709,"name":"Push-Up T-Rex","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"This is the story of Felix the T-Rex.\nSince he hatched from the egg, he has dreamed of being the first T-Rex doing Push-Ups.\nTogether you’ll discover the coolest cities of Planet Earth.\nThe more weights you collect on your journey, the longer the tiny little T-Rex arms will grow.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243708,"name":"Milk Farm Tycoon","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243707,"name":"KleptoCats Cartoon Network","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243706,"name":"Iron Force 2","genres":[{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243705,"name":"Ice Scream United: Multiplayer","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243704,"name":"Avatars Saga","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243699,"name":"SimbaQuest","genres":[],"avg_score":0.0,"description":"A short, April Fools adventure with dozen of interactions.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243698,"name":"Perfect Fit","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Casual drop box fit in the gap game","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243697,"name":"Crank! Push! Tilt!","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"An arcade-style dexterity game for the Playdate","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243680,"name":"Bold","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Bold is a unique, quiet and elegant third person exploration game, as well as a Zen game for traveling, walking, watching picturesque landscapes. The protagonist of the game, deer (bold), finds deer herds and obtains inner peace by crossing grasslands, deep forests, wilderness, rivers, and lakes.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6byn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243679,"name":"RushLane","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Welcome to RushLane, an adrenaline-pumping, high-speed racing game set on the scenic forest roads! Take control of your car and navigate through the twists and turns while avoiding oncoming traffic and collecting points to unlock new vehicles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bym.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243669,"name":"The Legend of Zelda: A Link to the Dream","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Legend of Zelda: A Link to the Dream is a fanmade remake of the Game Boy cult classic The Legend of Zelda: Link’s Awakening, first published in 1993 and enhanced with colors in 1998 with its DX version.\n\nThe Solarus-made remake uses A Link to the Past graphics, extended with lots of custom sprites and tiles, in order to represent all the game’s characters, enemies and landscapes. Even the music has been remade in SNES-like fashion, to get the perfect feeling as if the game was released on Super Nintendo.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6byd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"},{"id":0,"name":"Linux"}]},{"id":243646,"name":"The Delusions of Maximillian Wurst","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"The first chapter of a loop-de-loop platformer in which you control Maximillian Wurst, silver-tongued poet and abject moron, as he pursues a fantasy that wants nothing to do with him. Escape Father Time! Shoot as many Chadwicks as you can! Stumble along with poison coursing through your lily liver!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bxc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243640,"name":"Tappy Lap","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Fantastic one-finger Stock Car Racing!\nJust \"Tap\" to change steering direction. Hold the screen to straighten up, speed match the car in front, or just brake. It's brilliantly context sensitive.\nGet bonus points by Drafting other cars using the slipstream, blocking faster cars for a speed boost, or racing clean laps.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243639,"name":"Pixel Puzzles","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Bring the bigger picture into focus with Pixel Puzzles, a relaxing new grid-based puzzler. Uncover the hidden images as you swipe to connect number and color-based pixel patterns, revealing the image beneath. With smooth mechanics and stunning photography in themes from abstract to nature to outer space, Pixel Puzzles is equally as challenging as it is calming.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243638,"name":"Match Pair 3D Puzzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Match Pair 3D Puzzle is a game to find matching pairs.\nIt's simple and fun, but it's not easy because each item moves.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243637,"name":"Factor Find","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Inspired by the classic Word Search and Sudoku games, Factor Find is a puzzle game about math! The rules are simple: solve puzzles by making target numbers with factors on the board. For example, make 12 from 4*3 or 2*6.\nFactor Find is more strategic than it initially appears. With the right strategy, it's possible to solve even the most complicated puzzles without doing complicated math! Calculators might be better than people at simple arithmetic, but they could never solve a Factor Find puzzle!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243636,"name":"This Is Not a Ball Game.","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"This Is Not A Ball Game includes more than 90 challenging levels with Retina-quality graphics and a mysterious French genie as your guide. Swipe and tap the screen to launch balls into the arena to free Star Blocks, and bring the magic back to the Absurd Circus!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243635,"name":"Slidey Feet","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The objective is to step on each icy block in the level, cracking it underneath you.\nOnce all the blocks are cracked, this will break away the small cluster of rocks blocking your exit.\nBut, if you step back on a cracked block, you will fall off and will have to start again... From the start! So pay close attention to where you step!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243634,"name":"Solitaire","genres":[],"avg_score":0.0,"description":"Solitaire is a new experience of Solitaire Game. Play Solitaire to wake up your brain in the morning or to clear your mind before going to bed.\nSolitaire has so many beautiful card's styles you can change and discover. You can touch or drag the cards to complete the game the way you feel most comfortable. Solitaire is concerned about the comfort of your experience. Solitaire has many card's styles and background's styles you can explore will make you feel excited and surprised.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"iOS"}]},{"id":243633,"name":"Peck Peck's Garden","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Throw seeds to feed Peck Peck and watch the magic.\nFind the secret way to grow flowers to harvest more seeds.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243627,"name":"Cute Girls","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Enjoy cute women! The adult puzzle game 'Cute Girls' contains many beautiful illustrations. The in-game illustrations are made up of beautiful colors and details, and you can enjoy a variety of characters.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bw3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243626,"name":"WakaVR","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Welcome to the VR game experience that combines the fast-paced action of Beat Saber and the classic arcade-style gameplay of Pac-Man. In this game, you'll step into a neon-infused world, ready to carve your path through each level.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bw1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243624,"name":"FromWithin","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"A top down ole school shooter with great graphics","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243612,"name":"White Wolf: Treasure Hunter","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Action-Adventure & Strategy saving your world from Dark world that you unleashed. Quest though 5 element temples, collect items, and throw items. Unlock the hidden treasure shadow card castle.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bv2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243606,"name":"Back to the Dark","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Singleplayer medieval-fantasy extraction looter with melee combat and the occasional arrow and spell. Demo available!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bup.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243605,"name":"Beat Bricks","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This game is very interesting, using the rebound principle of objects to play the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6buo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243602,"name":"A Night With Neil","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"\"A Night With Neil\" is the first in, hopefully, a series of choose-your-own-adventure text games done in Twine focusing on my various characters. Hang out with Neil! Get banged by Neil! Get ate by Neil!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bul.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243601,"name":"Archery Battle VR","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Archery Battle VR is a virtual reality archery game that allows you to experience real archery movements in the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6buj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243599,"name":"Alongside","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Tower defense strategy in a hand-drawn atmospheric style. The action of which takes place in a fairy-tale world inhabited by animals. To survive, you will need to tactically consider the placement of units, control the hero, using his abilities to fight off the invading hordes of evil.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6buh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243598,"name":"Abandoned World","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Third-person action survival game set in a post-apocalyptic world. After the big disaster you will face bad things","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bui.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243595,"name":"Bots Chaos","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Can you finish this game in 10 minutes? Bots Chaos is an action FPS game where you must destroy many robots to beat a score in 10 minutes. You will never get bored in this casual, hard and fast paced semi procedural game full of annoying robots, lasers and chaos.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bue.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243594,"name":"Blazing Ace","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"“I want to be stronger…” Summer bootcamp has begun!!! Let's make your dream come true!Beast Fella Foundation (BFF), an organization which monitors martial arts competitions among beastmen, has sent you an invitation letter. An unforgettable summer memory ensues.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bud.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243590,"name":"Bushido: Drift and Race","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Bushido is a racing game for all fans of Japanese automotive culture.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6buc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243589,"name":"Bye Bye Swingby","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"'Bye Bye Swingby' is a fresh and unique simulation game that tells a sad story of escaping a destroyed Earth and exploring a new world. Take a rocket into space and use the gravity of the stars to travel to new worlds in Swingby.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bu9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243588,"name":"Celestial Raider","genres":[],"avg_score":0.0,"description":"Celestial Raider is an exciting and fun sci-fi vertical shoot'em up game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bu7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243587,"name":"Casino Heist","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Casino Heist is a Romantic Comedy Heist Visual Novel and Dating Sim where you play as ex-Formula One driver Enrique Roca as he charms his way around the Las Vegas Strip to help his crew get away with the Heist of the Century.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bu6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243586,"name":"Car","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Demonstrate your strong control ability in the game, allowing players to release their pressure through the game, and the wide track allows you to freely play driving.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bu5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243582,"name":"Dark Dead","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Dark Dead is a hardcore 2D action-platformer in which you have to fight an ancient evil and try to understand how and why you ended up in this place.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bu1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243581,"name":"Crystal Blast","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Crystal Blast is a single-player action-adventure game that offers a visually mysterious VR experience, created with Unreal Engine 5. Our goal is to survive in this mysterious cave and witness the remnants of past events while progressing towards the exit.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bty.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243576,"name":"Don't Rage","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Will you make it to the end of parkour? Be careful, if you fall, you start over!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243574,"name":"Einheriar","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"\"Einheriar\" is a tower defense game that aims to prevent monster invasions. You must summon potential and talented warriors from the world to protect this land!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243573,"name":"Endless Pinball","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Welcome to the world of Endless Pinball, the addictive mobile game where you can challenge your skills and see how far you can go!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243570,"name":"Fangun","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"This is Parkour.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243569,"name":"FAS: Fight Action Sandbox","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Unique turn-based sandbox 3D fighting game. Create your own character, fight AI or duel with friends online! Inspired by YOMI Hustle, TORIBASH and SPORE.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243568,"name":"Fluxion","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Fluxion is a thrilling 3D action platformer where you control a spaceship racing through a twisting tunnel, collecting energy orbs and avoiding obstacles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243567,"name":"Form Fitting","genres":[],"avg_score":0.0,"description":"Form Fitting is a casual puzzle game where players must pick up different shaped blocks and drag them into the corresponding empty slots.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243565,"name":"Getting to the Other Side!!!","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A modern spin on the classic arcade game. Play the only game that allows the player to run around as a crazy chicken! Complete each level and try to reach the end if you dare!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243563,"name":"Furies & Magazines: Episode 1","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Graphic Novel Style Top Down Shooting Action Game which tells the story of Ivan Vinogradov, the victim of the CIA's top-secret project.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6btg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243556,"name":"Hot Ice","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Welcome to Hot Ice! First person mode gives you a full sense of presense, realistic physical puck and only a short moment to escape the colision! You can invite friends, build a team and play online, or try your luck and play alone offline with an AI partner against exstra smart AI guys.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bt9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243550,"name":"Hell of Verdun","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Hell of Verdun is a first person horror game in which you'll experience the horrors of the First World War. Will you manage to discover all the secrets and escape from this hell? It's up to you, soldier.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bt3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243549,"name":"Heck City Delivery","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Heck City Delivery is an arcade driving game inspired by Crazy Taxi. You play as a delivery goblin in the post-apocalypse, delivering food in your blood-powered car to the demons who inhabit Heck City, 20XX. Make your deliveries quickly and earn enough money to pay your rent!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7hd9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243545,"name":"Lovelorn Sanatorium Ⅳ","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This is a spoof plot puzzle game. Click the dialogue to advance the plot. There are many puzzle-solving levels in the game. You can find props by exploring and solve puzzles according to the game prompts.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bsy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243540,"name":"Inziva","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"A visual novel about you. Yes, you. \"inziva\" examines talking with your alter egos about your depression and traumas.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bsq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243533,"name":"Peace Is Your Destiny","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Peace is Your Destiny is a relaxing trip across an everlasting and colorful ocean. Clear islands by rolling your cube to match colored tiles. You will uncover surprises along the way towards a calmer and chill mindset. Its will Remove your anxiety and you will enter the world of Peace.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bsn.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243527,"name":"Nimblefoot","genres":[],"avg_score":0.0,"description":"Nimblefoot is an action-packed parkour game where players must outrun and outsmart primitive hunters in pursuit. In Nimblefoot, you'll need to use all your skills to avoid obstacles and fend off monsters lurking in the forest.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bsi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243526,"name":"One Soul","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Explore dark dungeons. Wield your sword to attack enemies. Raise your shield to block attacks. Find keys to unlock doors. What will you discover?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bsg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243524,"name":"Merging Cubes","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Unique puzzle game absolutely addictive gameplay. Puzzles with thousands pieces! Hardcore challenges and infinite fun!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bsd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243520,"name":"Sex Tonight","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sex Tonight - is the simplest 2D puzzle that you will remember with its hot images.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bs9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243517,"name":"Role Model AI","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Rolemodel.AI is a platform for creating personalized AI avatars that enhance personal growth and productivity. Customizable avatars can be experts in various fields, including game development and nutrition. The platform uses cutting-edge technology to revolutionize our interaction with technology.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bs7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243515,"name":"Rise of the High Elf King: A Legacy of Blood","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Take on the role of our protagonist in his epic rise to power to become High Elf King in this 2D side scroller set in a world of magic and fantasy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bs6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243512,"name":"Plasma Drone","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"\"Plasma Drone\" is a dynamic action game where you must fight to survive against waves of enemies. By upgrading your drone and weapons, you can effectively eliminate the enemy forces. The game offers 20 levels and a survival mode, which requires speed, precision, and strategy to survive.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bs2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243511,"name":"Puzzle Panic Island","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Puzzle Panic Island is a fast paced, skill-based match 3 Puzzle Platformer. You Control a character who must survive the Puzzle Blocks falling on their head and then Match them up, while also avoiding the Hazards they carry within! (Mostly Dinosaurs.)","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bs1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243510,"name":"QChat","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Welcome to the mainland of Zelasda, where you can play the role of a survivor or use various props to evade the pursuit of regulators, crack the cipher machine, and escape from the manor to win!!!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bs0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243509,"name":"Superior Crack Relatives","genres":[],"avg_score":0.0,"description":"Superior Crack Relatives is a meme, couch-based multiplayer fighting game. Choose from a variety of balls and battle it out with up to 4 players in online multiplayer. Enjoy a variety of maps and characters, as you battle it out to be the ultimate champion.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6brz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243508,"name":"Swipe Tennis","genres":[],"avg_score":0.0,"description":"Swipe Tennis is an immersive sports game that offers players an opportunity to test their mouse skills by becoming a tennis champion","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bry.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243507,"name":"Sword Hero","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"An immersive fantasy survival game A thrilling adventure A powerful flying sword A bunch of skills with different functions Kill all evil","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6brx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243503,"name":"Somnus","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Somnus is an action-packed dungeon crawler game where players embark on a perilous journey to defeat an ancient evil that poisons life underground. With cool pixel art and challenging gameplay, Somnus is an exciting adventure for gamers.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6brs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243501,"name":"Starryard","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Welcome to Starryard, an adrenaline-packed space flight shooter. In this game, you will play the role of a pilot of a spaceship, maneuvering the spaceship to shuttle between the stars, and at the same time need to defeat the enemy in fierce battles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6brr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243500,"name":"Story of Animal Sprite","genres":[],"avg_score":0.0,"description":"Story of Animal Sprite is a casual merge game where you will restore the homeland for cute animals by building various fancy structures.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6brq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243498,"name":"Shh! This is a mystery game! But watch out for spoilers","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Reasoning... It's annoying.... I want to go home and play with Sara...❤ So please help me......","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6brp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243491,"name":"Tribal Legends","genres":[],"avg_score":0.0,"description":"Welcome to Tribal Legends, an epic 2D cartoon-style shooter in which you play as a young tribal archer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6brh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243489,"name":"Things to Get","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"In this game, the user must pick up objects that will help him and solve the puzzles and finish the tasks. With each finished task the user will go to the next level. The user must look for objects that will help him solve the puzzles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bre.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243478,"name":"Vehicle Beat Zombie","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Zombie incoming,fortunately,we got plenty of vehicle to use,armed with multiple weapons,avoid attacked by zombie by driving vehicles,open landscape give you advantage to take vantage point,use weapons to hit them,grenades ,firegrenade are handy,you can upgrade weapons to gain more chance to win.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6br6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243475,"name":"Terminal Velocity","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Terminal Velocity is an escape flight game. The pace of the game is very tight. The player's goal is to survive as much as possible.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6br3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243473,"name":"Witch Race","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"\"Witch Race\" is a lightweight Rogue Auto Chess game, which tells the dark era of the Fantasy World Isefa continent. Strategic formation of army, unlock heroes, make good use of arms and powerful combination skills. Witness the final fate of Witch Race and understand the truth behind the story.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6br1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243472,"name":"Vanishing Shadow","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Game contentPlay as 12 characters, switch between each other in place, and experience a high degree of freedom of gameplay. Ride horses and bicycles, drive sports cars and helicopters to stay up late in beautiful nature.[","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bqz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243458,"name":"Joy and Me","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Joy and me is a horror video game saga with events based on real events. Each chapter of the saga has things based on real events, both personal and paranormal problems, this saga has been developing for 7 years, and is practically almost ready for its premiere.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7kfm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243444,"name":"Shogi!","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Sport","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Shogi! Experience the ultimate 3D Shogi video game! Featuring stunning graphics, and a cutting-edge AI that brings the Japanese chess game to life like never before. Master the art of Shogi, a chess-like tabletop experience, and become a true champion of the popular strategic game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7m4d.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243437,"name":"Terrordactyl Carnivore","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Terrordactyl Carnivore is a thrilling dinosaur action adventure game! Fly your pterodactyl through a treacherous ravine to rescue lost cars from a prehistoric time-warp.\n\nDefeat all pterodactyls by landing on top of them to advance to the next level. Munch all orbs before they turn into pterodactyls. Use the arrow keys to control your pterodactyl: up - gain altitude, left and right - forward and back. Use the space bar to breathe fire. Collect power ups to enhance your pterodactyl's flight (extra life, force field, super speed, destroy all, anti-gravity).","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bpg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":243402,"name":"Scrapped","genres":[],"avg_score":0.0,"description":"Get scrap, charge beacons and build unlockable robo-friends to survive!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bla.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243401,"name":"Halo: Combat Devolved","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Bungie's iconic first-person shooter, Halo: Combat Evolved, made its debut on the original Xbox in 2001, quickly redefining the shooter genre and what a multiplayer experience meant. Now, over two decades later, a passionate fan is undertaking a monumental project that is sure to excite any Halo fan.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co754j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"}]},{"id":243399,"name":"A Day At the Track","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A horse racing simulator where you bet your players money on the horse to win the race. If your horse wins you get paid. Run the other bots or joined twitch users out of money to be named the victor of the track.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6drf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243397,"name":"Home Game 3","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This adventure-RPG features a bleak world full of secrets within secrets, hectic real-time combat and a custom inventory system of curious items and combinations.\n\nIt is about the hermit living with girl.\n\nExist at home or traverse dangerous realms, seeking Truths and age...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7e9s.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243395,"name":"Metawork: Hotel Simulator","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Metawork - Hotel Simulator: addictive game to build and manage your own hotel. Customize rooms and offer services to satisfy customers. Test business skills, attract customers, and respond to needs. Realistic graphics and gameplay mechanics. Unlock new features and watch hotel grow. Try now!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bkw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243383,"name":"Ultimate Blackball","genres":[],"avg_score":0.0,"description":"Ultimate Blackball is a simple addicting hyper-casual game that anyone can play.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bjz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243373,"name":"Bullet Blaze","genres":[],"avg_score":0.0,"description":"In Bullet Blaze, players take on the role of a heroic warrior with multiple bullet types, traversing obstacles and enemies, protecting peace and saving the world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bjk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243372,"name":"SoulJah Kingdom Rise","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"SoulJah Kingdom Rise is the first look at an upcoming 3rd Person shooter Action-Adventure franchise. Set in Jamaica in the year 2093, play as Akan and experience the first look at the world of SKR. Complete objectives, find secrets and clean the streets.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bjj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243340,"name":"The Big Pond","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sail a small boat around in the pond","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243333,"name":"SoleSurvivor","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"SoleSurvivor is an open-world cooperative sandbox game for single and multiplayer. Players will experience the zombie apocalypse, they will have to deal with it to survive amid difficulties such as saving hostages, searching for resources, water and food, wild animals, survivors with weapons","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bj2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243331,"name":"Fall Guys: Neon Nightlife Pack","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Turn up the neon and jack into cyberspace with these electrifying party punks!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bj0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Nintendo Switch"}]},{"id":243326,"name":"Star Chaser","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Have loads of fun chasing stars and a new high score, all while helping Make-A-Wish UK grant out-of-this-world life-changing wishes for children who need them.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bit.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243323,"name":"Sudoku Master: Classic Sudoku","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"Classic sudoku - game for your brain! Improve your logical thinking.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6biq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243318,"name":"Images Quiz","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Scratch away as little as possible to unearth the image beneath!\nTest your brain, eyes, and fingers with this new and exciting picture quiz! A picture is hidden here . . . but a picture of what? Tap your screen to “scratch” away part of the covering, but be careful—you only have a limited number of scratches! Can you guess what the image is before running out?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243317,"name":"Woven Words","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The Woven Words puzzle grids come in all different shapes and sizes, and when you’re done every row and every column will spell out complete words! Each game board is a mix of letters and blank tiles.\nCan you find the right letters for the blank tiles so that every line spells a word both down and across?\nThe free app includes 6 basic puzzles so you can get your feet wet – and then 12 more challenging puzzles to test your skills. In addition, over five hundred more puzzles are available for purchase.\nWe’ve worked hard to make Woven Words fully accessible with VoiceOver.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243316,"name":"Downwordly","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Downwordly is a word building game that challenges you to make the most out of the letters you have. Not all letters you see are playable! Use your intellect to find the best word you can make while also planning for the future.\nPlay against your GameCenter friends in turn-based multiplayer!\nPlay solo with an endless stack of letters!\nTry searching for words in Puzzle mode!\nWork your way through a new set of 5 layers of tiles every day in the Daily Challenge!\nSee how you stack up against your friends and the world on the leaderboards.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243315,"name":"Slide to Spell","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Slide lines or columns of letters to form words spelled\neither vertically or horizontally. You want to get the longest words possible.\nThe game has three modes: hard mode is a nightmare and in easy the game almost plays itself. Quite fascinating to watch, really.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243314,"name":"4x4 Offroader","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"4x4 Offroader is a challenging 2D offroad racing game. The game contains 18 levels of increasing difficulty. Get the car from the start point to the finish line as fast as possible using the forward and back buttons in combination with the two rotate buttons. Sometimes objects must be moved along the way.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243313,"name":"Touchgrind Scooter","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Let us present the wildest Touchgrind game so far, Touchgrind Scooter, brought to you by the creators of Touchgrind BMX 2 and Touchgrind Skate 2. We took the core of the Touchgrind brand, listened closely to our players suggestions and feedback and created the most advanced and stunning Touchgrind game yet.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243312,"name":"Drag Boat Speed Racing","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Build your engine the way you want to! Drag Boat Speed Racing features 100's of different part types resulting in unlimited combinations of ways to make your boat faster!\nDrive your boat the way you want to! Weather, wind direction, and chop will affect how straight your hull flies.\nRace against opponents across the USA in over 20+ unique locations! Compete for prizes and trophies to claim the title of \"World Champion\"","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243311,"name":"Solitaire 21 Card Sort","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Welcome to Solitaire 21 Card Sort, an offline game that requires no ads and collects no data.\nThe objective of the game is to sort cards and sum up the score to 21 in each round to clear the board. But watch out for the timer and lives - a wrong move costs a life! Make strategic moves to clear levels and unlock new cards, floors, and tables.\nFeatures of Solitaire 21 Card Sort include a simple tap mechanism, a tutorial page to learn the rules of the game, earning game coins each round, hourly game coin rewards, an endless game mode, and a game score board.\nTo play Solitaire 21 Card Sort, simply sort the cards and add them up to 21. The game comes with a tutorial page - tap the ? to learn the rules of the game.\nGet started with Solitaire 21 Card Sort today, a classic card game with a twist!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243310,"name":"Tap Quiz","genres":[],"avg_score":0.0,"description":"Play Tap Quiz to test your knowledge, practice spelling and word finding skills.\nTap Quiz combines several word game genres and it can be played alone or with a room full of people.\nType answers using letters on the screen. Share the fun by asking family members and friends for help with the answers or the spelling.\nAs game progresses, questions gradually become more difficult. Please note that all letters on the screen including spaces and punctuation must be used to successfully complete each level.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243309,"name":"Digit God","genres":[],"avg_score":0.0,"description":"How fast is your brain? How quick are your fingers? Digit God will tell you.\nDigit God is a digit-oriented game designed for your i-Devices. Do math at anytime and anywhere!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243308,"name":"Color Mumble","genres":[],"avg_score":0.0,"description":"Color Mumble is an Puzzle word game that keeps your brain sizzling.\nYour objective:\nunscramble as many five-letter words as you can with out running out of time. With two game modality, you will be entertained for hours. In Endless mode, you get 20 seconds to unscramble each word. In Time mode, solve as many words as you can in 3 minutes.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243307,"name":"Slime Labs 3","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Slime is marooned on planet Freezia and needs your help! Explore a frozen lab with slippery ice and new dangerous traps. Slime Labs 3 is a physics based platformer where you control a blob of green ooze that can squish, stretch, shrink, and get frozen. Perfect all the levels while collecting all the lost data disks.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243306,"name":"Kabama","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Kabama is a turn-based board game for one or two players.\nIn Kabama, Players take turns to move, either by placing a counter of their own colour next to one of their existing counters, or by sliding any column or row of the board by exactly one square (touch and slide to do this).\nIf a player forms a 2x2 square of his / her own colour, those pieces are removed. The winner is the first player to remove all of their pieces from the board.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243305,"name":"World War Z: Aftermath - Deadly Vice Weapon Skins","genres":[],"avg_score":0.0,"description":"Light up the zombie-filled streets with the Deadly Vice Weapon Skins Pack, featuring 4 premium neon skins, one for each weapon.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bid.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243304,"name":"The Cycle: Frontier - Howler Tamer Bundle","genres":[],"avg_score":0.0,"description":"Let the competition know who's really the planet's apex predator with this Howler themed vanity pack. Each is precious, each is deadly.. Plus, a bonus of 1000 Aurum","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bib.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243303,"name":"The Cycle: Frontier - Vivid Party Style Pack","genres":[],"avg_score":0.0,"description":"An exciting bundle of Vivid weapons and 'goldies' charms to bring your color and style down upon those dare to cross your path on Fortuna III. Plus, a bonus of 1000 Aurum!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bic.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243301,"name":"Fortune Follow: The Mansion","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"An exciting game that will take you through an atmosphere of terror and suspense as you solve challenging puzzles to advance through different rooms.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bi9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243300,"name":"The Cycle: Frontier - Authority Peacekeeper Pack","genres":[],"avg_score":0.0,"description":"A fresh prospector with its various color versions to fit any taste. Suit up with your squad mates to show who's got style. Get your special Operative gear, equip your melee and hop on your drop pods. Plus, a bonus of 1000 Aurum","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bi7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243299,"name":"My Demon Wife","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Beautiful woman became evil, powerful and immortal. She captured you, and made you her husband and slave. You land in a creepy castle with mummies and other monsters running around.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bi3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243298,"name":"World War Z: Aftermath - Rat Packs Weapon Skins","genres":[],"avg_score":0.0,"description":"Show those rat hordes that you fear no enemy with the Rat Packs Weapon Skins Bundle, featuring 4 premium rodent-themed skins, one for each weapon.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bi0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243297,"name":"Lab Sorters","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bi1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243292,"name":"Cities: Skylines - World Tour Bundle 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bho.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243284,"name":"Density Limit","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Welcome to the Unspace. Not gonna lie, it’s a little scary there, but it’s very attractive for scientists and kind of mysterious as well. But what is the limit of this space? What happened here and why does it even exist? Your mission will be to solve this case.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bh2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243281,"name":"Doc McStuffins: School of Madicine","genres":[],"avg_score":0.0,"description":"Doc McStuffins and her toy friends need help decorating the backyard in Create & Explore with Doc for VTech’s InnoTab systems. Play games that let you decorate banners, create costumes and make clay models of favorite characters. You can also play different instruments in a band with Doc’s friends. Along the way help Doc bring sick toys back to perfect health step-by-step. Open Doc’s Big Book of Boo-Boos to see each toy’s diagnosis and accompanying health tip. Then read the e-Book to learn what happens to Robot Ray when Hallie and Stuffy try to fill in for Doc in Diagnosis Not Even Close-is.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bgu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243280,"name":"Doc McStuffins","genres":[],"avg_score":0.0,"description":"Doc McStuffins and her friends are ready to open their clinic. Help them by playing card games, check-up and letter games that teach spelling, matching and memory skills in Mission Mode to unlock activities in Free Play Mode. Here, you can read \"The Rip Heard 'Round the World\" e-book, check out Doc's \"Health Tips,\" take photos or become the \"Prima Ballerina\" as you earn awards. Doc and her stuffed pals are ready to play. Join them in their quest for fun and get your monthly check-up today.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bgt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243279,"name":"Mr. Men & Little Miss: Adventures in Dillydale","genres":[],"avg_score":0.0,"description":"The Mister Men, Little Miss Adventures for V Tech's MobiGo Touch Learning System utilise kid's favourite play patterns and infuse them with learning curriculum. Dance to the rhythms of DJ Mr. Messy, help Mr. Bump show off his dancing skills in the Pogo Stick Polka, or help Little Miss Sunshine get out of trouble by learning letters, numbers, colours and more and all with the touch of a finger.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bgs.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243273,"name":"Anvil Empires","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Anvil is a massively multiplayer game where thousands of players work together to build empires, wage war, and conquer in a persistent online world. March alongside armies of players in massive melee battles and large scale sieges.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bgy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243272,"name":"Mr. Men & Little Miss: Mr. Messy and the Missing Sock","genres":[],"avg_score":0.0,"description":"Help solve the case of Mr. Messy's missing sock as well as learn sounds, syllables, rhyming and more!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bgi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243271,"name":"Shrek Forever After","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6r9f.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243270,"name":"Madagascar 3: Europe's Most Wanted","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bgf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243269,"name":"The Legend of Zelda: Mercuris' Chest","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In this independent fangame from the Solarus Team, Link is brought to a mysterious kingdom where his help is needed to fight a giant bird who tries to steal a dangerous chest. Who is that mysterious bird warrior? Why does this place seem so familiar, but also so different? Enjoy a whole new journey in a huge kingdom full of mysteries, travelling and side quests.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bgh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Mac"}]},{"id":243239,"name":"Pixxelverse Online","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Pixxelverse Online is a game that blurs the line between a social platform (MMOSP) and a roleplaying game (MMORPG). It is a place for people to socialize, build together, talk to each other, share video, and communicate in real-time. You and your friends can join together and go on adventures on a map that changes each year. By playing the game and exploring the world the users can obtain new cosmetics, furniture and weapons to enhance their characters and offer them a unique experience with a unique avatar customized by you.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6m4n.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243233,"name":"Train Sim World 3: Loco Add-On Bundle 2","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6be4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243229,"name":"Stellar Interface: Stellar Spacecrafts","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Extend your gameplay with five new spacecrafts!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bdy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243227,"name":"Gravewood High: Complete","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Enjoy the complete version of the game including single-player and all future content. Gain access to new levels, puzzles, Teacher transformations, and player powers as they are released! This DLC also includes a digital art book located in the game's folder.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bdw.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243226,"name":"Gravewood High: Chapter 1","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The first chapter of Gravewood High's single-player campaign. Several students have gone missing at Gravewood High. Together with your friend Erin, you have to confront the cunning Teacher and figure out what is behind the madness of Gravewood High.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bdv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243217,"name":"Imperion","genres":[{"id":0,"name":"Real Time Strategy (RTS)","games":null}],"avg_score":0.0,"description":"Space MMORTS from the makers of Travian.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bcr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":243211,"name":"Aztecs: The Last Sun","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Aztecs The Last Sun is a simulator of building a city set between the 13th and 16th century CE. The player takes on the role of the ruler responsible for building and bringing to splendor the magnificent Tenochtitlan city-state. This amazing architectural wonder was historically located on an island in the middle of Lake Texcoco. This in itself will represent a technological and economic challenge for the player, who will have to provide food for his people and to maintain a permanent trade connection with the outside world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6bac.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243178,"name":"Atom Antics","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Professor Twiddie's Atom Antics is addictive, entertaining and fun puzzle game. It's the ultimate brain challenge for you. Proof that you are genius. Help Professor Twiddie. Touch and slide the atoms around the playfield to match the pattern shown on the small image.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243177,"name":"Fat Cat & Airship","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"A fat cat wish to take an adventure to jump from one airship to another, but he need to try his best to jump into the center of the airship. It is easy when the airship has a low speed, but when airship run quickly, things will changed.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243176,"name":"Parallel Room Escape","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Explore the new brain challenge puzzle & try to escape from this unknown spot.\nWe are introducing another interesting adventure mystery room escape game, so get ready for this new parallel room escape game 2020 and enjoy this interesting challenge from beginning to end.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243175,"name":"Pixel Pro Winter Sports","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Pixel Pro Winter Sports is an incredibly addictive pixel-art makeover of your favourite wintertime sports.\nCarve down the slopes in Downhill skiing, nip over to the Bobsled track for a hair-raising run, or aim for Olympic gold in the Slalom or Ski Jump.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243174,"name":"Pingpon","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Pingpon is a modern take on the classic Ping-Pong game. It takes place in a huge spherical 3D arena. Your main objective is to score goals by hitting the ball towards your opponent's side of the arena, and waiting for it to explode, as it touches the edge of the arena. It may sound easy, but you also have to outwit your AI-controlled opponent which is trained to block your attempts to score goals. Meanwhile, you also need to block your opponent's attempts to score goals.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243173,"name":"Outer Space","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Come with us on an intergalactic journey!\nLet's explore the fantastic intergalactic world of outer space!\nPerfect for toddlers and little kids because there is no language knowledge needed to play this game!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243172,"name":"Mad BalloonRider","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"The player controls the balloon character in the game. there are black blocks, disposable items, and pink Bouncing things\nthat the Balloon must avoid or use to their advantage. Fill the bounce gauge to activate Fever mode and rocket your balloon to the sky. Whatever happens, You have to move up to the finish line.\nIf you do not have enough fuel on your way, do not forget to gather fuel items! It's that simple!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243171,"name":"Kidblock","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Craft it, build it, blow it up. Share your creations online, or download thousands of words on the KB Community. Record your gameplay, include your face cam and upload to YouTube or Everyplay. Skin your character with custom skins and challenge your friends to a deathmatch with destructive rockets, lasers and swords.\nKidblock is: Building, exploring, world sharing, multiplayer, custom skins, mobs, rocket launchers, lasers, TNT, swords, crafting, mining, farming, protecting, gameplay recording and much more!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243170,"name":"Spot Venture","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"It's a creative find differences game, full of eyeful puzzles and fun-filled challenges.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243169,"name":"Tiny Legends: Saving Princess","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Another masterpiece game of Joy Joy Studio has finally arrived.\nThis is a decryption + puzzle game, the picture clear, simple operation, the best casual games in your spare time.\nFit with friends or family together to solve the puzzle.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243168,"name":"WordWarrior","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243165,"name":"Away to the Stars","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"A procedurally generated twin stick survival RPG. Battle, explore, loot, solve, communicate, live in an endless universe. Discover your past and travel your way to GAIA where humanity can be rebuilt or not...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8q5j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243157,"name":"Phantom Hunter","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Unleash your inner Phantom Hunter in a supernatural 8-bit world! Battle against relentless ghosts, dodge a hail of bullets, and gather materials to unlock new classes and customize your abilities with powerful pendants. Will you rise to the challenge and become the ultimate ghost exterminator?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b8m.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243153,"name":"The Orphan","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In The Orphan, you'll step into the shoes of Eric, a young orphan who has returned to the abandoned orphanage. As you explore its dark and twisted corridors, you'll encounter all manner of supernatural creatures and otherworldly horrors that will test your courage and your sanity.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b8j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243143,"name":"When it rains, I want to disappear off somewhere","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243138,"name":"Terra Nil: Deluxe Edition","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"The Terra Nil Deluxe Edition bundle includes a soothing 34-track OST by Meydän and a beautifully illustrated Digital Artbook.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b76.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243133,"name":"Pump It Up Fiesta","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Pump It Up is a music video game series developed and published by Andamiro, a Korean arcade game producer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b6w.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243123,"name":"Sword of the Spirit","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"In this combat-focused RPG, you'll embark on a journey through perilous realms filled with dangerous creatures and challenging foes. Engage in fast-paced, strategic battles where every move counts as you wield a variety of weapons and master powerful abilities.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b4o.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243122,"name":"Journey Into Darkness","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"In an unknown environment, only this light can bring a little warmth, but the continuous decline of the battery is stripping away my sense of security, I have to escape!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b4n.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243111,"name":"Facewound","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":243105,"name":"Crossout: Biter Starter Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243104,"name":"Crossout: Cleaner Starter Pack","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243103,"name":"Breakup Squad","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"A fast and asymmetrical team-based game for five players!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243102,"name":"Jump and Roll","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243100,"name":"Jumping Jacks","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Jumping Jacks will test your reflexes the hard way, despite its simple design.\nYour ultimate impossible goal is to keep jumping over incoming enemies.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243099,"name":"KleptoCats 2: Idle Furry Pets","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"KleptoCats 2, the sequel to the viral phenomenon, KleptoCats, brings back all your favorite feline friends along with some fresh new kitties. It's 2x more cute, 2x more fun, 2x more mysterious...and, yep you guessed it, 1337x pure PAW-someness!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243098,"name":"Line Up: Dots!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Find out the best route and connect the dots in order until the end of the line, but don't forget to collect the stars at the right time!\nPlay freely hundred levels, beginning with the easiest to the most challenging. Each level has several ways to be solved, use your logical reasoning and try to collect all the stars of each world!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243097,"name":"Lost Oddies","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Help the Oddies get home by puzzling them towards their symbol.\nBut be aware, Oddies of the same color will always follow one another!\nIf you move one green Oddie to the left, all other green Oddies will also move to the left!\nThis makes Lost Oddies a simple, yet brain twisting puzzle with 6 different Oddie behaviors and many interactive elements to use!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243096,"name":"Lulu Fighter for LOL","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This is a fangame for all users, and the only requirement is your fantastic technique.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243095,"name":"Magimon Adventures","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Jump into the amazing world of monsters and tamers in this action-packed mix of RPG and gem shooting puzzle gameplay. Prepare for an exciting encounter with creatures ranging from cute to wild in this gem puzzle game where you fight, tame and collect fantasy creatures!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243094,"name":"Minecart Chase","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Harrison Jones, a world famous archeologist, has found mystic 'Frozen Diamond' in the shadow of Temple. but army of darkness want it too. When he escape from temple, though, army of darkness also found him, Now it's up to him caring 'Frozen Diamond' From temple to UFO before it's too late. He has a mine cart with speed and diamond energy will give you boost speed.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243093,"name":"Moby's Revenge","genres":[],"avg_score":0.0,"description":"Evil Humans captured poor Moby in an aquarium. After rescuing Moby he gets his Revenge and starts his jellycious journey. Moby uses the waste of the Humans as a Tool against them. Collect Starfishes and upgrade his special abilities to get even higher and higher scores.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243092,"name":"Rise to Surface","genres":[],"avg_score":0.0,"description":"Avoid the rocks and pick up the treasures.\nHelp the little monster in the bubble to rise up to the surface in this action packed game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243091,"name":"Rocket Space Ship Frontier","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Rocket Space-Ship Frontier is a unique rocket game suitable for all ages! It is one of the best one-tap games you can find!\nCan you hear the engine running? Get ready for a party from outer space! Take a step outside of Earth and begin to play!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243090,"name":"Fitz 2","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Be the first to discover Fitz 2: Magic Match 3 Puzzle. Bright colors, enhanced gameplay, amazing power-ups and the same addictive game mechanics await for you in this fancy installment of the hit match 3 puzzle game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243089,"name":"Shock Hop","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"How long can you survive the experiment?!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243088,"name":"Stars Blast","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Choose your preferred control mode, game mode and musics.\nMake use of the bonus items to get higher scores and challenge world records.\nShare your score to varies social networks. Challenge your friends.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243087,"name":"The 8th Son? A.R.","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Scenario is based on a new Anime-derived original story directed by Y.A!\nAs the mysterious protagonist of Another Reincarnation, players set out on an adventure to save a world on the brink of destruction with Wendelin and his friends.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243086,"name":"Thumb Buggy","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Thumb Buggy is always ready for action! Collect items to score as many points as you can in \"Score Attack\" mode, grab coins as quickly as possible in \"Coin Dash\", and become the ultimate striker in \"Goal Rush\". Challenge your friends and family, and compete against others from across the world! Vroooom!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243085,"name":"Train Station: Rail Transport","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Join hundreds of thousands train dispatchers, collect thousands of trains and learn real-life stories about them.\nManage your station, earn resources by managing transport of passengers and gain various materials with freight trains. Use them to build up your train station and to purchase more passenger and cargo trains! Become a railway magnate in this awesome train simulator, finish hundreds of achievements, ship cargo to contract partners to gain awesome rewards. Cooperate with your friends to become a railroad tycoon, or compete with them in leaderboards to show off the power of your train fleet.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243084,"name":"Worldquiz","genres":[],"avg_score":0.0,"description":"Test and improve your knowledge about the world! Play in multiple singleplayer games or challenge your friends and other players online.\nYou know where to find New York? Even locating the Mount Everest is easy for you? But where is Timbuktu?\nProve yourself in 60 questions around the world in the level game, find the right balance between speed and accuracy in the timeattack game or repeat your weakest answers in the training mode.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243083,"name":"ChasingCube","genres":[],"avg_score":0.0,"description":"Control the cubes to avoid every triangles.\nEasy yet hard, how fast will you react.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243082,"name":"Cat Pong!","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A cat is traced, linked and put out.\nPrettily, a very refreshing puzzle game appeared.\nThe operation is easy, but the game is deep.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243081,"name":"Cat Game","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"This is a zen like game where you have your tea, enjoy the game soundtracks and be with your kittens. Find the differences between them...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243080,"name":"Color Tower","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Build a great tower of colored boxes!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243079,"name":"Brick Rage","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Harness your rage and your focus to defeat this non-stop, addictive and challenge game.\nSwipe to direct the missing bricks into place,column by column, demolishing rows before the wall crashes down on you.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243078,"name":"9PM Football Managers","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Be the Best among all Managers\nLeave everything behind you and build up your Football Club in a whole new way.\nIt’s the one and only mobile game that you play with your real-life effort.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243077,"name":"GoGo Tap! Fighter","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Hurry! Go outside and beat up villains and defeat their boss using your mighty skills in order to complete this exciting fast mission!\nAside from the “Normal Mode”, this game also has another mode, the “Danger Mode”.\nIn this mode, the view becomes smaller and less visible, therefore the chances of failing increases.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243076,"name":"God of Track","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Go further, play more and never give up!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243075,"name":"Glyph","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Glyph is a graceful, mind-bending puzzle game where lines making chain reactions are the way to achieving the highest scores.\nCoupled with a soothing and relaxing soundtrack, Glyph is easy to play but difficult to master as you get to grips with making the decisions of which Glyphs to pop and which to mutate.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243074,"name":"Glassfish Bomb","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Tap Tap all the flashing glassfish balls!!! Be careful of the Bombs they are explosive!!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243072,"name":"Gear for Heroes","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Train and hire blacksmiths so we can equip our warriors with the best weapons we can craft. As you improve your idle forge, our troops will get epic gear to put in their inventory slots - new armour for health, new swords for attack, new staves for magic.\nIs this an RPG? Is this strategy? Is it idle? All three at the same time. Raise your empire by equipping your soldiers, and let them train and raise health while you’re afk. Your blacksmiths will work tirelessly to equip the hero and warriors with epic loot so they can go on mighty quests to forge empires.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243071,"name":"Dragon Vita","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"How about adopting a dragon? Play Dragon Vita to hatch, raise and breed awesome 3D dragons and build the ultimate Dragon Park to brag about!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243070,"name":"Null Matter","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Experience the soothing challenge of Null Matter, an abstract puzzle game that tests your logic skills. Your goal is to eliminate all particles from the scene by merging matter and antimatter particles. With 50 levels to complete and an infinite game mode, you can enjoy hours of gameplay. Use multiple types of elements to change the properties of the particles and solve the puzzle. The game features a dark and bright theme that can be inverted, along with simple and easy controls.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243069,"name":"One Line 3D","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A simple, but challenging puzzle for your brain! Fill in all of the blocks in one line. Drag or tap on the blocks to fill them.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243068,"name":"Real Monster Truck Parking","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Drive 8 amazing Monster Trucks in exciring Events & Arenas! Enjoy tons of new Missions with our FREE “Monster Content” update and prove yourself as a stunt driver!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243064,"name":"Animo Stars Arena","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A new take on third person shooters with crazy mech customizability. Hop into your battle ready machine and start raking up rewards in competitive matches or compete with your friends in custom ones.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b1r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243053,"name":"Experiment: One","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Psychological horror in which you will have to try on the role of a psychologist on a helpline, as well as be drawn into a series of strange events taking place in the office.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b1k.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243050,"name":"Doge Simulator","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Doge wants to destroy! Doge wants this whole damn city to be destroyed! Smash the shops, cafes and even the damn palm trees! In our game you play as Doge, and you have to destroy, smash and break!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b1i.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243041,"name":"Spaceship Racer: Portal","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6b11.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":243019,"name":"High Für 3 Score","genres":[{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"In this game as an arrow-like character you're trapped in a cannabis frenzy. The goal is to dodge all the spirits that come your way. Through the effects box, you can complete the run with unique effects. Along the way, you can also unlock cool stuff to look extra good on the next intoxicating run or compete against different looking spirits. Weekly you have the chance to land on the display with the top 10 best, who have the most achieved high score of that week.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co79qe.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242982,"name":"Save District 3","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"\"Save District 3\" is an action sci-fi game. You will control a young lady to save her homeland.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6az8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242981,"name":"Grow and Smile: For Balling","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"The ball is round and can become bigger or smaller. Its attack depends on your skill. May be very tired, but happiness comes with you...","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6az9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242980,"name":"Girls Bus Adventure","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A thrilling adventure in an open-world environment! Drive a cool van as you search for the hottest models and up-and-coming actresses. With stunning graphics and engaging gameplay, you'll be hooked from the start. Experience the thrill of the hunt like never before!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6az7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242972,"name":"Puym: Lake","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Click on the skate, aim at the garbage can and manage to throw away a minimum of masks to reach the goal ! It's up to you to solve each riddle! All around the lake, visit 100 emblematic places and discover their stories. You will also learn a lot about the decomposition of waste in nature.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ayj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242971,"name":"Robot Lawn Mower","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Step into the exciting world of robotics with this satisfying robot grass cutting game","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ayk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242966,"name":"Chaos Coming","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"\"Chaos is Coming\" is a personal independent development of the Cthulhu Mythos-style card roguelike game. In the game, the player will face various mysterious and crazy creatures and events, collect powerful relics to drive away monsters, and escape the domain before their mind is corrupted.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ayf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242965,"name":"Blind and Schizophrenic","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Fornicate with hookers, smoke weed, or just sit at home collecting welfare, how will you spend your life as a blind old man with schizophrenia? Can you survive even one day as this poor, decrepit wretch? Or will you show the world that it should pay attention to irate old farts with nothing to lose?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ayc.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242964,"name":"Ascendant's Roguelike","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A fantasy based roguelike. Ascend and slay endless hordes or monster while gaining the abilities of each creature you slay.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ayd.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242958,"name":"Finger Is 300 Bugs","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"\"Finger is 300 bugs\" is a wave game where you have to destroy bloodthirsty insects attacking your breakfast. Use boxes, traps, and moves to protect your belongings and survive as long as possible.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ay5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242957,"name":"Karpov","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"\"Karpov\" is a visual horror novel shrouded in mysticism.Do you see THEM? Sneaking around in the shadows. Hiding their motives. You are far from the first to confront them. Are you sure you're strong enough? How presumptuous. Take your time. One false step and you won't be able to go back.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ay3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242956,"name":"Squad Game","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Squad Game is a unique game that combines side-scrolling adventure with quarter-view turn-based strategic battles.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ay2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242955,"name":"Tower of Traceability","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"You control a magic tower floating in the sky, falling from the sky against enemies coming from all sides, choosing the right weapon mix for different enemies, using health and mana in a planned way, reducing their wear and gain more rewards.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ay1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242945,"name":"Eye Uv Eve","genres":[],"avg_score":0.0,"description":"Multi-gun bullet heaven arena arcade survivor madness. Wield 14 guns at once and destroy hordes of enemies. Die, upgrade, return, destroy, repeat.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6awq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242937,"name":"Noob: Les Sans-Factions - Limited Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"Xbox Series X|S"}]},{"id":242926,"name":"Park Beyond: Day-1 Admission Ticket Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242924,"name":"Dungeons & Dragons: Dark Alliance - Day One Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"}]},{"id":242911,"name":"Sonic Storm","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sonic Storm is a Sonic fan game that takes place after Sonic CD. This game takes inspiration from Y2K and street culture, from its stylised shading and user interface to its heavy focus on grinding and maintaining combos.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co70d8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242897,"name":"Pokémon Vanguard","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Enter Ayrei, A region split into four separate quadrants, each blooming with life.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co93de.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242884,"name":"Cowboys & Rustlers","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Tear-jerking story about a friendship between a man and a horse. Face life’s headwinds with the help of universal tools of communication - revolvers, lasso, emotional intelligence and dynamite. Search for the sense of spittoons (and life) on the prairies where mean words ricochet as hard as bullets.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6cnk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242883,"name":"Grand Sanctuary: Troth of Angel","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242882,"name":"Rival Gears","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242881,"name":"Dream Land","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This is a pixel art style open world survival adventure game. Player wake up in a strange dream world, start an unknown journey. Player need to acquire resources through foraging, hunting, mining, fighting,etc.,to build bases, to craft equipment, to cook foods, and to develop himeself/herself.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6gm0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242880,"name":"Ninja Survivors Online","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242879,"name":"Spider Evolution","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242876,"name":"Gorufoo","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A Golf-like sport for the new generation.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6au6.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242857,"name":"Spies Spies Spies","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This is a pixel-style role-playing game with exploration and adventure. weapon upgrade, random state, random skill, random prop, armor upgrade, store, alien copy, spy, fog, civilian kill, escape, super magic outfit, roguelike, poisonous fog, trap, automatic aiming, infinite refresh.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ate.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242848,"name":"The Penguins of Madagascar: The Helmet","genres":[],"avg_score":0.0,"description":"When Kowalski invents a helmet that turns thoughts into actions, it’s only a matter of time before King Julien tries to get his hands on it. Once in control of the helmet, King Julien turns up the power to such a level that he can’t control it, and it’s up to the Penguins to find a way to stop it before chaos takes over the zoo.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6at1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242841,"name":"Super Mario Solarshine","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Experience the Galaxy in a whole new way!\nSuper Mario Solarshine is a completely new adventure that brings many of your favourite Galaxy levels into Super Mario Sunshine.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6uf1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Nintendo GameCube"}]},{"id":242835,"name":"Ben 10 Omni-Charged","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Ben 10: Omni-Charged is a 5-minute, 1-3 Player VR Cooperative Multiplayer game that puts players in a Powertrix suit armed with overpowered alien abilities. Suit up and save the city from Vilgax and his robotic army.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ash.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242832,"name":"Stay Alive","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Stay Alive is a game with simple gameplay, designed in retro pixel art style, with elements of mythology and roguelite. Sometimes running away isn't the solution, but sometimes you shouldn't even look back, and giving up isn't always the end.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6asg.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242821,"name":"Day at the Races","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"The aim of this \"light-hearted\" horse racing game is to win enough money to purchase, maintain and enter your horse in the prestigious Day at the Races Cup, held on the 5th race of the final day. Good luck!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6asa.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242811,"name":"Friendly Premonition","genres":[{"id":0,"name":"Visual Novel","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A murder just took place in the town of Greenvale, and it's affected everyone. You play as a psychically-attuned stranger to town who has a feeling that there's more to some of these people than meets the eye. Lucky for you, you're charming enough that people trust you with a whole host of secrets.\n\nVisit various different locations around Greenvale and talk to the cast. Collect illustrated trading cards after getting to know people through dialogue options. View a range of familiarly odd items with new descriptions. Even flirt with the people you've made friends with, if you're so inclined.\n\nFriendly Premonition is a talking sim where you can meet every character from the original game and listen to them talk your ear off about a range of interests. Once they've run out of specific topics, they'll eagerly share whatever thought enters their head. A select number of characters even have special mechanics for you after you've talked to them enough, so make sure you check back.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8c4v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242810,"name":"RoboCop","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Game Boy Advance port of RoboCop.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co97zi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy Advance"}]},{"id":242801,"name":"Dunk Tower","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Do you like basketball games? Do you like casual games?\nThen find the two together in Dunk Tower! An incredible, challenging and addictive game!\nScore baskets and overcome the challenges before the water covers your tower!\nAnd more, have you thought about play basketball with a soda or a barrel? Collect all crazy skins for your basketballs!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242800,"name":"Paper Champion","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Deliver papers to your customers with this fast-paced, fun, and addictive game.\nTest your skills by trying to deliver the most papers without crashing into oncoming traffic!\nTime your throw perfectly and the paper will land on the customers doorstep for more points!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242799,"name":"Rage Racing 3D","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Like Parkour? Or Racing games? Enjoy them all in our game, this is the only chance in market.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242798,"name":"Death Tour","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Deliver highly valuable cargo, but watch out: you’re being hunted down. Drive through the racy storyline at full speed, reveal the secret of the stolen briefcase and revenge a gang of cold-blooded assassins.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242796,"name":"Stone of Destiny","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Brand new Chinese style match-3 puzzle game from Fangtang!\nChallenge your skills across 9 areas and 73 levels in the the definitive puzzle game. Gain the help of mythical Chinese creatures and tools to discover your destiny!\nCan you find the ultimate truth?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242795,"name":"Letteral","genres":[],"avg_score":0.0,"description":"Letteral is a beautiful and clever word game, that you can play for free against your friends or anybody in the world. But be aware, word wizards; Only with a superior strategy will you be able to beat your opponents.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242794,"name":"Rat vs. Cat","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Mr. Joey Mouse has a very sweet and little dream of filling his hole with all the cheese of this world.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242793,"name":"Monster Busters: Hexa Blast","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Do you think you have what it takes to match the same colored monsters, and save the gingerbread cookie friends? Monster Busters: Hexa Blast is a brilliant match three puzzle game – a brand new yet classic match 3 style game with a hexagonal twist. If you love fun casual games and match three games, you are bound to love Hexa Blast.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242792,"name":"Rainbow Splash","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Discover what’s at the end of the rainbow in the new addictive puzzle game, Rainbow Splash! Seemingly simple in concept, this game will test your puzzle solving skills. As you progress through the game, you’ll reveal new acts each with a new twist. Finally when you’re ready, try the challenge mode to truly put your skills to the test.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242791,"name":"Crazy One","genres":[],"avg_score":0.0,"description":"Play with friends and share the fun with family. Challenge real players online or computer players in real time. Compete against top players worldwide. Chat with other players using emoji and send each other gifts.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242790,"name":"Swipe: Maze solver","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A new type of one hand playable maze game!\nTouching colors and piano musics will get your eyes and ears.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242789,"name":"Love Connection!","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Here you will be a star! Take advantage of your passion for love to connect all the graphics and absorb them. The more graphics you can connect and absorb, the higher score you will get. Come to challenge yourself!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242788,"name":"Sp:In","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Control the Nuggle’s spaceship with a single tap and collect the Light Energy needed to fight their biggest threat: a supermassive black hole that is slowly absorbing the Nuggle’s Planet.\nBut be careful, it may be harder than it seems! You will find many obstacles to overcome in your journey through space such as asteroids, deadly dust clouds or radioactive zones. Not everything is as it seems and you’ll need to hone your skills to master your spaceship’s speed and movements!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242787,"name":"Monster Pet Shop","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Run your own Monster Pet Shop that grows, exhibits, and sells fantastic magical creatures. Play with, care and feed your creatures to maximize happiness. Happy creatures award more money when you find them good homes. Customize your Monster Pet Shop with three different habitats – Dirt, Grass and Water, and unlock ever more wonderful creatures.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242768,"name":"Coal Burnout","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Beat your competition in Multiplayer PVP by establishing a quick get away. In Coal Burnout, you'll be able to use a variety of trains to get ahead of your competition. Get Coal Burnout today!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242767,"name":"Trench Racer","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Race through trenches and underground tunnels blasting your way through enemy strong-holds with an array of powerful weapons. Reach the wormhole gate to escape before you're destroyed or your craft runs out of energy.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242766,"name":"Terrella","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Opposites attract as you create your own gravity and anti-gravity using four colors. Find the best solution to guide your way through each world as quickly as possible. Watch out for the glowing obstacles. While they look pretty, they are not friendly! Play your friends in real-time with the multiplayer mode or challenge them to beat your scores.\n\nIt’s a race against time to set new high scores for yourself or beat the scores of your friends. Terrella’s companion, Boost, can help her out of a sticky situation. When timed just right, Boost can also help Terrella make it through a level faster to get the top score.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242765,"name":"Rapid Roller","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Roll in a minimalistic, colorful world and see how far you can travel! Roll over jump pads for extra score. But don't hit the walls or spikes!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242764,"name":"Tap Tap Driver","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Tap Tap Driver is a fun and challenging endless driving game. Drive your car along the zigzag road in a dynamically generated city. Tap the screen to steer the car left and right. Compete with your friends and compare or beat their highest score.\nTap Tap Driver will test your agility, alertness, and timing. It is a good eye and hands coordination exercise.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242761,"name":"The Reacher","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Reacher is a platform game with different aspects in it. Run, slide and swing for reaching the goal. It is designed for speed runs.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aqp.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242760,"name":"Ultimate Skate","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"The most adrenaline inducing skateboarding game ever. If you want to skate in the most hardcore and fun way, this is the game for you! This simulator lets you build your own custom board and skate around different parks and shred objects.\nChoose between 30 different boards and 9 different truck varieties to show your true skater personality!\n\nUse swipes to preform tricks and push the board forward with natural ease. You can also record video replays and send them to your friends! This app has everything you need to become a legendary skater.\nLoved by skaters all over the world.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242759,"name":"Adventures in Equica: Unicorn Training","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Master powerful magic, venture through dungeons, and explore the monster-filled forest of Equica! Clover is the unicorn apprentice of Grand Swirllock the Bearded. She needs to learn the 10 basic combat spells every mage must master to survive fights against the monsters of Equica.\n\nTraverse deadly dungeons to unlock more spells and extend your life energy! Beat all the dungeon bosses to prove you’re tough enough to take on any dangerous quest!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co8rtq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"Linux"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242758,"name":"WinterCraft: Forest Survival","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"You are in a winter forest and trying to survive at any cost! Can you survive and find your missing father?\n\nWinterCraft is a survival game set in a winter forest where you will face dangers in a vast free world. Get resources, set up a camp, hunt wild animals and explore snow-covered forests! Every day in winter survival can be the last day on earth!\nMany adventures await you: story quests, survival in the forest, exploration, hunting, gathering and crafting. You will have to learn a lot to survive: get food, melt snow, hunt animals and keep a fire!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242757,"name":"Fearz!","genres":[],"avg_score":0.0,"description":"Fearz! is a fast-paced game of observation in which all players play at the same time.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242749,"name":"Cosmic Dungeon","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Cosmic Dungeon is a rogue-like game set in space, where players can explore unique dungeons filled with challenging enemies and treasure. With an array of different items and weapons to collect, players must strategically navigate the dangers of each level to progress deeper into the dungeon.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aqk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242717,"name":"Beeknighted","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"On a stormy evening a marauding troll absconds with a beehive while being pursued by hunters. While the hunter's plans go awry, the troll stumbles into their pitfall trap, dragging the unfortunate bee with him. Separated from the broken fragments of her hive and stranded during a storm, the bee must find temporary refuge in the caves below the Bugbear Antfort and escape to safety.\n\nMeet friends and foes, discover treasures and traps, and traverse the dangerous caverns in this adventure inspired by Nintendo 64-era classics.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aou.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242693,"name":"Mortal Trace","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Online PvP 3D \"snake\" game. Avoid yours's and your opponents' growing tail or \"Trace\" and be the last left in the arena while trying to cut off and trap your opponents with your Trace.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6arq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242684,"name":"The World Hockey Championships","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Play a competitive real-time​ hockey game! Position your player to take your best shot and make epic saves in real time to become the next World Hockey Champion!\nPlay in multiplayer or single game mode, competing with people around the world in real time to win The World Hockey Championships.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242683,"name":"Armed Air Forces","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Armed Air Forces offers all-embracing combat flight simulation experience on mobile devices. Finally you can play PC quality combat game anywhere and anytime you wish.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242682,"name":"Real Cricket™ 16: English Bash","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"From the makers of Real Cricket comes the excitement of the English T20 Bash!\nGuide your favorite English T20 team to the top and win the biggest cricketing domestic crown in Britain.\n\nPick your favorite team full of superstars and compete against the best!\nBe amongst the game's finest, use the entire arsenal of 27 cricketing shots to experience the most dynamic and realistic representation of our favorite sport on your mobile devices.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242681,"name":"Built for Speed","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Built for Speed is the best retro-racing game available for your mobile device today! Beat your friends and the top players on player made tracks; rise to the top of the league to prove you're the champion.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242680,"name":"Golf Odyssey","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Get a hole in one and unlock new courses on this relaxing yet challenging golf game!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242679,"name":"Hello Princess","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A maze game set within a castle.\nYou have to solve the maze, reach the princess and save her.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242677,"name":"Tiny Troopers: Global Ops - Digital Deluxe Bundle","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"The Tiny Troopers: Global Ops Digital Deluxe Edition Includes:\n\n- Tiny Troopers: Global Ops\n- Tiny Troopers: Joint Ops\n- The ‘Tiny Tales’ Comic Book\n- The Tiny Troopers: Global Ops Original Soundtrack","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6am1.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242676,"name":"Chronicon Complete","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6am0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242675,"name":"ForbiddenWord","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Let the other person say the forbidden word! A psychological chat game that takes care of your own forbidden word and draws out the other player's forbidden words!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6alz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242671,"name":"T.D.Z. 3: Dark Way of Stalker","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Atmospheric Stalker adventure in the post-Apocalypse world!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6alv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242670,"name":"Night of Spirits","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Night of Spirits is an individual or online horror game for up to 4 players, where the main objective is to hunt down the ghosts that haunt the city.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6alu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242668,"name":"Gothic Platformer Games Bundle","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242663,"name":"Birds Blitz","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242662,"name":"Align 12","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Move-Align Puzzle!\nCreative Puzzle!\nDifferent Puzzle!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242661,"name":"Ludo Live!: Heroes and Strategy","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Play a brand new, innovative game of Ludo with mythical heroes and epic battles. Plan your moves. Cast Spells. Decide which battles to fight and which heroes to play with. In Ludo Live! roll the dice and make decisions to destroy all your opponents with your heroes and win the game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242660,"name":"Chezz","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Play fast chess in an all-new way!\nChezz breaks the rules to create the fastest, most frantic new way to play the classic board game.\n\nChallenge yourself in a game that lets you move all the pieces at the same time. Fight quick online PVP battles in real time with other players, or solve hundreds of levels in adventure mode. Pieces change on each game board and can be upgraded. Fast like checkers, intense like chess. Play the ultimate board to action game conversion. Become the ultimate king or queen and join the Chezz revolution today!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242654,"name":"Chart1647","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Chart1647 is a classic rhythm game developed over many years and is a 4k game similar to Stepmania. It features a fully customized set of levels, importers from most modern SM formats and more!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6al7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242637,"name":"RedCat: De Duistere Dierendiefstal","genres":[],"avg_score":0.0,"description":"RedCat travels in a UFO along the five continents and looks for all kinds of mammals, birds, reptiles, amphibians and fish.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6arf.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242615,"name":"Friday Night Funkin: vs. Jeff","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7fqa.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242610,"name":"Raptor Rush","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"The game features a dynamic day and night system that adds a new level of challenge and excitement to the game. You'll be able to see the stunning visuals change as you progress through each level, keeping you engaged and immersed in the game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ajj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242609,"name":"Before We Leave: Deluxe Edition","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aji.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242608,"name":"Super Magbot: Digital Deluxe Edition","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ajh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242605,"name":"Core-Blast","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Find core of the same type that are close to each other and click on them to blast.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aj4.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242603,"name":"Jump Jump Cyberpunk","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"A strategy game where driving a ball you will have to overcome countless obstacles to reach the exit and move to the next level. You will find led levels full of jumps, free falls, spins,teleports, obstacles and music that will immerse you in the game. A perfect combination to enjoy, are you ready?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aj2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242600,"name":"Binarion","genres":[],"avg_score":0.0,"description":"Improve your intellect with this unique puzzle game where you solve delta grid to find two binary prime factors from a given multiplication product.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aiz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242594,"name":"Four-Knight","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Four-Knight is a simple four-in-a-row. Act strategically on the simple rules and aim for your victory.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aio.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242593,"name":"Fobia ...Worse Than Fear.","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"An adventure of exploration, intrigue and psychological terror of great originality.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ain.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242583,"name":"Sky Symphony","genres":[],"avg_score":0.0,"description":"Welcome to Sky Symphony, the ultimate side-scrolling flying adventure! Take flight in a stunning, immersive world filled with endless obstacles, challenges, and opportunities to collect points.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aic.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242570,"name":"Hidden Object: Mystery of Mysteries of the Aztecs","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Everyone wants to take part in an interesting adventure in search of ancient civilizations. Do not miss your chance, not everyone has in life! You'll have to show attentiveness, speed of thinking to solve the difficult but very interesting problems. And only after that you can see the beauty of the ancient world, which has hidden waiting for many centuries! Do not waste your time and forward - to new adventures!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242569,"name":"Deadly Soccer","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Dear players, we draw your attention to the unique opportunity to see an abundance of various evil spirits in a soccer game.\nIn the heat of the lost souls' tournament, the accumulation of a large amount of immortal substance created to something which installed itself into the soccer ball, so that everything it touched started coming to life – from the lifeless bodies in the cemetery to the scarecrows in the gardens... All the revived ones demonstrated an unquenchable thirst for the game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242568,"name":"CoupButat","genres":[],"avg_score":0.0,"description":"Enjoy the story of little pigs and wolves, which you've probably never seen!\nThe Fairy Tale of little pigs and wolf... is familiar to everybody in the world.\nBut this game's story seems a little different to the story we all know...\nComplete the game, and look forward for the original ending!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242567,"name":"CoogyLoop","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Easy rules, easy to use, easy to get addicted to. Coogyloop is all about making sure your mind is quick and your fingers quicker.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242566,"name":"Jumpy Rooftop","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Running, jumping, and sprinting is what Jumpy Rooftop is all about!\nUnlock all 32 or more hero characters, including a fireman, policeman, gym junkie, robber and more! Collect heroes during endless mode and earn bonus gems just for playing!\nYou can run through night and day, good and bad weather, rain hail or snow! Chickens, fireworks, water spouts and all sorts of crazy stuff will cross your road. Dodge missiles and other nasty stuff falling from the sky! If it's not a bird, it'll probably kill you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242565,"name":"Jungle Jammy","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Swing endlessly through the jungle and throw bananas at eagles and sleepy snakes. Bananas are great for survival and your health.\nGo bananas!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242564,"name":"Cave Swing","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Falling into a cave is never fun, but things quickly change when you discover that the cave is full of diamonds!\nSwing from side to side and collect as many diamonds as possible. Unlock awesome characters with unique abilities, but whatever you do, do not hit the cave walls.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242563,"name":"Archery Tournament","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Discover this top free archery game with tournament mode, great performance, small install size, and amazing features!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242562,"name":"Ark Bubble","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Ark Bubble is similar to brick breaker genre with some cool adaptations. Instead of moving a paddle, you draw lines on the screen to avoid the ball to scape in the bottom of screen. You can not draw infinite number of lines, they are limited but you can buy more ones with your points.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242561,"name":"Mimpi Hidden Objects","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Meet Mimpi, the cutest puppy ever! Help him find hidden objects in a colorful world - in the craziest dream a dog can ever have!\nTravel through seven diverse lands that Mimpi visited on his original quest to find his master.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242560,"name":"Mini Tennis","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Pick your racket and choose your ball. Get ready to go onto the court in this brand-new tennis game! Experience tennis like never before in this fresh and easy-to-play game. In Mini Tennis, you can enjoy a casual gameplay experience that still remains loyal to the original game. It’s time for you to get a standing ovation from the crowd in the arenas and courts, score some amazing points, and build the strongest tennis legend that ever existed!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242559,"name":"My Brother is a Superhero","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Luke is a comic-mad eleven-year-old who shares a treehouse with his geeky older brother, Zach. Luke's only mistake is to need a wee right at the wrong moment. While he's gone an alien gives his undeserving, never-read-a-comic-in-his-life brother superpowers, then tells him to save the universe. Luke is massively annoyed about this, but when Zach is kidnapped by his arch-nemesis, Luke and his friends only have five days to find him and save the world...","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242558,"name":"Shadow Land","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"One day, the world suddenly lost its colour…\nAll the colour in the world was taken by a monster that came from nowhere!\nThe colourful world became monochromatic…\nIn these times, we need the help of the legendary puppeteer!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242557,"name":"The Light Box","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"This challenging and unique puzzle game is easy to pick up but has hours of gameplay.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242556,"name":"The Lions Knight","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"The Lions Knight is a game designed to the players who love SRPG game. A large number of 3D heroes and monsters! The battle is tactfully and simple operation; And the other leisure playing - farm and mining. we provide a strategy and relaxed game experience for player experience.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242544,"name":"Atelier Ryza 3: Summer Look Costume Set","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Summer outfits for Atelier Ryza 3! Adds 7 summer costumes, one each for Ryza, Klaudia, Lent, Tao, Empel, Lila, and Bos.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242526,"name":"Romantic Shooter","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Romantic Shooter is an erotic shmup game where you'll be able to destroy the girls clothes!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6afv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242523,"name":"Eightrun","genres":[],"avg_score":0.0,"description":"Eightrun is an intense, minimalist game of fast reflexes, in which the player tries to dodge patterns of obstacles while moving down an endless, octagonal tunnel.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6afu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242512,"name":"Legendary Realms: A Fantasy World Odyssey","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Legendary Realms: A Fantasy World Odyssey is a multiplayer sandbox adventure game. Create your own character, select classes, and take on quests to earn rewards and level up. With a range of equipment and multiplayer options, it's an immersive experience that will keep you engaged for hours.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aev.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242492,"name":"Ballsvoid","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Difficult game of skill and reflexes where you have to help the character to escape. Take your controller and prepare to die many times.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6adr.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242491,"name":"Dungeon Legend","genres":[],"avg_score":0.0,"description":"This is a casual breakout game. The pace of the game is very tight. The goal of the game is to score as many points as possible. .","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6adq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242488,"name":"Brain Hole Girls","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Can a perfect body and a smart brain coexist?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ado.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242484,"name":"Do You See Sparky?","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Do You See Sparky? is a first-person co-op horror game for 1-4 players with a social deduction elements. Collect clues, solve puzzles, cheat to catch a monster that you can't see, but your friends can.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6adh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242478,"name":"Rocket Control","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This game is an extremely simple 2D action game where you launch, control, and land rockets. The rules are simple: ascend to an altitude of 1000 meters, start the descent, and then land back at the original launchpad.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6ad5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242475,"name":"Century: Age of Ashes - Thornweaver Premium Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242465,"name":"Burning Tracks","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Get airborne, flip over, climb mountains, drift and more in this realistic 3D off road racing game.\nWith many different terrains and maps, face off with other off road racers and try to beat them to the finish line.\nTurn with a tilt of your device, floor the gas with a touch of a finger, drift by touching the handbrake and touch the brake to slow down.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242464,"name":"Ball til You Fall","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Ball til You Fall is a lighthearted basketball shooter with attitude.\nSwipe the ball at the hoop to score, but beware! Missed shots come with a penalty. If you hit the backboard, you risk pushing the hoop off of the edge!\nCollect gems to win new balls with mysterious new abilities that can give you that competitive edge.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242463,"name":"Blades Away","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Physics based, 2D blade throwing simulation game with lots of unique blades to collect and master.\nKnife throwing has never been this easy to pick up and this challenging to fully master. Throw axes, knives, swords, ninja stars and other blades from all across the world. Huge rewards for skill and perception.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242462,"name":"MLB Tap Baseball 2023","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"MLB Baseball comes to your phone with the MLB Tap Baseball mobile game. Manage a dream team of real MLB players from the most current rosters and travel to authentic ball parks. Play nine innings of gripping baseball action and power up your team to help your club rank at the top of the leaderboard! Tap to swing and hit a home run with simple controls - but keep your eye on the ball!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242461,"name":"American Football: Guns & Balls","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242459,"name":"King of Sopio","genres":[],"avg_score":0.0,"description":"The Sopio family increases with King Of Sopio!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242458,"name":"Putt Golf","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Play the ultimate fun Putt Golf game. The game is very simple, you just have to judge the angle of the ground and tap at the right time to putt the ball.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242457,"name":"Neon Sling","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Drag the large neon ball on the sling line and release it to shoot the targets!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242456,"name":"Oran's Table","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Oran challenges you to take a seat at his table in this thoughtful puzzler.\nUse the unique movements of each piece to cover every portal. You'll need to step, slide, jump, swap, shift, mimic and connect your way to the solution.\nYou must think creatively: pieces working in harmony create paths greater than the sum of their parts.\nControls are simple. Tap to reveal range, and tap again to move.\nFeatures over 120 handmade puzzles, 6 unique pieces, and a few surprises which only the most devoted players will discover.\nPlay the 1st 16 puzzles free, and pay only once to play the rest.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242455,"name":"Recess Riot","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"From the creators of the cult hit game Super Mega Worm, comes a new and fresh arcade game.\nRecess Riot is an unique and challenging Action/Arcade game comprised of multiple game modes.\nJump! mode is a timing based jump rope game with a twist. Ropers will change rope speed and patterns. Ropers will also shift left and right to keep the players on their toes. Advance stages will require players to jump rope and dodge incoming objects simultaneously.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242453,"name":"Swim Meet","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"See if you can beat the best in 5 Olympic-style Swimming Events. Use finger gestures that are modeled on the actual swimming motion used in each event.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242452,"name":"Let's Go Run","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Be willing to end the 30 missions and you wander in a popular Suq?\nAnd the removal of restrictions on your friends in the game to be able to play their own.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242451,"name":"Where Is My Crown?","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The kingdom host the biggest party of the year to celebrate the king inauguration. But, the king had too many honey and lost his crown....\nWhere is my crown? is a new procedurally generated deduction game and you can play it anywhere only needing your smart logic and thinking.\nWhere is my crown? is a deduction game where players must explore and investigate other character to find the crown.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242450,"name":"XeeWar","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"XeeWar is an online 2-player turn-based strategy war game where players fight for control over the battlefield by destroying enemy units and capturing bases.\nEach player take turns building units, advancing on the battlefield, capturing bases and eventually engaging in combat. Each combat unit has its own strengths and weaknesses, and are affected by the terrain. Use advanced tactics to outsmart your opponent!\nXeeWar uses the Elo-rating system (often used in Chess). Your rating changes after each match, based on your opponents rating. Gain enough rating and you will start gaining Ranks and climb the leaderboard!\nWhen you start playing XeeWar you have the rank 'Recruit'. If your rating gets high enough you will recieve a new rank. There are 7 ranks total, with 'General' as the highest rank.\nGood luck on the battlefield commander!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242447,"name":"The Riddler","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Think you're clever? Prove it with an enigmatic AI, the ultimate master of riddles beyond imagination.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7ikk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242445,"name":"Causeway","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Create intricate and satisfying road systems in tiny utopian cities Causeway is a minimalist road building sim where you help futuristic hover vehicles find their destinations by building roadways to connect different highways. Get ready to build the roadways of the future!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6plu.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242417,"name":"Road Accident With Dangerous Goods VR Training","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Train your professional skills in Road Accident With Dangerous Goods VR Training safely and in full correspondence with international standards!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aav.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242415,"name":"The Territory of Egg","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This is a variant tower defense indie game. Use the Egg Warriors to form a defense line, observe the type and distribution of the enemy, use the terrain structure, build a reasonable formation, explore different skill combinations, and protect the Holy Egg.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aas.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242413,"name":"Castle of Deceit","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Castle of Deceit is a first-person shooting battle game that takes place on an alien planet. You will play the leading role in finding the weak truth in the quagmire of lies and make your decision to find your lover.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6aar.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242397,"name":"Balance Weight","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Arrange your cats and other items to 2 sides of the scale to balance. Sound easy right? But it will blow you mind when you actually solve it.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242396,"name":"Polaretti","genres":[],"avg_score":0.0,"description":"Help the Polaretti Team use their superpowers to overcome the evil Minorca\nAn exciting adventure is starting in Polarettiland! Minorca is more evil than ever, and this time she is ready to do anything to steal all the fruit. Will the “Polaretti Team” succeed in overcoming her, thanks to your help and their superpowers? Join them in their world, and help make them stronger collecting all the fruit.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242394,"name":"Sokoboxes Duo","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"A new game based on Sokoban.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a9r.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242393,"name":"Glory Room","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Glory Room is a Roguelike game that can be played quickly and lightly. It proceeds with stories of the characters who have no choice but to come to the hellish arena. Various items, monsters and traps give you trials. Overcome it and create your own show to defeat the demons and reclaim your glory!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a9q.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242392,"name":"Fly Fishing 3D II","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"The sequel of 'Fly Fishing 3D'! The fly fishing game that exceeded 4 million DL!\nExperience our new fly fishing game with overwhelmingly evolved 3D graphics!!\nAlso, it became more exciting by adding new elements: Underwater camera, new actions, fight scene, and competing with NPCs!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242389,"name":"Into the Winds: Zen Flowers","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Into the Winds: Zen Flowers aims to provide a meditative gameplay experience. Take your time to match flowers and watch as the flowers disperses their petals, carried away by the gentle breeze. A down to earth Match-2 puzzle game infused with elements of Zen.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242385,"name":"Food Dude","genres":[],"avg_score":0.0,"description":"Food Dude is a cancelled game for the CD-i.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Philips CD-i"}]},{"id":242371,"name":"Beyond Enemy Lines 2: Enhanced Edition","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Take the role of a special agent deployed deep beyond enemy lines. You will seek, locate and destroy the enemy while causing havoc and confusion. Emerge a hardcore tactical experience in vast, nonlinear missions where skill and tactical decisions matter!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6cm5.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 4"}]},{"id":242370,"name":"Fight'n Rage: 5th Anniversary Limited Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co9d2i.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"Nintendo Switch"}]},{"id":242369,"name":"Park Beyond: Impossified Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242368,"name":"Tintin Reporter: Cigars of the Pharaoh - Limited Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Xbox One"},{"id":0,"name":"Nintendo Switch"},{"id":0,"name":"Xbox Series X|S"},{"id":0,"name":"PlayStation 5"},{"id":0,"name":"PlayStation 4"}]},{"id":242359,"name":"The Walking Dead: Saints & Sinners - Tourist Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a8j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242344,"name":"Flower House","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a8b.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":242334,"name":"Dune of the Desert","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"A vehicular-combat focused game set in a post apocalyptic desert, the player takes the role of a bounty hunter tasked with taking down some of the most feared creatures in the desert. Collect artefacts, crystals, and other highly sort after items to upgrade your vehicle for high intensity combat.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a6h.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242332,"name":"Surviving the Aftermath: Forgotten Tracks","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Here is what’s left of Music: old tapes, cassettes, forgotten tunes that re-emerged from the ruins of society as we know it. With different styles and origins, Forgotten Tracks is the perfect soundtrack for surviving the Aftermath.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a6j.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242331,"name":"Ticket to Ride: Poland","genres":[{"id":0,"name":"Turn-based strategy (TBS)","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a6g.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242328,"name":"Robo Frenzy","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Build and battle in Robo Frenzy! Create dozens of weapons and construct inventions to crush gigantic gadgets in a sandbox action game that blends crafting with combat.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a6v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242323,"name":"Criminals Within","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Embark on an epic journey through a medieval fantasy land inhabited by powerful, de-evolved dragons. Join forces with a friend in this asymmetric co-op multiplayer adventure. Engage in skill-based combat, take on epic boss battles, solve cooperative puzzles and enjoy lighthearted comedy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a6u.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242318,"name":"Ohana Island: Blast & Build","genres":[],"avg_score":0.0,"description":"Forget about all the hustle and bustle of the city, and live a life away from worry in the brand new matching game \"Ohana Island\"️!\nPush open windows, breathe in the fresh air, and enjoy puzzles & delicate flowers in your shop at the seaside.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a8a.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":242309,"name":"Celesteia","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Celesteia is a 2D sandbox game that is currently in development.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a5k.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242306,"name":"Clockmaker","genres":[{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Card & Board Game","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Rescue the town from the evil curse of the Old Clockmaker! Enjoy an addicting story, solve the mystery and save the city from the villain. Thousands of levels of adventure match three are waiting for you right now!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a5i.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":242304,"name":"Eddie’s Puzzle Time","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Eddie’s Puzzle Time is an unreleased puzzle game for the Game Boy.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a5g.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Game Boy"}]},{"id":242300,"name":"WWW","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"World Wide Warfare (WWW) is the final battle between the good and evil forces of the ancient and modern world. Join the fray.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a4b.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242299,"name":"Coding Robo","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Learn programming in a fun way! An educational game that teaches the basics of programming and algorithmic logic. No prior knowledge of programming is required to play.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a4a.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242298,"name":"Touchstarved","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"You were born cursed, with hands that twist the mind of any human you touch. Desperation leads you to the shadowy city of Eridia, where your fate intertwines with 5 monstrous strangers. Each can offer you salvation or damnation. Find a cure for your curse in Touchstarved, a gothic horror romance visual novel.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7r22.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242297,"name":"Pizza Snake","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Pizza Snake is a fun and challenging snake game for all audiences.\nYou control the snake to eat as many pizzas as you can. Each pizza gives you points.\nWith points, you collect stars. There are 5 stars for each level.\nPizza Snake has 8 levels and your goal is to collect all 80 stars.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242296,"name":"The Amazing Circus","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The circus is in town! Welcome to The Amazing Circus, where you’re the star attraction!\nCan you make the jump to the other side?\nCan you get all the stars?\nCan you ignite the crowd with a Jump Frenzy?\nFill up the entertainment meter and earn extra points by unleashing the Jump Frenzy!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242295,"name":"Tower Maze","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Tower Maze is a simple puzzle game, easy to play and suitable for all ages.\nSelect from 2 play modes and solve a huge number of mazes, randomly generated.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242290,"name":"Skater Escape","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"You need to escape quickly!!! A lot of cops are chasing you for using the streets to make stunts on your skateboard.\nTilt the skateboard by taping in the circles with the arrows, and don't forget... make a lot of stunts for getting speed and lose all the cops.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242289,"name":"Amber Halls","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Amber Halls is a palace filled with ancient artefacts and treasures. Dangerous monsters wander through the halls, but with the help of powerful items you'll be able to outsmart them. However, carrying items from room to room will prove challenging.\nAmber Halls is a tiny mix of roguelike and sokoban. If you like puzzle games that you can play forever you are going to love this.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242288,"name":"Dream Swim","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"An action game that relies on precision skills to get you into a breathtaking journey to outer space and beyond.\nForget imprecise motion-sensing stuff, clumsy controls or a screen cluttered with buttons – like the annoying virtual pad on touch-based devices. Really, just use your thumbs on the screen to move back and forth and enjoy the awesome ride.\nSimple gestures give you total control to bounce the fish around: Choose the way you want to go and take advantage of precise landings to gain impulse and progress into this psychedelic journey.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242287,"name":"Propel Man","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Use the Catapult to dispatch the Propel Man to dizzy heights in the sky and cross each level by landing safely past the finish line by deploying your parachute.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242286,"name":"Rock Crawler","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Can you imagine a truck that climbs on rocks better and faster than humans? Meet Rock Crawler! This game pretty much resembles a real rock crawling: very precise throttle control is required to conquer some peaks. These big soft wheels allow you to climb on craggy rocks and perform terrific stunts!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242284,"name":"Turbo Racing: New Cars","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Take control of new racing cars! Feel the new atmosphere with the first expansion Turbo Racing: New Cars!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242283,"name":"The Wingless Bee","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"The Wingless Bee is a brand new Frogger-inspired game where a bee named Bella is abruptly thrown far away from the hive she lives and works at. With her wings destroyed, she can only hop to get back home.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a3v.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242281,"name":"Gutterbrawlers","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Gutterbrawlers is a snappy 2D fighting game with a combat system inspired by early Klassics. Featuring online mode with rollback netcode implemented using GGPO open-source code.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a3x.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242279,"name":"Candy's Town","genres":[],"avg_score":0.0,"description":"This time, sweetheart Candy will show her talent of being a mayor. She is just a kid, but she never disappoints people. See~ owing to her great effort, this place becomes fantastic. A little girl may harbor big power, yes, that's Candy.\n\nIn this game, she is a nice doctor, young in age, but expert in medical skill; she is a brave firefighter, so putting out a fire and saving people are a piece of cake; she is a righteous policewoman, catching the thief easily with her unique skill. Well, the little mayor may be a super hero, but not a superhuman. Sometimes she is terribly busy and that's why she needs a warmhearted partner like you.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242278,"name":"Dig Dug","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"A cancelled ColecoVision port of Dig Dug.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a3s.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"ColecoVision"}]},{"id":242271,"name":"King: A Bullet-Hell RPG","genres":[{"id":0,"name":"Platform","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"2D Pico-8 platformer, rpg, and boss rush.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a3d.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242269,"name":"PolyCraft","genres":[],"avg_score":0.0,"description":"Polycraft is a 3D action tower defence game. Explore the island, help the Wildlings and gather resources to build a base.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6a39.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":242236,"name":"Final Three Kingdoms 2","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242235,"name":"Treasure Hunter","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"}]},{"id":242234,"name":"Pumpkin Delivery","genres":[{"id":0,"name":"Hack and slash/Beat 'em up","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"After carving her own pumpkin, Murphy decides to give it to her grandmother and goes out on Halloween night without her parents for the first time. Thus begins her fight against the Halloween evil that has come to life in the city.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69zb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242233,"name":"Silly Royale: Devil Amongst Us","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242230,"name":"Mario 7-in-1","genres":[],"avg_score":0.0,"description":"Mario 7-in-1 is an unlicensed multicart game for Famicom, best known for it's inclusion of 7 Grand Dad.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69z8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Family Computer"}]},{"id":242225,"name":"Star Equestrian","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Snowdrop. A majestic rescue horse. Together, the two of you had the potential to be a perfect duo, real contenders for the much coveted Evervale Championship title, but life had other plans. One accident was all it took. Falling from Snowdrop, you were left injured. Snowdrop, in the panic, darted away and never returned to your family ranch. Years passed, but memories of Snowdrop still remained, and you’re still as determined as ever to find him.\n\nReturn to your family ranch and begin your adventure in the small town of Heartside.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69z7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242224,"name":"Brave the Dungeon","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Brave the Dungeon is a thrilling and immersive multiplayer open-world game that takes you on an epic journey to fight against the daemonic invasion threatening the archipelago.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69z2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242220,"name":"Champion Cup Goal 2","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Do you want your football club team be the winner of the world champion cup?\nPlay this fantastic football game, choose your team and your rival, dribble, dodge the opposing players and score the maximum of goals. Raise your team to the top of the ranking and sink your rival to hell by subtracting goals.\nDon't miss the opportunity to play in this world tournament your own world league and score goals for your team. This is no normal scorers league… Dare with your favorite sport and rise the ranking of your team to the top of the world.\nDefeat your opponents, win the league and turn your team into a legend!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242219,"name":"Bouncy Goal","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"The coolest way to score a goal is with your head.\nAim for the heads of the players to pass the ball and finally score a goal.\nThe game is so much fun, even birds join in to play.\nWatch out for the evil referee, he is there to ruin the game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242218,"name":"Cricket League","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Bat, bowl and field your way to the top of the league in this fast, fun, exciting and authentic real-time multiplayer Cricket game. Play quick two over matches against your friends or players around the world in just a few minutes! Ready..Set..Start your own Cricket saga now!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7cs9.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"iOS"}]},{"id":242217,"name":"Crashletics","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Unbuckle your seatbelt, smash through the window and compete in a series of track and field events using momentum and gravity to travel the furthest, highest and quickest. Upgrade your skills by your beating personal best and aim for the world record.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242215,"name":"AR Race Car","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Augmented Reality just got real. From life-sized race cars out on the street, beach or backyard to toy-sized cars on your desk or living room floor, AR Race Car gives you the thrill of tire-smoking burnouts, drifting and cornering wherever you are.\nAR Race Car is Augmented Reality like you've never seen it before! Take it out into the street, drop a car, scale it up to full size and lay down some tire smoking burnouts! Or scale it down and rip it up on your desktop or living room floor!\nRealistic high-res models, shadows, and engine-revving and tire-spinning sound effects will make it feel like the cars are right there with you! Fasten your seat belt, start your engine and prepare to be blown away as you drive your Augmented Reality","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242214,"name":"Crazy Pizza Boy","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Crazy Pizza Boy is a open world endless pizza delivery game , which uses spectacular graphics and amazing audio effects to give breath taking game play experience.\nCrazy Pizza Boy is a fast paced action / racing game in which you will have to race against time to deliver pizzas, make your way through city traffic as your tires burn against the asphalt. The game also features mind blowing audio - visual effects that improve the game play beyond the ordinary. We don't believe in restricting you to limited environment , hence the city is open for you !! You can make your own path towards your goal. The game also features 3 different controllers , so play comfortably according to you ! There are 3 power ups available to help you in your mission to serve delicious pizzas to everyone.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242213,"name":"Yurei Ninja","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"You: A ninja, back from the dead, seeking revenge against…\nThe Enemy: A samurai warlord with the blackest of hearts who turned against you!\nTrained in the art of hiding and surprise attacks, avoid traps, strike down enemies and destroy deadly bosses, all trying to stop your quest.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242212,"name":"Rush Rally","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Realistic yet fun car physics programmed from real car telemetry! Experience rallying at its best, drift and kick up endless amounts of dust and snow!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242211,"name":"Pet Cube: Tower Stack","genres":[],"avg_score":0.0,"description":"Stack the cubes as high as you can! Simple & adorable graphics. Compete with players around the world, earn yourself a spot on the leaderboard!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242210,"name":"Find the Road","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"The characters in Find The Road are experienced travelers. In this fantastic world, the roads do not stand in place, you constantly need to rearrange everything!\nJust drag the fragments to put them back in order, but will you be clever enough to do it? The more you advance, the more complex paths will become.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242209,"name":"Ultimate Jewel","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Ultimate Jewel is a match-3 game with exotic theme. This brain teasing game will give you tons of fun with special designed levels. Show your best strategical moves to get higher score ranking and stars award to process to the next stage. Challenge every aspect of your brain to be the first one to clear all thousand levels!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242208,"name":"Griddler","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Use the numerical clues to fill in the correct tiles and complete the grid!\nRace against the clock as you compete against players from around the world for the fastest times per gridsize.\nGriddler, also known as Nonogram, Hanjie and Picross, comes with unlimited randomly created levels in 6 different size grids!\nOur adaptive difficulty system makes the game more challenging as you improve. Keep levelling and ranking until you're the master of the game!\nReached the ultimate rank and want something more challenging?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242207,"name":"Gangnam City Deluxe","genres":[{"id":0,"name":"Music","games":null}],"avg_score":0.0,"description":"Dancing in Gangnam city like a pro! Can't stop moving, earn coins, get money with your style! Like the old platform games, you will be running and jumping on buildings, and that's not all, you will be able to ride a bike, drive a car and also fly with your private plane!!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242206,"name":"Tofu Go! 2: The Onsen Adventure","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Tofu has been enjoying life in his mountain cabin since escaping from the evil chopsticks. But life isn't all beer and tofu, the chopsticks are finally here again...\nLet's run with Tofu again and enjoy this amazing Onsen (hot springs) journey!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242205,"name":"Climb and Fall Dice Adventure","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Get ready for a thrilling new take on the classic \"Snake and Ladder\" game with \"Climb and Fall: A Dice Adventure\"! With intuitive controls and easy-to-learn rules, this exciting game is perfect for players of all ages and skill levels. Roll the dice and climb your way to the top, but be careful of the pitfalls and obstacles that lie in your path. Will you be able to outwit your opponents and emerge victorious?","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242204,"name":"Armored Heroes","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"We need you, Commander!\nWorld War II is one of the most significant events in the history of human kind. Thousands of heroes fought these battles with aircrafts, ships, as infantry or with tanks. We remember them to this day on different ways with memorials, statues, maquettes or with dioramas. As children we often Imagined that these monuments come alive and we could play them. Inspired by such a diorama, in Armored Heroes we commemorate the most important tank battles of World War II.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242202,"name":"Future Sense","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Time waits for no one... except you. Does that mean it's on your side?\nFind out in this episodic adventure with a time-travel twist. Use stealth, wits, and your strange experimental powers to stay one step ahead of your pursuers. Piece together the mystery of Sennin Systems and perhaps find a cure for your chronological curse.\nThe only person you can rely on is yourself - and your past is sure to catch up with you.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242201,"name":"Carrier Battles 4 Guadalcanal","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Learn World War II history with a classic hex-and-counter digital war game covering the naval-air battles of the Pacific War, in the South Pacific and Central Pacific in 1942-1943.\n\nCarrier Battles 4 Guadalcanal is a classic hex-and-counter war game covering the naval-air battles during the Pacific War in 1942-1943.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242200,"name":"Tap Rising","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Tap your way up to the unlimited height.\nThe big scary Block.K has kidnapped your princess,\nand all of the sudden, blocks started to fall from sky!\nChase the Block.K over the universe and set unbreakable record.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242199,"name":"Croquet Clash","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Play explosive real-time multiplayer croquet right from your phone!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242198,"name":"Crazy Open Car","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"The Crazy Open Car store is here!\nOrdinary cars? Luxury cars? Who cares, let's turn them into open cars!\nMake the drivers happy with their new open cars!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242197,"name":"The Journey","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Surf over 300 waves from around the world, ride boards from the top shapers and style out with well-known brands in The Journey!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242196,"name":"Racing Limits","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Racing Limits defines the mobile standards of infinite arcade type racing games. Based on racing and overtaking vehicles both in city and highway traffic, this game features 5 enjoyable modes of racing: carrier mode, infinite mode, against-time mode, free mode and a multiplayer mode. You can choose between one-way and two-way traffic and choose among three times of day periods, namely “Morning”, “Sunset” and “Night”.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242195,"name":"Sky Driver","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Afraid of heights? Don't look down. A quick game of tightrope driving along a wavy, narrow road, on a car that goes faster and faster. Steer left and right to stay on the track and don't fall down. If you think you got the nerve, think twice!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242194,"name":"Bouncing Wheel: Highway Monster","genres":[{"id":0,"name":"Sport","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Get your fastest fingers and try this quick reflexive game. Hell broke loose when your monster truck explodes and the Tires are on Mayhem on the highway. Just tap to bounce the monstrous tire away from the oncoming traffic. Stay in the game until you crash.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242193,"name":"Korean Drama Girl Adventures","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Flex your girl power in the fun new running game by Free Action Games Plus Fun Apps, Adventures of Korean Girl. In this cool new iPhone game for independent girls, you play a cute Korean girl running across a cartoon city and evading lovestruck men all dead set on getting her out for a date.\n\nUse your touch screen to control our hero in her sprint for freedom as the men surround her and chase her everywhere she goes.\nAvoid the man with the chocolates, pursing his lips for a kiss. Dodge the elegant schmuck, kneeling to offer a ring, and flee the poor, ragged sap with his fresh-picked flower as fast as your legs will carry you. Oh, and watch out for the creepy emo punk boy as he comes skidding across the street to offer his own token of love, a hideous dark collar.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242192,"name":"Pocket Rush","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Explore different continents and conquer the tracks in this fun and engaging speed challenge.\n\nFly down the straightaways but control your speed at the curves to become the master of the track! Dominate the track and leave your competitors in the dust!\nChallenge your friends and other racers to battle it out on the track, and participate in tournaments to become a Legend in the leaderboards!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242191,"name":"Bang Bang Tennis","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Get ready for... Bang Bang Tennis! A fun and crazy fast paced tennis game\nTake on the world’s best and become the Bang Bang Grand Champion in this fast paced Bash and Smash Tennis game.\n\nBang Bang tennis, a new kind of tennis, with barriers to stop the ball from going out, the goal is simple, smash the ball past your opponent.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242189,"name":"Shepherd","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Lead a small herd of sheep through the desert. Ensure their survival by managing their needs. Protect and save them from various environmental hazards, as well as their own silly decisions. Bond with them over the course of your journey by fulfilling their wishes, and be their Shepherd.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69yj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242187,"name":"Pale Cinder","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Death is not the end! Slash, dash, parkour and manipulate time in this 2d action plaformer.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69yi.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242186,"name":"Midnight Market","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Welcome to the seedy side of town, try to make money, while dodging knife fights, and running from the law.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69yh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242180,"name":"Rakuen: Deluxe Edition","genres":[],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242179,"name":"Milky Animals","genres":[{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Battle of cute animals and cute monsters Evolve into a cuter and more powerful animal with an evolution potion animal strategy game A game that anyone can enjoy","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69yb.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242176,"name":"Race Horses Champions 3","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"In this third version, Race Horses Champions comes with completely new and awesome features. Now, the player can face its friends on Multiplayer matches, and customize its character as well. The 3D graphics has been improved bringing great experiences and emotions of a horse race in a immersive environment. Managing your money and your stable, the player buys his horses, which has its own attributes, and participates in events to test their skills.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242175,"name":"Can Your Lemon","genres":[{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"'Can Your Lemon?' is a cute simulation game where your lemon is waiting for you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242174,"name":"Four: The Space Fight","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Face-to-face multi-player fun or the challenge of a single-player career mode. A carefully crafted space shooter, that stands out of others in the genre with a different approach, fast paced gameplay, and unique design.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242173,"name":"Mini Golf Space","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Enjoy 50 challenging holes of mini golf set in space. With obstacles such as anti gravity, portals, robots and lasers, you'll have plenty of fun trying to get the best score.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242172,"name":"ZokaDice","genres":[],"avg_score":0.0,"description":"ZokaDice is the game of luck and strategy. Game play is simple and familiar as offered by games like Yahtzee. Let the dice roll in this exciting game of chance and strategy. Challenge friends or meet new people from all over the world, while enjoying this great, familiar game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242171,"name":"Two Touch: Switch","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Two Touch: Switch is a new type of 3 match game.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242170,"name":"eFootball Champion Squads","genres":[{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Introducing the most famous footballers from around the world, now with photo-realistic likeness! Play at your own pace with auto matchplay and high-quality 3D graphics! Use the best players and tactics to take on world-class opponents on the pitch!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co6sad.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242168,"name":"Space Trump","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Trump is on a new quest! To explore Space! Help him navigate this vast new real estate and see how far he can spread the American Flag!!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242165,"name":"The Curse of Kubel: Deluxe Edition","genres":[{"id":0,"name":"Role-playing (RPG)","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69y3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242162,"name":"Chucky: Wanna Play?","genres":[],"avg_score":0.0,"description":"Chucky: Wanna Play? is a stealth-action video game, based on the Child's Play franchise.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69y2.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PlayStation 3"},{"id":0,"name":"Xbox 360"},{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242161,"name":"Codename: Kids Next Door - Operation: Graduates","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Operation: Graduates is the game is based on the Codename: Kids Next Door episode of the same name.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Web browser"}]},{"id":242157,"name":"One Piece Card Game Tutorial","genres":[{"id":0,"name":"Card & Board Game","games":null}],"avg_score":0.0,"description":"One Piece Card Game is a collectible card game themed on the world of One Piece!\nCharacters from all over the history of One Piece, including the anime, manga, and movies, are featured in the game, and there are even cards inspired by famous scenes from all of them!","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7k43.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242135,"name":"Bagels","genres":[],"avg_score":0.0,"description":"Bagels is a mastermind game where the player must guess the computer's code. Codes consist of three numbers. After each guess of the player, the computer answers fermi (one digit is at the right position), pico (one digit is in the code but on a different position), or bagels (none of the digits are correct). The goal is to guess the number in as few tries as possible, so players must use the answers to infer the right code.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69w8.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242118,"name":"1-900-Cult","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Under the neon shadows of Miami, a mysterious cult searches for a way to bring about an end to life- and death- as we know it. Who will stop their horrific summons?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69vk.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242111,"name":"Ra Ra Boom","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Shooter","games":null},{"id":0,"name":"Hack and slash/Beat 'em up","games":null}],"avg_score":0.0,"description":"Ra Ra Boom is a 2D, co-op beat ’em up driven by a coming-of-age narrative about a group of ninja cheerleaders from space in a fight to save the rest of humanity on Earth.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69xo.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242103,"name":"Golden Memory 2","genres":[{"id":0,"name":"Point-and-click","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"Golden Memory 2 is a re-imagining of the universe of Five Nights at Freddy's","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co7opz.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242066,"name":"Qualia/Delta","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"A in-development PC otome game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69t3.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242064,"name":"Key La Box","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"In development otome game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69t0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242063,"name":"Mekakare","genres":[{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"In development otome game.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69sy.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Android"},{"id":0,"name":"Web browser"},{"id":0,"name":"Mac"},{"id":0,"name":"PC (Microsoft Windows)"},{"id":0,"name":"iOS"}]},{"id":242048,"name":"Distant Worlds 2: Factions - Ikkuro and Dhayut","genres":[{"id":0,"name":"Strategy","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69sh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242036,"name":"Chi Ninja","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"In a world full of ninjas chi ninja will fight his way to freedom a fast pace speed runner platformer with sharp ninja moves grappling hock and ninja stars aswell as a katana will our hero survive the ninja army.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69s0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242035,"name":"Horace to the Rescue","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Horace to the Rescue is a cancelled game for the ZX Spectrum.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"ZX Spectrum"}]},{"id":242031,"name":"Scooby-Doo and a Mummy, Too!","genres":[],"avg_score":0.0,"description":"When the Egyptian exhibit at the university falls under the attack of one of its own exhibits, someone needs to step in and save the day. The Mystery Gang is on the job in another confounding conundrum, and you're here to help them out. One of the mummies has mysteriously reanimated and is doing his best to stop everyone in their tracks. Help these meddling kids while keeping an eye out for the toilet-paper tyrant — one look and he'll turn you into stone. Get on the case and dig up some concrete evidence to put this villain away.Scooby-Doo and a Mummy Too lands you in the middle of a heart-pumping adventure. Employ your reading skills to help the Mystery Gang save the day.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69rv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242030,"name":"The Little Engine That Could","genres":[],"avg_score":0.0,"description":"A Merry Engine is pulling cars filled with toys and food for the good boys and girls when it cannot go any further. The little clown asks some other Engines for help but all of them refuse to pull the train. Finally, a little Blue Engine pulls the train over the mountain with her spirit and determination, telling herself \"I think I can, I think I can, I think I can.\" Join the Little Engine on her journey and learn the importance of bravery and courage.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69ru.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242029,"name":"Thomas & Friends: Up, Up and Away! Diesel's Special Delivery","genres":[],"avg_score":0.0,"description":"Up, Up and Away! Diesel's Special Delivery is a video game that was released for Vtech's V. Reader System. It was released in 2012.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69rt.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242027,"name":"SCP-087-B Extended Edition","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"This mod expands SCP-087-B by giving it new content, such as new floors, events, monsters, and also introduces some new features","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69rq.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":242022,"name":"Guardian of Dynamite: A Bomb Protector","genres":[{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"It is a puzzle-type mini-game that slows down the time bomb in the dynamite barrel with simple key operations, simple mathematical formulas, and key input, and endures until the time the bomb is dismantled. Will you be able to save the city by holding out until the time to defuse the bomb?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69ri.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242014,"name":"Lockdown VR: Forgotten Temple","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Archaeologists claimed to have discovered an ancient temple that has been forgotten for centuries. All the tomb raiders are now trying to locate it but you seem to be the first to find it after a long search. Will you be able to find any treasures before the others arrive?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69r7.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242008,"name":"Metal War","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"This is a fast-paced top-down shooting and tower defense game. You need to customize and upgrade your chariot, build defensive structures to protect your base, explore the world and destroy all enemies! Don't forget to come back and defend when the enemy attacks! Can you make it to the end?","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69qh.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242004,"name":"Aby Escape","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"Help poor Aby, the unluckiest and clumsiest raccoon, escape from his assailants. Whether being pursued by the hunters in his native forest, by the police in town or by the bikers on Route 66.5, Aby never stops running to escape from all these dangers.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242002,"name":"X-Rush","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242001,"name":"Death Moto","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Come and experience gives you unlimited pleasure, you know!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":242000,"name":"Blight Night: You Are Not Safe","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"Video may have killed the radio star, but a supposed flu outbreak may have killed humanity leaving one man to survive the horrors of the aftermath.\nWest Texas, 1986. Sonny Barstow relished small-town life. The ever looming mystery of why he awoke seemingly untouched by the ravages of the bizarre outbreak.\nPart 1980s horror flick, part puzzle-solving adventure, Blight Night shoots for exceptional exploration and discovery — without sacrificing the splatterfest.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241999,"name":"Dungeon Creator","genres":[{"id":0,"name":"Role-playing (RPG)","games":null}],"avg_score":0.0,"description":"This is an online 2D platform game about dungeon, where you can build scenes and take adventures. You can not only design your own dungeon, but also challenge dungeons of other game players.We provide a wealth of dungeon game material. It's totally up to you to decide the layout of the entire dungeon, as well as the placement of each trap and enemy!Also you can take adventures in almost unlimited number of dungeons created by other players, plunder their treasure, and show them your super game skills!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241998,"name":"Chariot Racer","genres":[{"id":0,"name":"Racing","games":null}],"avg_score":0.0,"description":"A battle to the death!\nAvoid the monsters, bloodied spikes, flying spears, and blasts of fire as you race around the coliseum track in a battle for survival! Challenge your friends to best your time! Survive long enough and be rewarded the coveted \"3rd Star\".","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241997,"name":"Zig Zag Boom","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Control an orb ball along the zigzag path and don't hit the wall.\nTap to switch the direction! How fast can you react?\nSound simple? Challenge yourself in this amazing free arcade game!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241996,"name":"Squared: Adjacent Stones","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"In this Puzzle / Logic game you need to convert enough stones from the field to win the level. The amount of necessary stones will vary and there is an AI Opponent who will try to out-play you. You can only move in straight lines from stones that you already control. Stones that you move over, will fall into your control.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241995,"name":"The Track Star","genres":[{"id":0,"name":"Racing","games":null},{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Are you the new drag strip champion? Take your talents to the track and race in the high stakes drag race.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241993,"name":"Cross or Crash","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"A unique puzzle game never seen before!\nGet the exact timing on the congested road so that characters do not crash with each other and fire!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241992,"name":"Harvest Season: Sudoku Puzzle","genres":[{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"If you love classic sudoku, mixed with innovative puzzle elements, you are in the right place!\nWelcome to Harvest Season, the game that will forever change the way you play Sudoku!\nEmbark on an exciting journey with Abi and her fruit buddies as they travel through a beautifully crafted world and solve addictive puzzles!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241991,"name":"Cat Cafe: Dessert Panic","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Cat Cafe Dessert Panic! Is an action-adventure game where you, as Pera, are the waitress at a cafe for cats. The cats are excited to eat, and they'll do anything to get in your way. Do not drop the desserts or it's game over!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241990,"name":"Lunar Laser","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Tap to push you through space. Avoid all lasers and obstacles and collect as many stars as you can.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241989,"name":"Shapey Heads","genres":[{"id":0,"name":"Arcade","games":null}],"avg_score":0.0,"description":"Welcome to the colorful 8-bit world of Shapey Heads!\nTap the screen to switch the shape of your head to avoid all of the traps and obstacles!\nCollect coins to open up secret boxes that will let you play with over 40 of the craziest characters through 5 different challenging worlds.\nRun as long as you can to improve your high score and climb the leaderboards!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241988,"name":"Cyber Lust","genres":[{"id":0,"name":"Simulator","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Cyber Lust is an adult game set in a cyberpunk world.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69pl.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241975,"name":"Dino Fighters","genres":[{"id":0,"name":"Fighting","games":null}],"avg_score":0.0,"description":"A fighting game featuring chibi dinosaurs, developed for Sega Genesis using Hamoopig & SGDK, by Juca Jacaré","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69oj.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"Sega Mega Drive/Genesis"}]},{"id":241967,"name":"Monster Prom 3: Monster Roadtrip - Hitchhiker Pack: Vicky & Brian","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Visual Novel","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69o0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241966,"name":"Blood and Zombies: Gold Edition","genres":[{"id":0,"name":"Shooter","games":null}],"avg_score":0.0,"description":"Sin descripción","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69ny.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241965,"name":"Mine Shaft","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Indie","games":null},{"id":0,"name":"Strategy","games":null}],"avg_score":0.0,"description":"Addictive mining game where players dig deeper into the earth to find valuable minerals and upgrade their equipment. Beware of earthquakes that can damage your mine, and use explosives strategically to clear your way.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69nx.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241961,"name":"Atlas Fallen: Signature Edition","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Atlas Fallen: Signature Edition is a Focus Entertainment Store exclusive product, strictly limited to 100 copies worldwide. It includes an exclusive artwork by the game's Senior Concept Artist Janine Bertet alongside Art Director James Lowe as a numbered laminated wooden frame (artwork printed on wood), a certificate of authenticity hand-signed by the artist, a digital or a physical copy of the game for the platform of your choice using James Lowe’s artwork as an exclusive box art and the Ruin Rising Pack DLC.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69nv.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241955,"name":"Vallen","genres":[{"id":0,"name":"Indie","games":null},{"id":0,"name":"Simulator","games":null}],"avg_score":0.0,"description":"Space combat on a massive scale. Defend your allies, destroy the Xeris and claim victory for the Vallen! Your people need you, fly your ship in an intense battle in an asteroid field to secure the sector.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69no.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241953,"name":"Twinsen's Little Big Adventure Remastered 2","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Puzzle","games":null}],"avg_score":0.0,"description":"Built from the ground up, enjoy new breathtaking visuals, enhanced music and improved, deeper gameplay as Twinsen's Little Big Adventure 2 - Remastered reignites the original LBA2/Twinsen's Odyssey game using the latest next-generation technology.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69nm.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241890,"name":"Sandoria","genres":[{"id":0,"name":"Adventure","games":null},{"id":0,"name":"Platform","games":null},{"id":0,"name":"Indie","games":null}],"avg_score":0.0,"description":"This is a 2D platformer with a conditionally infinite procedurally generated world. A very deep and varied world full of interesting and dangerous things to explore.","imageUrl":"https://images.igdb.com/igdb/image/upload/t_cover_big/co69l0.jpg","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[{"id":0,"name":"PC (Microsoft Windows)"}]},{"id":241874,"name":"JetMan Galactic","genres":[],"avg_score":0.0,"description":"Jetman Galactic is part of a 3 game series coming to iOS telling the story of earths last action hero.","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241873,"name":"Dark Walk","genres":[],"avg_score":0.0,"description":"Close your eyes, let the sound guides you cross the adventure. In this app, you need to draw the correct path according to the different sounds. Try it!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241872,"name":"Diver Dash","genres":[{"id":0,"name":"Arcade","games":null},{"id":0,"name":"Sport","games":null}],"avg_score":0.0,"description":"Diver Dash is a fast-paced scrolling arcade game where you avoid sharks and mines on your endless descent to the ocean floor. Press the screen to stop the obstacles and dash through the gaps.\nCompete with your Game Center friends and collect coins and clams to unlock all the wacky characters and themes. What are you waiting for? Dive in today!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]},{"id":241871,"name":"Iron Kill","genres":[{"id":0,"name":"Adventure","games":null}],"avg_score":0.0,"description":"Like robots, battlebots, robot fighting games? Then Iron Kill is for you!","imageUrl":"Sin imagen","releaseYear":-1,"developers":[],"libraryGames":null,"platforms":[]}]